
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.0   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501306004725
         Licensed to:  Miklos Koren
                       Central European University

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

. do convergence red 

. clear

. set more off

. capture log close

. log using results/`1'.log, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/red.log
  log type:  text
 opened on:   8 Oct 2014, 23:19:12

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St13897.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St13897.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_5km_ right_5km_ left_10km_ right_10km_, i(bridge
> ) j(year)
  7.         foreach X in left_5km right_5km left_10km right_10km {
  8.                 ren `X'_ `X'
  9.         }
 10.         append using `rivers'
 11.         save `rivers', replace
 12. }
red
(445 vars, 126 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899)
. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =      23861
                                                  F(  61,    144) =     100.06
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2092
                                                  Adj R-squared   =     0.2035
                                                  Root MSE        =     0.2043

                        (Std. Err. adjusted for 145 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0604608    .033837     1.79   0.076    -.0064206    .1273422
 treatment71 |   .0703912   .0327648     2.15   0.033     .0056292    .1351532
 treatment72 |     .10391     .04875     2.13   0.035      .007552    .2002681
 treatment73 |   .0889447   .0347772     2.56   0.012     .0202049    .1576845
 treatment74 |   .0924603   .0365107     2.53   0.012     .0202942    .1646265
 treatment75 |    .090029   .0360981     2.49   0.014     .0186783    .1613797
 treatment76 |   .0861158   .0361564     2.38   0.019     .0146499    .1575817
 treatment77 |   .0935548    .037184     2.52   0.013     .0200577    .1670518
 treatment78 |   .0876059   .0368222     2.38   0.019      .014824    .1603878
 treatment79 |   .0836344   .0368778     2.27   0.025     .0107427    .1565262
 treatment80 |   .1041435   .0412542     2.52   0.013     .0226015    .1856855
 treatment81 |   .0838908   .0365637     2.29   0.023       .01162    .1561617
 treatment82 |   .0860136   .0368448     2.33   0.021     .0131871    .1588401
 treatment83 |    .080286   .0363431     2.21   0.029     .0084512    .1521209
 treatment84 |    .085034   .0358576     2.37   0.019     .0141587    .1559093
 treatment85 |   .0670654   .0339673     1.97   0.050    -.0000736    .1342044
 treatment86 |   .0640337    .034247     1.87   0.064    -.0036582    .1317256
 treatment87 |    .060205   .0339975     1.77   0.079    -.0069936    .1274035
 treatment88 |   .0588662   .0342407     1.72   0.088    -.0088132    .1265456
 treatment89 |   .0518744   .0344315     1.51   0.134    -.0161821    .1199308
 treatment90 |   .0593851   .0334518     1.78   0.078    -.0067349     .125505
 treatment91 |   .0555396    .033978     1.63   0.104    -.0116204    .1226996
 treatment92 |   .0460749   .0336723     1.37   0.173     -.020481    .1126308
 treatment93 |   .0495971   .0336695     1.47   0.143    -.0169532    .1161474
 treatment94 |    .049177   .0342807     1.43   0.154    -.0185813    .1169353
 treatment95 |   .0502931   .0349116     1.44   0.152    -.0187122    .1192985
 treatment96 |   .0444943    .035425     1.26   0.211     -.025526    .1145145
 treatment97 |   .0436315   .0357469     1.22   0.224    -.0270249    .1142879
 treatment98 |   .0458688   .0359324     1.28   0.204    -.0251543     .116892
 treatment99 |   .0402671    .036416     1.11   0.271     -.031712    .1122461
treatment100 |   .0419733   .0352101     1.19   0.235     -.027622    .1115686
treatment101 |   .0634142   .0332501     1.91   0.058    -.0023071    .1291355
treatment102 |   .0702849   .0330965     2.12   0.035     .0048671    .1357027
treatment103 |   .0698449   .0324191     2.15   0.033     .0057661    .1339237
treatment104 |   .0670181   .0314652     2.13   0.035     .0048248    .1292114
treatment105 |   .0691344   .0323875     2.13   0.034     .0051181    .1331507
treatment106 |   .0674985    .032292     2.09   0.038      .003671     .131326
treatment107 |   .0614089   .0326006     1.88   0.062    -.0030286    .1258465
treatment108 |   .0575844   .0323718     1.78   0.077     -.006401    .1215697
treatment109 |   .0648826   .0354726     1.83   0.069    -.0052316    .1349967
treatment110 |   .0670204   .0366187     1.83   0.069    -.0053593    .1394001
treatment111 |   .0673586   .0370438     1.82   0.071    -.0058612    .1405783
treatment112 |   .0648101   .0391786     1.65   0.100    -.0126294    .1422496
treatment113 |   .0647366   .0401978     1.61   0.109    -.0147173    .1441905
treatment114 |   .0615484   .0414925     1.48   0.140    -.0204645    .1435614
treatment115 |   .0567631   .0413408     1.37   0.172    -.0249502    .1384764
treatment116 |   .0469595   .0420979     1.12   0.267    -.0362503    .1301692
treatment117 |   .0488841   .0440725     1.11   0.269    -.0382284    .1359967
treatment118 |   .0400668   .0438725     0.91   0.363    -.0466506    .1267841
treatment119 |   .0427306   .0435567     0.98   0.328    -.0433625    .1288237
treatment120 |   .0467435   .0465575     1.00   0.317    -.0452809    .1387678
treatment121 |   .0465826   .0469892     0.99   0.323    -.0462951    .1394603
treatment122 |   .0500703   .0475303     1.05   0.294    -.0438769    .1440175
treatment123 |   .0586296   .0378108     1.55   0.123    -.0161063    .1333656
treatment124 |   .0480278   .0392699     1.22   0.223    -.0295922    .1256478
treatment125 |   .0423039   .0394375     1.07   0.285    -.0356474    .1202551
treatment126 |   .0343577   .0401978     0.85   0.394    -.0450963    .1138118
treatment127 |    .023934   .0436507     0.55   0.584    -.0623449    .1102128
treatment128 |   .0204315   .0467813     0.44   0.663    -.0720352    .1128983
treatment129 |   .0129113   .0532382     0.24   0.809     -.092318    .1181406
treatment130 |   .0234993   .0574007     0.41   0.683    -.0899576    .1369562
       _cons |   .1350812   .0094783    14.25   0.000     .1163466    .1538158
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(23861 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(627 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(57 real changes made)
(54 real changes made)
(54 real changes made)
(54 real changes made)
(53 real changes made)
(51 real changes made)
(50 real changes made)
(50 real changes made)
(50 real changes made)
(49 real changes made)
(49 real changes made)
(47 real changes made)
(47 real changes made)
(47 real changes made)
(47 real changes made)
(46 real changes made)
(45 real changes made)
(45 real changes made)
(42 real changes made)
(37 real changes made)
(36 real changes made)
(35 real changes made)
(33 real changes made)
(32 real changes made)
(30 real changes made)
(29 real changes made)
(28 real changes made)
(27 real changes made)
(27 real changes made)
(27 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(24 real changes made)
(23 real changes made)
(23 real changes made)
(22 real changes made)
(20 real changes made)
(19 real changes made)
(16 real changes made)
(81 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
