
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501306004724
         Licensed to:  Miklos Koren
                       Central European University
(343 vars, 128 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899 1900 1901 1902 1903 1904 1905 1906 1907 1908 1909 1910 19
> 11 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 1924 1925 1926
>  1927 1928 1929 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 1940 1941 1
> 942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 195
> 7 1958 1959)

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

. do convergence tennessee 

. clear

. set more off

. capture log close

. log using results/`1'.log, text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/Home/Dropbox/projects/borders/bridges/research_designs/co
> nvergence/results/tennessee.log
  log type:  text
 opened on:   6 Oct 2014, 09:24:57

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06385.000001 no
> t found)
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06385.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
tennessee
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
(343 vars, 75 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899 1900 1901 1902 1903 1904 1905 1906 1907 1908 1909 1910 19
> 11 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 1924 1925 1926
>  1927 1928 1929 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 1940 1941 1
> 942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 195
> 7 1958 1959)
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(10642 missing values generated)

. gen log_large = ln(large)
(9113 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(9017 missing values generated)

. replace small_share=0 if total==0
(9017 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(9017 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(107 missing values generated)

. gen lag_deviation = L1.deviation
(107 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)
note: treatment129 omitted because of collinearity
note: treatment130 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =      11694
                                                  F(  34,     68) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.1734
                                                  Adj R-squared   =     0.1612
                                                  Root MSE        =     0.1412

                         (Std. Err. adjusted for 69 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |  -.0264448   .0132329    -2.00   0.050    -.0528506    -.000039
 treatment71 |  -.0304042   .0156204    -1.95   0.056    -.0615742    .0007658
 treatment72 |  -.0319671   .0158739    -2.01   0.048    -.0636431   -.0002911
 treatment73 |  -.0399352   .0191716    -2.08   0.041    -.0781916   -.0016789
 treatment74 |  -.0446286    .021483    -2.08   0.042    -.0874973     -.00176
 treatment75 |  -.0475286   .0232299    -2.05   0.045    -.0938832   -.0011741
 treatment76 |  -.0539186    .025134    -2.15   0.036    -.1040726   -.0037645
 treatment77 |  -.0613196   .0229752    -2.67   0.010    -.1071659   -.0154734
 treatment78 |   -.062907   .0250072    -2.52   0.014    -.1128081    -.013006
 treatment79 |  -.0677059   .0267773    -2.53   0.014    -.1211392   -.0142726
 treatment80 |  -.0799911   .0271844    -2.94   0.004    -.1342368   -.0257455
 treatment81 |  -.0818734   .0279741    -2.93   0.005    -.1376948    -.026052
 treatment82 |  -.0870779   .0299548    -2.91   0.005    -.1468518   -.0273039
 treatment83 |   -.097034   .0332651    -2.92   0.005    -.1634135   -.0306545
 treatment84 |  -.1049905   .0363301    -2.89   0.005    -.1774862   -.0324948
 treatment85 |  -.1062339    .037477    -2.83   0.006    -.1810181   -.0314497
 treatment86 |   -.110984   .0388289    -2.86   0.006    -.1884659   -.0335022
 treatment87 |  -.1153306   .0398461    -2.89   0.005    -.1948423    -.035819
 treatment88 |  -.1216268   .0421831    -2.88   0.005    -.2058019   -.0374517
 treatment89 |  -.1221998   .0427859    -2.86   0.006    -.2075776   -.0368219
 treatment90 |  -.1262845   .0448231    -2.82   0.006    -.2157276   -.0368415
 treatment91 |  -.1321562   .0466382    -2.83   0.006    -.2252213   -.0390912
 treatment92 |  -.1340704   .0474723    -2.82   0.006    -.2287998   -.0393409
 treatment93 |  -.1410236   .0501408    -2.81   0.006    -.2410781   -.0409691
 treatment94 |  -.1415212   .0499917    -2.83   0.006     -.241278   -.0417643
 treatment95 |  -.1439212   .0509372    -2.83   0.006    -.2455648   -.0422776
 treatment96 |  -.1468218   .0527226    -2.78   0.007    -.2520282   -.0416155
 treatment97 |   .0142037   .1160469     0.12   0.903    -.2173643    .2457718
 treatment98 |   .0124592   .1148979     0.11   0.914    -.2168161    .2417345
 treatment99 |  -.1220971   .0653802    -1.87   0.066    -.2525613    .0083671
treatment100 |  -.1351324   .0679247    -1.99   0.051    -.2706739    .0004092
treatment101 |  -.1402875   .0685424    -2.05   0.045    -.2770617   -.0035133
treatment102 |  -.0498066   .0207532    -2.40   0.019     -.091219   -.0083941
treatment103 |   -.064093   .0228062    -2.81   0.006    -.1096021   -.0185838
treatment104 |  -.0733266   .0242189    -3.03   0.003    -.1216546   -.0249985
treatment105 |  -.0828029   .0254858    -3.25   0.002     -.133659   -.0319467
treatment106 |  -.0876254   .0256238    -3.42   0.001    -.1387569   -.0364939
treatment107 |  -.0862388   .0226574    -3.81   0.000    -.1314509   -.0410267
treatment108 |  -.0862715    .022665    -3.81   0.000    -.1314988   -.0410442
treatment109 |  -.0957998   .0242922    -3.94   0.000    -.1442742   -.0473255
treatment110 |  -.1148776   .0275994    -4.16   0.000    -.1699514   -.0598038
treatment111 |  -.1204736   .0275057    -4.38   0.000    -.1753602   -.0655869
treatment112 |  -.1265092   .0284938    -4.44   0.000    -.1833676   -.0696508
treatment113 |   -.137205   .0289703    -4.74   0.000    -.1950144   -.0793956
treatment114 |  -.1554029   .0282815    -5.49   0.000    -.2118378   -.0989679
treatment115 |  -.1562601   .0277489    -5.63   0.000    -.2116322   -.1008881
treatment116 |  -.1597695   .0271946    -5.88   0.000    -.2140354   -.1055036
treatment117 |  -.1546603   .0259097    -5.97   0.000    -.2063623   -.1029583
treatment118 |  -.1726323   .0264045    -6.54   0.000    -.2253217   -.1199428
treatment119 |  -.1724087   .0266314    -6.47   0.000    -.2255507   -.1192666
treatment120 |  -.1898084   .0285833    -6.64   0.000    -.2468455   -.1327713
treatment121 |  -.1893968   .0285048    -6.64   0.000    -.2462772   -.1325164
treatment122 |  -.1953449    .028606    -6.83   0.000    -.2524274   -.1382625
treatment123 |  -.1987398   .0288599    -6.89   0.000    -.2563288   -.1411508
treatment124 |  -.2006396   .0291658    -6.88   0.000     -.258839   -.1424402
treatment125 |  -.2018691   .0297069    -6.80   0.000    -.2611482     -.14259
treatment126 |  -.2079278   .0297376    -6.99   0.000    -.2672682   -.1485874
treatment127 |  -.2244562   .0299924    -7.48   0.000    -.2843052   -.1646072
treatment128 |  -.2299645   .0307594    -7.48   0.000     -.291344   -.1685851
treatment129 |          0  (omitted)
treatment130 |          0  (omitted)
       _cons |   .0454229   .0082725     5.49   0.000     .0289153    .0619305
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(11694 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(33 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)
note: _IaftXlag_d_1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =      11587
                                                  F(   2,     68) =      17.83
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0243
                                                  Adj R-squared   =     0.0149
                                                  Root MSE        =     0.0434

                         (Std. Err. adjusted for 69 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   .0115144   .0021072     5.46   0.000     .0073096    .0157193
lag_deviat~n |  -.0330463   .0063177    -5.23   0.000    -.0456532   -.0204394
_IaftXlag_~1 |          0  (omitted)
       _cons |   .0129904   .0028787     4.51   0.000     .0072461    .0187347
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(150 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(11544 missing values generated)

. gen lower = small_share_hat - 1.96*se
(11544 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/red.gph saved)

. 
. capture log close

. 
end of do-file

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       75   ->   12750
Number of variables                 345   ->       8
j variable (170 values)                   ->   year
xij variables:
      left_1790 left_1791 ... left_1959   ->   left_
   right_1790 right_1791 ... right_1959   ->   right_
-----------------------------------------------------------------------------
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06385.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1959
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(8160 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start+offset
(8160 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(2769 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(3985 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(90 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(59 real changes made)

. 
. forval t = 70/130 {
  2.         gen byte treatment`t' = (event_time==`t')
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(3713 missing values generated)

. gen log_large = ln(large)
(2467 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(2329 missing values generated)

. replace small_share=0 if total==0
(2329 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(2329 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(57 missing values generated)

. gen lag_deviation = L1.deviation
(57 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       5996
                                                  F(  35,     37) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.2095
                                                  Adj R-squared   =     0.1863
                                                  Root MSE        =     0.2049

                         (Std. Err. adjusted for 38 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0191112    .107512     0.18   0.860    -.1987288    .2369513
 treatment71 |   .0121172   .1127511     0.11   0.915    -.2163382    .2405725
 treatment72 |   .0118709   .1126685     0.11   0.917    -.2164172     .240159
 treatment73 |   .0054126   .1116861     0.05   0.962    -.2208848      .23171
 treatment74 |   .0013464    .113324     0.01   0.991      -.22827    .2309627
 treatment75 |   .0002179   .1118844     0.00   0.998    -.2264814    .2269172
 treatment76 |   .0000411   .1122681     0.00   1.000    -.2274356    .2275178
 treatment77 |  -.0090645   .1138062    -0.08   0.937    -.2396578    .2215287
 treatment78 |   -.012486   .1140703    -0.11   0.913    -.2436143    .2186423
 treatment79 |   -.019804   .1127745    -0.18   0.862    -.2483067    .2086988
 treatment80 |  -.0216315   .1119852    -0.19   0.848     -.248535     .205272
 treatment81 |  -.0249016   .1129808    -0.22   0.827    -.2538225    .2040193
 treatment82 |  -.0342808   .1086927    -0.32   0.754    -.2545131    .1859515
 treatment83 |  -.0362798   .1096627    -0.33   0.743    -.2584775     .185918
 treatment84 |  -.0398038    .111153    -0.36   0.722    -.2650213    .1854136
 treatment85 |  -.0146831   .1023824    -0.14   0.887    -.2221295    .1927633
 treatment86 |    .023745   .1058283     0.22   0.824    -.1906836    .2381735
 treatment87 |   .0169044   .1053162     0.16   0.873    -.1964863    .2302952
 treatment88 |   .0126733   .1066852     0.12   0.906    -.2034914     .228838
 treatment89 |   .0322586   .1136761     0.28   0.778    -.1980711    .2625882
 treatment90 |   .0246341   .1143417     0.22   0.831    -.2070443    .2563125
 treatment91 |   .0081851   .1143913     0.07   0.943    -.2235936    .2399638
 treatment92 |   .0062204   .1161727     0.05   0.958    -.2291678    .2416087
 treatment93 |  -.0183252   .1030301    -0.18   0.860     -.227084    .1904336
 treatment94 |  -.0220321   .1032208    -0.21   0.832    -.2311773     .187113
 treatment95 |  -.0231303   .1042984    -0.22   0.826     -.234459    .1881983
 treatment96 |  -.0225582   .1041201    -0.22   0.830    -.2335256    .1884092
 treatment97 |  -.0215285   .1048159    -0.21   0.838    -.2339056    .1908486
 treatment98 |  -.0256844   .1053157    -0.24   0.809    -.2390741    .1877054
 treatment99 |    -.01074   .0985542    -0.11   0.914    -.2104298    .1889498
treatment100 |   .0099512   .1031791     0.10   0.924    -.1991095    .2190119
treatment101 |   .0119913   .1030463     0.12   0.908    -.1968003    .2207829
treatment102 |    .013911   .1085574     0.13   0.899    -.2060471    .2338692
treatment103 |   .0455814    .094497     0.48   0.632    -.1458877    .2370505
treatment104 |    .027744   .0822477     0.34   0.738    -.1389057    .1943938
treatment105 |   .0268476   .0832054     0.32   0.749    -.1417426    .1954378
treatment106 |   .0167808   .0830416     0.20   0.841    -.1514774    .1850389
treatment107 |   .0206581   .0803563     0.26   0.799    -.1421593    .1834755
treatment108 |   .0184077    .081725     0.23   0.823    -.1471829    .1839982
treatment109 |   .0108225   .0815749     0.13   0.895    -.1544639     .176109
treatment110 |   .0104102   .0820133     0.13   0.900    -.1557646     .176585
treatment111 |   .0337537   .0687996     0.49   0.627    -.1056475    .1731549
treatment112 |   .0336012   .0693061     0.48   0.631    -.1068262    .1740286
treatment113 |   .0473307   .0798916     0.59   0.557    -.1145451    .2092064
treatment114 |   .0557248   .0625203     0.89   0.379    -.0709533    .1824029
treatment115 |   .0495051   .0626224     0.79   0.434    -.0773799    .1763902
treatment116 |   .0473539   .0617736     0.77   0.448    -.0778112     .172519
treatment117 |   .0492818   .0581017     0.85   0.402    -.0684433     .167007
treatment118 |   .0469572   .0587738     0.80   0.429    -.0721299    .1660443
treatment119 |    .038263   .0583899     0.66   0.516    -.0800462    .1565722
treatment120 |   .0337205   .0575168     0.59   0.561    -.0828195    .1502606
treatment121 |   .0562991   .0605519     0.93   0.359    -.0663907    .1789889
treatment122 |   .0639502    .056256     1.14   0.263    -.0500353    .1779358
treatment123 |   .0716322    .069281     1.03   0.308    -.0687444    .2120087
treatment124 |   .0773726   .0775945     1.00   0.325    -.0798489     .234594
treatment125 |   .0567815   .0826052     0.69   0.496    -.1105925    .2241556
treatment126 |   .0470632   .0844043     0.56   0.580     -.123956    .2180825
treatment127 |    .037558   .0895398     0.42   0.677    -.1438668    .2189827
treatment128 |   .0327551   .0913672     0.36   0.722    -.1523724    .2178826
treatment129 |   .0250776   .0967737     0.26   0.797    -.1710045    .2211597
treatment130 |  -.0095763   .0932339    -0.10   0.919     -.198486    .1793335
       _cons |   .1477863   .0203493     7.26   0.000     .1065546     .189018
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(5996 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(99 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(66 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       5939
                                                  F(   3,     37) =      22.43
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0391
                                                  Adj R-squared   =     0.0207
                                                  Root MSE        =     0.0591

                         (Std. Err. adjusted for 38 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0021035    .003126    -0.67   0.505    -.0084375    .0042304
lag_deviat~n |   -.039931   .0068364    -5.84   0.000    -.0537829   -.0260792
_IaftXlag_~1 |   .0071815   .0107267     0.67   0.507    -.0145529    .0289159
       _cons |   .0110551   .0026562     4.16   0.000     .0056733     .016437
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(668 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(5328 missing values generated)

. gen lower = small_share_hat - 1.96*se
(5328 missing values generated)


Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      128   ->   21760
Number of variables                 345   ->       8
j variable (170 values)                   ->   year
xij variables:
      left_1790 left_1791 ... left_1959   ->   left_
   right_1790 right_1791 ... right_1959   ->   right_
-----------------------------------------------------------------------------
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06381.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1959
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(16830 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start+offset
(16830 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(2857 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(7384 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(110 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(0 real changes made)

. 
. forval t = 70/130 {
  2.         gen byte treatment`t' = (event_time==`t')
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(11206 missing values generated)

. gen log_large = ln(large)
(10484 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(10457 missing values generated)

. replace small_share=0 if total==0
(10457 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(10457 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(110 missing values generated)

. gen lag_deviation = L1.deviation
(110 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))
. 
end of do-file

. do estimate_and_plot


. 
end of do-file

. graph save results/`1'.gph, replace
(file results/tennessee.gph saved)

. 
. capture log close

. 
end of do-file
. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =      11519
                                                  F(  20,     71) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.2441
                                                  Adj R-squared   =     0.2327
                                                  Root MSE        =     0.0772

                         (Std. Err. adjusted for 72 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   -.000037   .0014356    -0.03   0.980    -.0028995    .0028255
 treatment71 |  -.0008607    .002947    -0.29   0.771    -.0067369    .0050154
 treatment72 |   .0001625   .0019274     0.08   0.933    -.0036807    .0040057
 treatment73 |  -.0012413   .0035366    -0.35   0.727     -.008293    .0058104
 treatment74 |   -.002694   .0046053    -0.58   0.560    -.0118766    .0064887
 treatment75 |  -.0026279   .0045789    -0.57   0.568     -.011758    .0065021
 treatment76 |  -.0040305   .0066425    -0.61   0.546    -.0172752    .0092143
 treatment77 |   -.005951   .0082995    -0.72   0.476    -.0224996    .0105977
 treatment78 |  -.0065508   .0082592    -0.79   0.430    -.0230192    .0099176
 treatment79 |   .0352172   .0462457     0.76   0.449    -.0569941    .1274285
 treatment80 |    .034549   .0471925     0.73   0.467    -.0595503    .1286483
 treatment81 |   .0343564   .0469263     0.73   0.466     -.059212    .1279248
 treatment82 |    .035279   .0465924     0.76   0.451    -.0576236    .1281816
 treatment83 |    .032495   .0475652     0.68   0.497    -.0623473    .1273373
 treatment84 |   .0304911    .046792     0.65   0.517    -.0628095    .1237917
 treatment85 |   .0475061   .0605791     0.78   0.436    -.0732853    .1682975
 treatment86 |   .0461444   .0609995     0.76   0.452    -.0754851     .167774
 treatment87 |   .0875928    .070098     1.25   0.216    -.0521787    .2273642
 treatment88 |    .084049   .0682565     1.23   0.222    -.0520507    .2201486
 treatment89 |   .0814469   .0684467     1.19   0.238     -.055032    .2179259
 treatment90 |   .0761609   .0683248     1.11   0.269    -.0600749    .2123967
 treatment91 |   .0729068   .0680233     1.07   0.287    -.0627278    .2085414
 treatment92 |   .0693761   .0687298     1.01   0.316    -.0676672    .2064194
 treatment93 |   .0628181   .0688236     0.91   0.364    -.0744123    .2000484
 treatment94 |   .0287787   .0647621     0.44   0.658    -.1003533    .1579106
 treatment95 |   .0271642    .063851     0.43   0.672    -.1001511    .1544796
 treatment96 |   .0893371   .0725182     1.23   0.222      -.05526    .2339343
 treatment97 |   .0816942   .0718749     1.14   0.260    -.0616203    .2250086
 treatment98 |   .0769277   .0708541     1.09   0.281    -.0643514    .2182069
 treatment99 |   .0653972   .0668811     0.98   0.331    -.0679599    .1987542
treatment100 |   .1736294   .1081205     1.61   0.113    -.0419568    .3892156
treatment101 |    .143455   .1114639     1.29   0.202    -.0787978    .3657077
treatment102 |   .1104019   .1210323     0.91   0.365    -.1309296    .3517335
treatment103 |   .0990688   .1193369     0.83   0.409    -.1388822    .3370199
treatment104 |  -.0215543   .0565058    -0.38   0.704    -.1342236     .091115
treatment105 |  -.0048221   .0637919    -0.08   0.940    -.1320195    .1223753
treatment106 |    .180485   .1050381     1.72   0.090    -.0289551     .389925
treatment107 |   .0780117   .1136259     0.69   0.495    -.1485519    .3045754
treatment108 |   .0697797    .112529     0.62   0.537    -.1545967    .2941562
treatment109 |   .0722362   .1123418     0.64   0.522    -.1517669    .2962393
treatment110 |   .0573291   .1113105     0.52   0.608    -.1646178     .279276
treatment111 |  -.0403992   .0263127    -1.54   0.129    -.0928653    .0120668
treatment112 |   -.042932    .028032    -1.53   0.130    -.0988262    .0129621
treatment113 |  -.0513895   .0320778    -1.60   0.114    -.1153508    .0125719
treatment114 |  -.0601379   .0353576    -1.70   0.093    -.1306389    .0103632
treatment115 |  -.0598766   .0350855    -1.71   0.092    -.1298352     .010082
treatment116 |  -.0801515   .0398664    -2.01   0.048    -.1596428   -.0006602
treatment117 |  -.0463913    .015755    -2.94   0.004    -.0778059   -.0149766
treatment118 |  -.0483303   .0155122    -3.12   0.003    -.0792608   -.0173999
treatment119 |  -.0499506    .015161    -3.29   0.002    -.0801807   -.0197205
treatment120 |   .9487423   .0166627    56.94   0.000     .9155179    .9819667
treatment121 |   .9421134   .0168536    55.90   0.000     .9085084    .9757184
treatment122 |   .9416573   .0169204    55.65   0.000      .907919    .9753955
treatment123 |   .9401524   .0167346    56.18   0.000     .9067845    .9735202
treatment124 |   .9305532   .0186745    49.83   0.000     .8933173    .9677892
treatment125 |   .9251964   .0187938    49.23   0.000     .8877226    .9626702
treatment126 |   .9201998   .0218281    42.16   0.000     .8766757    .9637238
treatment127 |   .9063554   .0217856    41.60   0.000     .8629161    .9497946
treatment128 |    .892448   .0225894    39.51   0.000      .847406      .93749
treatment129 |     .89325   .0224347    39.82   0.000     .8485166    .9379835
treatment130 |    .868113   .0248523    34.93   0.000     .8185589    .9176672
       _cons |   .0114988   .0034841     3.30   0.002     .0045517     .018446
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(11519 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(121 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(10 real changes made)
(10 real changes made)
(10 real changes made)
(10 real changes made)
(10 real changes made)
(10 real changes made)
(10 real changes made)
(9 real changes made)
(8 real changes made)
(8 real changes made)
(7 real changes made)
(6 real changes made)
(6 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =      11409
                                                  F(   3,     71) =       3.58
                                                  Prob > F        =     0.0180
                                                  R-squared       =     0.0364
                                                  Adj R-squared   =     0.0268
                                                  Root MSE        =     0.0306

                         (Std. Err. adjusted for 72 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   -.021832   .0118875    -1.84   0.070     -.045535     .001871
lag_deviat~n |  -.0283406   .0133089    -2.13   0.037    -.0548779   -.0018033
_IaftXlag_~1 |   -.027152   .0279474    -0.97   0.335    -.0828775    .0285735
       _cons |   .0126395   .0064085     1.97   0.052    -.0001387    .0254176
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(530 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(10989 missing values generated)

. gen lower = small_share_hat - 1.96*se
(10989 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/snake.gph saved)

. 
. capture log close

. 
end of do-file
