-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/arkansas.log
  log type:  text
 opened on:   2 Jul 2014, 16:34:56

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54511.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54511.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
arkansas
(37 vars, 145 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      145   ->    2465
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54511.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(1207 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(1207 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(717 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(774 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(21 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(0 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(808 missing values generated)

. gen log_large = ln(large)
(651 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(648 missing values generated)

. replace small_share=0 if total==0
(648 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(648 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(92 missing values generated)

. gen lag_deviation = L10.deviation
(92 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        974
                                                  F(   7,     49) =       9.19
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2677
                                                  Adj R-squared   =     0.2539
                                                  Root MSE        =     0.1421

                         (Std. Err. adjusted for 50 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0255507   .0576884     0.44   0.660    -.0903784    .1414798
 treatment80 |  -.0013718   .0734737    -0.02   0.985    -.1490228    .1462791
 treatment90 |  -.0476066   .0773724    -0.62   0.541    -.2030922    .1078791
treatment100 |  -.0562534    .090634    -0.62   0.538    -.2383892    .1258824
treatment110 |   .1047343   .0795167     1.32   0.194    -.0550605    .2645291
treatment120 |    .152541    .103486     1.47   0.147     -.055422    .3605039
treatment130 |    .131594   .1721478     0.76   0.448      -.21435     .477538
       _cons |   .0676272   .0104632     6.46   0.000     .0466005    .0886539
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*treatment130 = 0

       F(  1,    49) =    1.22
            Prob > F =    0.2739

. predict small_share_hat, xb

. gen se = .
(974 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(21 real changes made)
(21 real changes made)
(21 real changes made)
(10 real changes made)
(5 real changes made)
(2 real changes made)

. replace se = _se[_cons] if event_time==70
(42 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        882
                                                  F(   3,     49) =       5.06
                                                  Prob > F        =     0.0039
                                                  R-squared       =     0.1451
                                                  Adj R-squared   =     0.1323
                                                  Root MSE        =     0.1140

                         (Std. Err. adjusted for 50 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   -.038868   .0520087    -0.75   0.458    -.1433835    .0656475
lag_deviat~n |  -.2881081   .0741663    -3.88   0.000    -.4371508   -.1390653
_IaftXlag_~1 |   .0261201   .1497595     0.17   0.862    -.2748329    .3270731
       _cons |   .1057154   .0305864     3.46   0.001     .0442498     .167181
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(122 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(852 missing values generated)

. gen lower = small_share_hat - 1.96*se
(852 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/arkansas.gph saved)

. 
. capture log close
