-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/colorado.log
  log type:  text
 opened on:   2 Jul 2014, 16:34:56

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54517.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54517.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
colorado
(37 vars, 159 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      159   ->    2703
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54517.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(2363 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(2363 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(204 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(802 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(5 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(0 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(1689 missing values generated)

. gen log_large = ln(large)
(1599 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(1598 missing values generated)

. replace small_share=0 if total==0
(1598 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(1598 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(144 missing values generated)

. gen lag_deviation = L10.deviation
(144 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)
note: treatment130 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =       1697
                                                  F(   5,     95) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.0108
                                                  Adj R-squared   =     0.0008
                                                  Root MSE        =     0.0381

                         (Std. Err. adjusted for 96 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |  -.0014492   .0016465    -0.88   0.381     -.004718    .0018195
 treatment80 |  -.0038437   .0040111    -0.96   0.340    -.0118067    .0041192
 treatment90 |  -.0062331   .0046177    -1.35   0.180    -.0154004    .0029343
treatment100 |  -.0086198   .0065392    -1.32   0.191    -.0216018    .0043621
treatment110 |   -.010349   .0078079    -1.33   0.188    -.0258497    .0051516
treatment120 |  -.0107548   .0079786    -1.35   0.181    -.0265943    .0050847
treatment130 |          0  (omitted)
       _cons |   .0025436   .0017882     1.42   0.158    -.0010064    .0060936
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*o.treatment130 = 0

       F(  1,    95) =    0.67
            Prob > F =    0.4150

. predict small_share_hat, xb

. gen se = .
(1697 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(5 real changes made)
(5 real changes made)
(5 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)

. replace se = _se[_cons] if event_time==70
(10 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)
note: _IaftXlag_d_1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =       1553
                                                  F(   2,     95) =       5.58
                                                  Prob > F        =     0.0051
                                                  R-squared       =     0.1191
                                                  Adj R-squared   =     0.1123
                                                  Root MSE        =     0.0336

                         (Std. Err. adjusted for 96 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   .0062571   .0046742     1.34   0.184    -.0030224    .0155365
lag_deviat~n |  -.3586952   .1444703    -2.48   0.015     -.645505   -.0718853
_IaftXlag_~1 |          0  (omitted)
       _cons |   .1777416   .0721004     2.47   0.015     .0346041    .3208791
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(29 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(1668 missing values generated)

. gen lower = small_share_hat - 1.96*se
(1668 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/colorado.gph saved)

. 
. capture log close
