-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/Home/Dropbox/projects/borders/bridges/research_designs/co
> nvergence/results/colorado.log
  log type:  text
 opened on:   6 Oct 2014, 09:24:34

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06339.000001 no
> t found)
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06339.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
colorado
(343 vars, 159 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899 1900 1901 1902 1903 1904 1905 1906 1907 1908 1909 1910 19
> 11 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 1924 1925 1926
>  1927 1928 1929 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 1940 1941 1
> 942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 195
> 7 1958 1959)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      159   ->   27030
Number of variables                 345   ->       8
j variable (170 values)                   ->   year
xij variables:
      left_1790 left_1791 ... left_1959   ->   left_
   right_1790 right_1791 ... right_1959   ->   right_
-----------------------------------------------------------------------------
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06339.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1959
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(23630 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start+offset
(23630 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(2172 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(9204 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(50 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(0 real changes made)

. 
. forval t = 70/130 {
  2.         gen byte treatment`t' = (event_time==`t')
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(15584 missing values generated)

. gen log_large = ln(large)
(14845 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(14839 missing values generated)

. replace small_share=0 if total==0
(14839 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(14839 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(144 missing values generated)

. gen lag_deviation = L1.deviation
(144 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)
note: treatment115 omitted because of collinearity
note: treatment116 omitted because of collinearity
note: treatment117 omitted because of collinearity
note: treatment118 omitted because of collinearity
note: treatment119 omitted because of collinearity
note: treatment120 omitted because of collinearity
note: treatment121 omitted because of collinearity
note: treatment122 omitted because of collinearity
note: treatment123 omitted because of collinearity
note: treatment124 omitted because of collinearity
note: treatment125 omitted because of collinearity
note: treatment126 omitted because of collinearity
note: treatment127 omitted because of collinearity
note: treatment128 omitted because of collinearity
note: treatment129 omitted because of collinearity
note: treatment130 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =      15654
                                                  F(   6,     95) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.0120
                                                  Adj R-squared   =     0.0021
                                                  Root MSE        =     0.0354

                         (Std. Err. adjusted for 96 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |  -.0019606   .0022152    -0.89   0.378    -.0063583    .0024372
 treatment71 |  -.0012416   .0013944    -0.89   0.376    -.0040098    .0015267
 treatment72 |  -.0010168   .0011183    -0.91   0.366     -.003237    .0012033
 treatment73 |  -.0010118   .0011136    -0.91   0.366    -.0032227    .0011991
 treatment74 |  -.0024268   .0024034    -1.01   0.315    -.0071982    .0023446
 treatment75 |  -.0024299    .002398    -1.01   0.313    -.0071905    .0023307
 treatment76 |  -.0038499    .003673    -1.05   0.297    -.0111417     .003442
 treatment77 |  -.0038497   .0036715    -1.05   0.297    -.0111386    .0034391
 treatment78 |  -.0038677    .003687    -1.05   0.297    -.0111873     .003452
 treatment79 |  -.0066743   .0049869    -1.34   0.184    -.0165745     .003226
 treatment80 |  -.0066876   .0049939    -1.34   0.184    -.0166018    .0032266
 treatment81 |  -.0066896   .0049973    -1.34   0.184    -.0166106    .0032313
 treatment82 |  -.0066941   .0050004    -1.34   0.184    -.0166212     .003233
 treatment83 |  -.0081026   .0059521    -1.36   0.177     -.019919    .0037139
 treatment84 |  -.0081035    .005953    -1.36   0.177    -.0199217    .0037148
 treatment85 |  -.0067009   .0049024    -1.37   0.175    -.0164334    .0030315
 treatment86 |  -.0069372   .0051177    -1.36   0.178    -.0170972    .0032228
 treatment87 |  -.0069361   .0051157    -1.36   0.178     -.017092    .0032198
 treatment88 |  -.0067121   .0050418    -1.33   0.186    -.0167213    .0032971
 treatment89 |  -.0060032   .0045664    -1.31   0.192    -.0150687    .0030622
 treatment90 |  -.0060118   .0045736    -1.31   0.192    -.0150916     .003068
 treatment91 |  -.0060064    .004569    -1.31   0.192     -.015077    .0030642
 treatment92 |  -.0085926   .0065228    -1.32   0.191    -.0215419    .0043567
 treatment93 |  -.0080423   .0061868    -1.30   0.197    -.0203245      .00424
 treatment94 |   -.008054   .0061987    -1.30   0.197    -.0203601     .004252
 treatment95 |  -.0071559   .0056495    -1.27   0.208    -.0183717    .0040598
 treatment96 |  -.0095168   .0074902    -1.27   0.207    -.0243868    .0053531
 treatment97 |  -.0095274   .0074923    -1.27   0.207    -.0244016    .0053467
 treatment98 |  -.0095309   .0074956    -1.27   0.207    -.0244116    .0053497
 treatment99 |  -.0095399   .0074965    -1.27   0.206    -.0244223    .0053425
treatment100 |  -.0095547    .007508    -1.27   0.206    -.0244601    .0053506
treatment101 |  -.0095614     .00751    -1.27   0.206    -.0244707    .0053479
treatment102 |  -.0095625   .0075104    -1.27   0.206    -.0244726    .0053475
treatment103 |  -.0095593   .0075094    -1.27   0.206    -.0244673    .0053488
treatment104 |   -.010342    .007793    -1.33   0.188    -.0258131    .0051292
treatment105 |  -.0103387   .0077916    -1.33   0.188     -.025807    .0051297
treatment106 |  -.0103383   .0077915    -1.33   0.188    -.0258063    .0051298
treatment107 |  -.0103315   .0077888    -1.33   0.188    -.0257943    .0051313
treatment108 |  -.0107378   .0079586    -1.35   0.180    -.0265375     .005062
treatment109 |  -.0107335   .0079559    -1.35   0.181     -.026528     .005061
treatment110 |  -.0107452   .0079671    -1.35   0.181     -.026562    .0050715
treatment111 |   -.010718   .0079439    -1.35   0.180    -.0264887    .0050527
treatment112 |  -.0107418   .0079634    -1.35   0.181    -.0265511    .0050675
treatment113 |  -.0107379   .0079605    -1.35   0.181    -.0265414    .0050657
treatment114 |  -.0107562   .0079776    -1.35   0.181    -.0265937    .0050812
treatment115 |          0  (omitted)
treatment116 |          0  (omitted)
treatment117 |          0  (omitted)
treatment118 |          0  (omitted)
treatment119 |          0  (omitted)
treatment120 |          0  (omitted)
treatment121 |          0  (omitted)
treatment122 |          0  (omitted)
treatment123 |          0  (omitted)
treatment124 |          0  (omitted)
treatment125 |          0  (omitted)
treatment126 |          0  (omitted)
treatment127 |          0  (omitted)
treatment128 |          0  (omitted)
treatment129 |          0  (omitted)
treatment130 |          0  (omitted)
       _cons |   .0023382   .0016472     1.42   0.159    -.0009319    .0056083
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(15654 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(55 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(4 real changes made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)
note: _IaftXlag_d_1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =      15510
                                                  F(   2,     95) =       1.24
                                                  Prob > F        =     0.2953
                                                  R-squared       =     0.0170
                                                  Adj R-squared   =     0.0099
                                                  Root MSE        =     0.0107

                         (Std. Err. adjusted for 96 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   .0003778   .0003183     1.19   0.238     -.000254    .0010097
lag_deviat~n |  -.0281663   .0185989    -1.51   0.133    -.0650898    .0087571
_IaftXlag_~1 |          0  (omitted)
       _cons |   .0139241   .0092831     1.50   0.137    -.0045052    .0323534
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(225 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(15429 missing values generated)

. gen lower = small_share_hat - 1.96*se
(15429 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/colorado.gph saved)

. 
. capture log close
