-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/Home/Dropbox/projects/borders/bridges/research_designs/co
> nvergence/results/columbia.log
  log type:  text
 opened on:   6 Oct 2014, 09:24:34

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06343.000001 no
> t found)
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06343.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
columbia
(343 vars, 104 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899 1900 1901 1902 1903 1904 1905 1906 1907 1908 1909 1910 19
> 11 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 1924 1925 1926
>  1927 1928 1929 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 1940 1941 1
> 942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 195
> 7 1958 1959)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      104   ->   17680
Number of variables                 345   ->       8
j variable (170 values)                   ->   year
xij variables:
      left_1790 left_1791 ... left_1959   ->   left_
   right_1790 right_1791 ... right_1959   ->   right_
-----------------------------------------------------------------------------
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06343.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1959
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(12240 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start+offset
(12240 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(3422 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(5988 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(70 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(0 real changes made)

. 
. forval t = 70/130 {
  2.         gen byte treatment`t' = (event_time==`t')
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(7863 missing values generated)

. gen log_large = ln(large)
(7127 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(7057 missing values generated)

. replace small_share=0 if total==0
(7057 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(7057 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(79 missing values generated)

. gen lag_deviation = L1.deviation
(79 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)
note: treatment114 omitted because of collinearity
note: treatment115 omitted because of collinearity
note: treatment116 omitted because of collinearity
note: treatment117 omitted because of collinearity
note: treatment118 omitted because of collinearity
note: treatment119 omitted because of collinearity
note: treatment120 omitted because of collinearity
note: treatment121 omitted because of collinearity
note: treatment122 omitted because of collinearity
note: treatment123 omitted because of collinearity
note: treatment124 omitted because of collinearity
note: treatment125 omitted because of collinearity
note: treatment126 omitted because of collinearity
note: treatment127 omitted because of collinearity
note: treatment128 omitted because of collinearity
note: treatment129 omitted because of collinearity
note: treatment130 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =       8270
                                                  F(  18,     51) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.0577
                                                  Adj R-squared   =     0.0398
                                                  Root MSE        =     0.1132

                         (Std. Err. adjusted for 52 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0078712   .0394647     0.20   0.843    -.0713575    .0870999
 treatment71 |  -.0097162     .03335    -0.29   0.772    -.0766692    .0572367
 treatment72 |  -.0079654   .0331005    -0.24   0.811    -.0744174    .0584865
 treatment73 |  -.0069698   .0324676    -0.21   0.831    -.0721513    .0582117
 treatment74 |  -.0073579   .0330127    -0.22   0.825    -.0736338    .0589179
 treatment75 |  -.0060711   .0321225    -0.19   0.851    -.0705597    .0584175
 treatment76 |  -.0077815   .0343826    -0.23   0.822    -.0768075    .0612446
 treatment77 |   -.008196   .0340844    -0.24   0.811    -.0766232    .0602312
 treatment78 |  -.0070779   .0335563    -0.21   0.834    -.0744449    .0602892
 treatment79 |   -.008333   .0325145    -0.26   0.799    -.0736086    .0569426
 treatment80 |  -.0087924   .0327402    -0.27   0.789    -.0745212    .0569363
 treatment81 |  -.0192555   .0326046    -0.59   0.557     -.084712    .0462009
 treatment82 |  -.0173049   .0353617    -0.49   0.627    -.0882966    .0536867
 treatment83 |  -.0209577   .0319961    -0.66   0.515    -.0851925    .0432771
 treatment84 |  -.0227506    .031251    -0.73   0.470    -.0854896    .0399885
 treatment85 |  -.0256872   .0302584    -0.85   0.400    -.0864335    .0350592
 treatment86 |  -.0303609   .0296181    -1.03   0.310    -.0898218    .0290999
 treatment87 |  -.0320794   .0284907    -1.13   0.265    -.0892769     .025118
 treatment88 |  -.0294827   .0285371    -1.03   0.306    -.0867734    .0278079
 treatment89 |  -.0295319   .0280586    -1.05   0.298    -.0858619    .0267981
 treatment90 |  -.0326721   .0272513    -1.20   0.236    -.0873814    .0220373
 treatment91 |  -.0366303   .0269088    -1.36   0.179     -.090652    .0173915
 treatment92 |  -.0311552   .0269766    -1.15   0.254    -.0853131    .0230026
 treatment93 |  -.0526887   .0196792    -2.68   0.010    -.0921965    -.013181
 treatment94 |  -.0535975   .0195368    -2.74   0.008    -.0928192   -.0143758
 treatment95 |   -.054479   .0195055    -2.79   0.007     -.093638     -.01532
 treatment96 |  -.0536565   .0193111    -2.78   0.008    -.0924252   -.0148877
 treatment97 |  -.0540441   .0186062    -2.90   0.005    -.0913976   -.0166906
 treatment98 |   .0508238   .1005957     0.51   0.616    -.1511305    .2527781
 treatment99 |    .051718   .1007434     0.51   0.610    -.1505329    .2539689
treatment100 |   .0506558   .1009336     0.50   0.618    -.1519769    .2532885
treatment101 |   .0521121   .1002815     0.52   0.606    -.1492114    .2534356
treatment102 |   .0471182   .1020246     0.46   0.646    -.1577049    .2519412
treatment103 |   .0391481   .1036866     0.38   0.707    -.1690115    .2473077
treatment104 |    .101229   .1284656     0.79   0.434    -.1566763    .3591344
treatment105 |   .0998957   .1275751     0.78   0.437     -.156222    .3560134
treatment106 |   .1021075   .1277852     0.80   0.428    -.1544321     .358647
treatment107 |   .0950386   .1276416     0.74   0.460    -.1612128    .3512899
treatment108 |   .0869462   .1298913     0.67   0.506    -.1738214    .3477138
treatment109 |   .2623269   .0199885    13.12   0.000     .2221983    .3024556
treatment110 |   .2623276   .0199952    13.12   0.000     .2221855    .3024697
treatment111 |    .264174   .0198115    13.33   0.000     .2244006    .3039473
treatment112 |   .2574165   .0203425    12.65   0.000     .2165773    .2982558
treatment113 |   .2503326   .0213591    11.72   0.000     .2074524    .2932128
treatment114 |          0  (omitted)
treatment115 |          0  (omitted)
treatment116 |          0  (omitted)
treatment117 |          0  (omitted)
treatment118 |          0  (omitted)
treatment119 |          0  (omitted)
treatment120 |          0  (omitted)
treatment121 |          0  (omitted)
treatment122 |          0  (omitted)
treatment123 |          0  (omitted)
treatment124 |          0  (omitted)
treatment125 |          0  (omitted)
treatment126 |          0  (omitted)
treatment127 |          0  (omitted)
treatment128 |          0  (omitted)
treatment129 |          0  (omitted)
treatment130 |          0  (omitted)
       _cons |   .0220346   .0079943     2.76   0.008     .0059854    .0380838
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(8270 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(77 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(6 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       8191
                                                  F(   3,     51) =       8.73
                                                  Prob > F        =     0.0001
                                                  R-squared       =     0.0278
                                                  Adj R-squared   =     0.0143
                                                  Root MSE        =     0.0315

                         (Std. Err. adjusted for 52 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0100268   .0033426    -3.00   0.004    -.0167374   -.0033163
lag_deviat~n |   -.028946   .0066691    -4.34   0.000    -.0423347   -.0155574
_IaftXlag_~1 |   .0300228    .008013     3.75   0.000     .0139359    .0461097
       _cons |   .0130715   .0031524     4.15   0.000     .0067429    .0194002
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(278 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(7992 missing values generated)

. gen lower = small_share_hat - 1.96*se
(7992 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/columbia.gph saved)

. 
. capture log close
