-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/columbia.log
  log type:  text
 opened on:   2 Jul 2014, 16:34:56

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54523.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54523.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
columbia
(37 vars, 104 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      104   ->    1768
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54523.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(1224 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(1224 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(323 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(542 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(7 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(0 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(849 missing values generated)

. gen log_large = ln(large)
(764 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(756 missing values generated)

. replace small_share=0 if total==0
(756 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(756 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(79 missing values generated)

. gen lag_deviation = L10.deviation
(79 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)
note: treatment130 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =        903
                                                  F(   6,     51) =     248.47
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1057
                                                  Adj R-squared   =     0.0885
                                                  Root MSE        =     0.1196

                         (Std. Err. adjusted for 52 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0276731   .0438758     0.63   0.531    -.0604112    .1157574
 treatment80 |  -.0188816   .0364486    -0.52   0.607    -.0920552     .054292
 treatment90 |  -.0151271   .0364177    -0.42   0.680    -.0882386    .0579844
treatment100 |   -.042616   .0264237    -1.61   0.113    -.0956637    .0104317
treatment110 |   .3693834     .24386     1.51   0.136     -.120186    .8589528
treatment120 |   .2448493   .0209737    11.67   0.000     .2027429    .2869558
treatment130 |          0  (omitted)
       _cons |   .0251383   .0082689     3.04   0.004     .0085377    .0417388
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*o.treatment130 = 0

       F(  1,    51) =    5.35
            Prob > F =    0.0248

. predict small_share_hat, xb

. gen se = .
(903 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(7 real changes made)
(7 real changes made)
(7 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)

. replace se = _se[_cons] if event_time==70
(14 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        824
                                                  F(   3,     51) =      29.68
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1753
                                                  Adj R-squared   =     0.1621
                                                  Root MSE        =     0.0966

                         (Std. Err. adjusted for 52 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   .1379923   .1235034     1.12   0.269    -.1099511    .3859356
lag_deviat~n |  -.2876548   .0317823    -9.05   0.000    -.3514604   -.2238492
_IaftXlag_~1 |  -1.094298   .7309896    -1.50   0.141     -2.56182    .3732251
       _cons |   .1307656   .0149587     8.74   0.000     .1007347    .1607965
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(39 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(864 missing values generated)

. gen lower = small_share_hat - 1.96*se
(864 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/columbia.gph saved)

. 
. capture log close
