-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox/projects/borders/bridges/research_designs/con
> vergence/results/columbia.log
  log type:  text
 opened on:  14 May 2014, 20:53:58

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26611.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26611.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
columbia
(37 vars, 32 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       32   ->     544
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26611.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset

. keep if abs(event_time-offset)<=`sample_window'
(249 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(64 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(10 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small_share = cond(left_before<right_before,left,right)/total
(75 missing values generated)

. replace small_share=0 if total==0
(75 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(75 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1820 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(32 missing values generated)

. gen lag_deviation = L10.deviation
(32 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       295
Group variable: river_bridge                    Number of groups   =        32

R-sq:  within  = 0.5647                         Obs per group: min =         5
       between = 0.0000                                        avg =       9.2
       overall = 0.2955                                        max =        13

                                                F(21,242)          =     14.95
corr(u_i, Xb)  = -0.0023                        Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .1112056   .2333821     0.48   0.634    -.3485139    .5709251
         80  |   .1939595   .3070075     0.63   0.528    -.4107885    .7987075
         90  |   .5035565   .3871083     1.30   0.195    -.2589752    1.266088
        100  |   .6422358   .4743239     1.35   0.177    -.2920947    1.576566
        110  |   .8414677   .5675595     1.48   0.139    -.2765196    1.959455
        120  |   .7706916   .6563925     1.17   0.241    -.5222803    2.063664
        130  |   .9986473   .7448239     1.34   0.181    -.4685181    2.465813
        140  |   .8543149   .8848318     0.97   0.335    -.8886401     2.59727
             |
        year |
       1830  |   .2105519   .8635469     0.24   0.808    -1.490476     1.91158
       1840  |   -.014959   .8143506    -0.02   0.985    -1.619079    1.589161
       1850  |   .0929956   .8116319     0.11   0.909    -1.505769     1.69176
       1860  |   -.246897   .8250765    -0.30   0.765    -1.872145    1.378351
       1870  |  -.1640329   .8484965    -0.19   0.847    -1.835414    1.507348
       1880  |   -.211437   .8785152    -0.24   0.810    -1.941949    1.519076
       1890  |   .1286865   .9405726     0.14   0.891    -1.724068    1.981441
       1900  |    .296502   .9880591     0.30   0.764    -1.649792    2.242796
       1910  |   .7273767   1.032956     0.70   0.482    -1.307357     2.76211
       1920  |   .6945998   1.098722     0.63   0.528    -1.469679    2.858878
       1930  |   .7994951   1.172087     0.68   0.496      -1.5093    3.108291
       1940  |    1.06241   1.242867     0.85   0.394    -1.385809    3.510629
       1950  |   1.105761   1.309423     0.84   0.399    -1.473559    3.685082
             |
       _cons |   .3260172   .8378104     0.39   0.698    -1.324314    1.976349
-------------+----------------------------------------------------------------
     sigma_u |  .98814511
     sigma_e |  .73165161
         rho |  .64589654   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(31, 242) =    15.99             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       295
Group variable: river_bridge                    Number of groups   =        32

R-sq:  within  = 0.5220                         Obs per group: min =         5
       between = 0.0010                                        avg =       9.2
       overall = 0.1889                                        max =        13

                                                F(21,242)          =     12.58
corr(u_i, Xb)  = -0.0218                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0168037   .5251298     0.03   0.974    -1.017605    1.051212
         80  |   .0452356   .6907934     0.07   0.948      -1.3155    1.405971
         90  |   .2782888   .8710271     0.32   0.750    -1.437474    1.994051
        100  |   .5574258    1.06727     0.52   0.602    -1.544899     2.65975
        110  |   .9297258   1.277058     0.73   0.467    -1.585842    3.445294
        120  |   .9544853    1.47694     0.65   0.519    -1.954813    3.863784
        130  |   1.186753   1.675918     0.71   0.480    -2.114496    4.488003
        140  |    1.94327   1.990948     0.98   0.330     -1.97853    5.865069
             |
        year |
       1830  |   1.103193   1.943055     0.57   0.571    -2.724267    4.930652
       1840  |  -.7312125   1.832359    -0.40   0.690    -4.340622    2.878197
       1850  |  -.5929725   1.826242    -0.32   0.746    -4.190331    3.004386
       1860  |   .0582734   1.856494     0.03   0.975    -3.598676    3.715223
       1870  |   .1930905   1.909191     0.10   0.920    -3.567662    3.953843
       1880  |   .5898594   1.976735     0.30   0.766    -3.303943    4.483662
       1890  |   1.450777    2.11637     0.69   0.494     -2.71808    5.619635
       1900  |   1.817484   2.223218     0.82   0.414    -2.561846    6.196813
       1910  |   2.559038   2.324241     1.10   0.272    -2.019288    7.137364
       1920  |   2.902327   2.472219     1.17   0.242    -1.967487    7.772141
       1930  |   2.890306   2.637298     1.10   0.274    -2.304684    8.085296
       1940  |   2.961309   2.796559     1.06   0.291    -2.547395    8.470013
       1950  |   3.012263   2.946314     1.02   0.308    -2.791431    8.815957
             |
       _cons |   .2793945   1.885146     0.15   0.882    -3.433995    3.992783
-------------+----------------------------------------------------------------
     sigma_u |  2.7777674
     sigma_e |  1.6462794
         rho |  .74005594   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(31, 242) =    26.44             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       295
Group variable: river_bridge                    Number of groups   =        32

R-sq:  within  = 0.3024                         Obs per group: min =         5
       between = 0.0015                                        avg =       9.2
       overall = 0.2107                                        max =        13

                                                F(14,249)          =      7.71
corr(u_i, Xb)  = -0.0063                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .1206407   .0396702     3.04   0.003     .0425088    .1987727
             |
        year |
       1830  |  -.0418202   .2006259    -0.21   0.835    -.4369604    .3533199
       1840  |  -.0466348   .1877975    -0.25   0.804     -.416509    .3232393
       1850  |   .0952606   .1848678     0.52   0.607    -.2688434    .4593646
       1860  |   .0927911   .1821544     0.51   0.611    -.2659688     .451551
       1870  |   .0676515   .1817871     0.37   0.710     -.290385    .4256879
       1880  |   .0361207   .1815399     0.20   0.842    -.3214288    .3936702
       1890  |   .0709883   .1813519     0.39   0.696    -.2861911    .4281676
       1900  |   .1038596   .1816086     0.57   0.568    -.2538252    .4615445
       1910  |   .1701552   .1823327     0.93   0.352    -.1889557    .5292661
       1920  |   .1645752   .1829609     0.90   0.369     -.195773    .5249235
       1930  |   .1522175   .1847099     0.82   0.411    -.2115754    .5160105
       1940  |   .2205149   .1852812     1.19   0.235    -.1444033    .5854331
       1950  |    .208315   .1867791     1.12   0.266    -.1595533    .5761832
             |
       _cons |   .0227436   .1780674     0.13   0.898    -.3279668     .373454
-------------+----------------------------------------------------------------
     sigma_u |  .12574247
     sigma_e |  .17030481
         rho |  .35281054   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(31, 249) =     4.82             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        295
                                                  F(   8,     20) =       0.81
                                                  Prob > F        =     0.6006
                                                  R-squared       =     0.2202
                                                  Adj R-squared   =     0.1602
                                                  Root MSE        =     0.2050

                         (Std. Err. adjusted for 21 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0084836   .0233057     0.36   0.720    -.0401312    .0570984
         80  |    .008043   .0301831     0.27   0.793    -.0549179    .0710039
         90  |   .0336536   .0469135     0.72   0.481    -.0642062    .1315134
        100  |   .0542267   .0537849     1.01   0.325    -.0579667    .1664202
        110  |    .181129   .0868899     2.08   0.050    -.0001202    .3623781
        120  |   .1560848   .0809333     1.93   0.068    -.0127391    .3249087
        130  |   .1522167   .0993411     1.53   0.141    -.0550053    .3594387
        140  |    .207456   .1307055     1.59   0.128    -.0651908    .4801028
             |
       _cons |   .1285829    .043424     2.96   0.008      .038002    .2191638
-------------+----------------------------------------------------------------
        year |   absorbed                                      (14 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    20) =    3.59
            Prob > F =    0.0726

. predict small_share_hat, xb

. gen se = .
(295 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(32 real changes made)
(32 real changes made)
(31 real changes made)
(27 real changes made)
(21 real changes made)
(19 real changes made)
(17 real changes made)
(20 real changes made)

. replace se = _se[_cons] if event_time==60
(96 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        263
                                                  F(   3,     20) =       8.89
                                                  Prob > F        =     0.0006
                                                  R-squared       =     0.2083
                                                  Adj R-squared   =     0.1603
                                                  Root MSE        =     0.1328

                         (Std. Err. adjusted for 21 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0533254   .0446659    -1.19   0.246    -.1464969    .0398462
lag_deviat~n |  -.2368834   .0547366    -4.33   0.000    -.3510619   -.1227048
_IaftXlag_~1 |  -.0362722   .1445474    -0.25   0.804    -.3377928    .2652485
       _cons |   .0698132   .0204763     3.41   0.003     .0271003    .1125261
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (13 categories)

. 
. replace event_time = event_time - offset
(295 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/columbia.gph saved)

. 
. capture log close
