-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/connecticut.log
  log type:  text
 opened on:   2 Jul 2014, 16:34:58

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54530.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54530.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
connecticut
(37 vars, 55 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       55   ->     935
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54530.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(102 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(102 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(445 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(199 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(24 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(13 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(62 missing values generated)

. gen log_large = ln(large)
(40 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(38 missing values generated)

. replace small_share=0 if total==0
(38 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(38 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(40 missing values generated)

. gen lag_deviation = L10.deviation
(40 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        291
                                                  F(   7,     21) =       0.56
                                                  Prob > F        =     0.7769
                                                  R-squared       =     0.1975
                                                  Adj R-squared   =     0.1443
                                                  Root MSE        =     0.1870

                         (Std. Err. adjusted for 22 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |  -.0011789   .0550961    -0.02   0.983    -.1157575    .1133997
 treatment80 |   -.030865   .0553285    -0.56   0.583    -.1459268    .0841969
 treatment90 |  -.0254936   .0513432    -0.50   0.625    -.1322676    .0812804
treatment100 |  -.0462744   .0661324    -0.70   0.492    -.1838042    .0912554
treatment110 |  -.0494657   .0589883    -0.84   0.411    -.1721386    .0732072
treatment120 |  -.0432785   .0564572    -0.77   0.452    -.1606876    .0741306
treatment130 |   -.007886   .0776988    -0.10   0.920    -.1694695    .1536974
       _cons |   .3423846   .0744532     4.60   0.000     .1875508    .4972185
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*treatment130 = 0

       F(  1,    21) =    0.11
            Prob > F =    0.7386

. predict small_share_hat, xb

. gen se = .
(291 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(26 real changes made)
(32 real changes made)
(33 real changes made)
(28 real changes made)
(21 real changes made)
(30 real changes made)

. replace se = _se[_cons] if event_time==70
(49 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        251
                                                  F(   3,     21) =       2.69
                                                  Prob > F        =     0.0721
                                                  R-squared       =     0.2418
                                                  Adj R-squared   =     0.2003
                                                  Root MSE        =     0.1258

                         (Std. Err. adjusted for 22 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   .0124889   .0146299     0.85   0.403    -.0179356    .0429133
lag_deviat~n |  -.1713666   .0972508    -1.76   0.093    -.3736106    .0308774
_IaftXlag_~1 |  -.1427051   .1099379    -1.30   0.208    -.3713334    .0859233
       _cons |   .0126456   .0075644     1.67   0.109    -.0030855    .0283767
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(219 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(72 missing values generated)

. gen lower = small_share_hat - 1.96*se
(72 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/connecticut.gph saved)

. 
. capture log close
