-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/Home/Dropbox/projects/borders/bridges/research_designs/co
> nvergence/results/connecticut.log
  log type:  text
 opened on:   6 Oct 2014, 09:24:41

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06349.000001 no
> t found)
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06349.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
connecticut
(343 vars, 55 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899 1900 1901 1902 1903 1904 1905 1906 1907 1908 1909 1910 19
> 11 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 1924 1925 1926
>  1927 1928 1929 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 1940 1941 1
> 942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 195
> 7 1958 1959)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       55   ->    9350
Number of variables                 345   ->       8
j variable (170 values)                   ->   year
xij variables:
      left_1790 left_1791 ... left_1959   ->   left_
   right_1790 right_1791 ... right_1959   ->   right_
-----------------------------------------------------------------------------
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06349.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1959
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(1020 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start+offset
(1020 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(4793 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(2081 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(248 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(119 real changes made)

. 
. forval t = 70/130 {
  2.         gen byte treatment`t' = (event_time==`t')
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(501 missing values generated)

. gen log_large = ln(large)
(314 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(294 missing values generated)

. replace small_share=0 if total==0
(294 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(294 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(40 missing values generated)

. gen lag_deviation = L1.deviation
(40 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       2476
                                                  F(  21,     21) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.1426
                                                  Adj R-squared   =     0.0790
                                                  Root MSE        =     0.1889

                         (Std. Err. adjusted for 22 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |  -.0129492   .0613189    -0.21   0.835    -.1404689    .1145704
 treatment71 |  -.0218054    .066687    -0.33   0.747    -.1604887    .1168778
 treatment72 |  -.0236974   .0678404    -0.35   0.730    -.1647793    .1173845
 treatment73 |   -.017846   .0622104    -0.29   0.777    -.1472195    .1115276
 treatment74 |  -.0257273   .0618443    -0.42   0.682    -.1543396    .1028849
 treatment75 |  -.0260165    .062055    -0.42   0.679    -.1550669    .1030339
 treatment76 |  -.0256534   .0605672    -0.42   0.676    -.1516098     .100303
 treatment77 |   -.022853   .0601316    -0.38   0.708    -.1479034    .1021974
 treatment78 |  -.0144638   .0591014    -0.24   0.809    -.1373719    .1084442
 treatment79 |  -.0095427   .0600438    -0.16   0.875    -.1344105    .1153251
 treatment80 |  -.0079984   .0594571    -0.13   0.894    -.1316463    .1156494
 treatment81 |  -.0097823   .0585789    -0.17   0.869    -.1316039    .1120393
 treatment82 |  -.0102108   .0584665    -0.17   0.863    -.1317986    .1113769
 treatment83 |  -.0087034   .0573681    -0.15   0.881    -.1280068       .1106
 treatment84 |  -.0169142   .0592955    -0.29   0.778    -.1402258    .1063975
 treatment85 |  -.0194936   .0582005    -0.33   0.741    -.1405281    .1015408
 treatment86 |  -.0185148   .0568803    -0.33   0.748    -.1368039    .0997743
 treatment87 |  -.0132031   .0601068    -0.22   0.828     -.138202    .1117958
 treatment88 |  -.0139187   .0585184    -0.24   0.814    -.1356142    .1077769
 treatment89 |  -.0247746   .0613171    -0.40   0.690    -.1522905    .1027413
 treatment90 |  -.0251864   .0609435    -0.41   0.684    -.1519252    .1015525
 treatment91 |  -.0293343    .061188    -0.48   0.637    -.1565817    .0979131
 treatment92 |  -.0464703   .0616117    -0.75   0.459    -.1745989    .0816583
 treatment93 |   -.052744   .0629484    -0.84   0.412    -.1836523    .0781643
 treatment94 |  -.0690216   .0616692    -1.12   0.276    -.1972698    .0592265
 treatment95 |  -.0799453   .0621059    -1.29   0.212    -.2091016    .0492111
 treatment96 |  -.0678547   .0625765    -1.08   0.291    -.1979897    .0622803
 treatment97 |  -.0497813   .0592797    -0.84   0.410    -.1730601    .0734975
 treatment98 |   -.049904   .0593245    -0.84   0.410    -.1732761    .0734681
 treatment99 |  -.0536493   .0588412    -0.91   0.372    -.1760163    .0687177
treatment100 |  -.0668259   .0584639    -1.14   0.266    -.1884083    .0547566
treatment101 |  -.0719295   .0598472    -1.20   0.243    -.1963887    .0525296
treatment102 |  -.0760215   .0629832    -1.21   0.241    -.2070023    .0549592
treatment103 |  -.0666301   .0601442    -1.11   0.280    -.1917069    .0584466
treatment104 |  -.0720106   .0611502    -1.18   0.252    -.1991795    .0551582
treatment105 |   -.070831   .0572747    -1.24   0.230    -.1899401    .0482782
treatment106 |  -.0754069     .05742    -1.31   0.203    -.1948182    .0440044
treatment107 |  -.0765505   .0581271    -1.32   0.202    -.1974325    .0443314
treatment108 |  -.0811763   .0567672    -1.43   0.167    -.1992302    .0368776
treatment109 |  -.0631697   .0533648    -1.18   0.250    -.1741479    .0478084
treatment110 |  -.0619456   .0531186    -1.17   0.257    -.1724119    .0485206
treatment111 |  -.0703693    .051578    -1.36   0.187    -.1776318    .0368931
treatment112 |  -.0700315   .0533343    -1.31   0.203    -.1809462    .0408832
treatment113 |  -.0436168    .049033    -0.89   0.384    -.1455865     .058353
treatment114 |  -.0275106   .0480562    -0.57   0.573     -.127449    .0724278
treatment115 |  -.0343736   .0485431    -0.71   0.487    -.1353244    .0665773
treatment116 |  -.0240507   .0615441    -0.39   0.700    -.1520386    .1039372
treatment117 |  -.0368646   .0642974    -0.57   0.573    -.1705784    .0968491
treatment118 |  -.0486825   .0640964    -0.76   0.456    -.1819783    .0846134
treatment119 |  -.0549886   .0653575    -0.84   0.410    -.1909069    .0809296
treatment120 |  -.0601711   .0664006    -0.91   0.375    -.1982587    .0779166
treatment121 |  -.0539615   .0635145    -0.85   0.405    -.1860472    .0781242
treatment122 |  -.0532508   .0635385    -0.84   0.411    -.1853864    .0788848
treatment123 |  -.0399304   .0642758    -0.62   0.541    -.1735993    .0937385
treatment124 |  -.0547831   .0629209    -0.87   0.394    -.1856344    .0760681
treatment125 |  -.0304876   .0821549    -0.37   0.714     -.201338    .1403628
treatment126 |  -.0137471   .0821196    -0.17   0.869    -.1845243    .1570301
treatment127 |  -.0104519   .0835011    -0.13   0.902     -.184102    .1631982
treatment128 |  -.0033413   .0794086    -0.04   0.967    -.1684805     .161798
treatment129 |  -.0019902   .0809115    -0.02   0.981    -.1702548    .1662745
treatment130 |   .0069668   .0870338     0.08   0.937    -.1740299    .1879634
       _cons |   .3505692   .0757883     4.63   0.000     .1929589    .5081796
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(2476 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(273 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(25 real changes made)
(26 real changes made)
(26 real changes made)
(26 real changes made)
(27 real changes made)
(27 real changes made)
(29 real changes made)
(30 real changes made)
(31 real changes made)
(32 real changes made)
(32 real changes made)
(32 real changes made)
(32 real changes made)
(31 real changes made)
(31 real changes made)
(31 real changes made)
(30 real changes made)
(29 real changes made)
(29 real changes made)
(27 real changes made)
(27 real changes made)
(27 real changes made)
(27 real changes made)
(26 real changes made)
(26 real changes made)
(25 real changes made)
(25 real changes made)
(24 real changes made)
(24 real changes made)
(23 real changes made)
(23 real changes made)
(22 real changes made)
(21 real changes made)
(21 real changes made)
(20 real changes made)
(19 real changes made)
(19 real changes made)
(18 real changes made)
(18 real changes made)
(18 real changes made)
(18 real changes made)
(18 real changes made)
(17 real changes made)
(17 real changes made)
(16 real changes made)
(15 real changes made)
(14 real changes made)
(14 real changes made)
(14 real changes made)
(13 real changes made)
(13 real changes made)
(132 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       2436
                                                  F(   3,     21) =       2.98
                                                  Prob > F        =     0.0546
                                                  R-squared       =     0.1448
                                                  Adj R-squared   =     0.1036
                                                  Root MSE        =     0.0459

                         (Std. Err. adjusted for 22 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0012492   .0027363    -0.46   0.653    -.0069396    .0044413
lag_deviat~n |  -.0301614   .0152691    -1.98   0.062    -.0619153    .0015924
_IaftXlag_~1 |   .0084857   .0160388     0.53   0.602    -.0248688    .0418402
       _cons |   .0028773   .0016441     1.75   0.095    -.0005419    .0062965
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(1810 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(666 missing values generated)

. gen lower = small_share_hat - 1.96*se
(666 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/connecticut.gph saved)

. 
. capture log close
