-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/delaware.log
  log type:  text
 opened on:   2 Jul 2014, 12:08:36

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50408.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50408.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
delaware
(37 vars, 39 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       39   ->     663
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50408.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(68 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(68 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(308 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(46 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(41 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(58 missing values generated)

. gen log_large = ln(large)
(45 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(37 missing values generated)

. replace small_share=0 if total==0
(37 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(37 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(35 missing values generated)

. gen lag_deviation = L10.deviation
(35 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       355
Group variable: river_bridge                    Number of groups   =        35

R-sq:  within  = 0.6336                         Obs per group: min =         5
       between = 0.3781                                        avg =      10.1
       overall = 0.3935                                        max =        13

                                                F(24,296)          =     21.33
corr(u_i, Xb)  = 0.0912                         Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0874053    .768291     0.11   0.910    -1.424599     1.59941
         80  |   .0409222   .9437981     0.04   0.965    -1.816483    1.898327
         90  |  -.1450936   1.183442    -0.12   0.903     -2.47412    2.183933
        100  |  -.3045004   1.432175    -0.21   0.832    -3.123036    2.514035
        110  |   -.847174   1.697615    -0.50   0.618    -4.188099    2.493751
        120  |  -1.154135   1.955777    -0.59   0.556    -5.003124    2.694855
        130  |  -1.081704   2.214086    -0.49   0.626    -5.439049     3.27564
        140  |  -2.540603    2.69147    -0.94   0.346    -7.837445     2.75624
             |
        year |
       1800  |   .2284298   1.014313     0.23   0.822    -1.767748    2.224608
       1810  |   1.229743   1.116602     1.10   0.272    -.9677425    3.427228
       1820  |   2.453863   1.280652     1.92   0.056    -.0664735    4.974199
       1830  |   3.849011   1.469081     2.62   0.009     .9578435    6.740179
       1840  |   4.820399   1.701895     2.83   0.005     1.471053    8.169746
       1850  |    6.53402   1.939542     3.37   0.001     2.716981    10.35106
       1860  |    6.89852   2.102337     3.28   0.001     2.761098    11.03594
       1870  |   8.162723   2.420878     3.37   0.001     3.398409    12.92704
       1880  |   9.232012   2.643865     3.49   0.001     4.028857    14.43517
       1890  |   11.37282   2.830523     4.02   0.000     5.802325    16.94332
       1900  |   12.78583   3.127052     4.09   0.000     6.631758     18.9399
       1910  |   14.58543   3.382425     4.31   0.000      7.92878    21.24208
       1920  |   15.28104   3.684094     4.15   0.000     8.030708    22.53138
       1930  |   15.91586   3.920395     4.06   0.000     8.200477    23.63124
       1940  |   16.66154   4.214388     3.95   0.000      8.36758     24.9555
       1950  |   17.68417   4.467234     3.96   0.000     8.892608    26.47574
             |
       _cons |  -.1364427   1.250046    -0.11   0.913    -2.596547    2.323661
-------------+----------------------------------------------------------------
     sigma_u |  8.1879115
     sigma_e |  2.4970038
         rho |  .91491144   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(34, 296) =    79.86             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       355
Group variable: river_bridge                    Number of groups   =        35

R-sq:  within  = 0.7129                         Obs per group: min =         5
       between = 0.3282                                        avg =      10.1
       overall = 0.4358                                        max =        13

                                                F(24,296)          =     30.62
corr(u_i, Xb)  = -0.0001                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .3209332     .75469     0.43   0.671    -1.164305    1.806171
         80  |   .7837952   .9270901     0.85   0.399    -1.040728    2.608319
         90  |   .6860867   1.162492     0.59   0.556    -1.601709    2.973883
        100  |   .8713295   1.406821     0.62   0.536     -1.89731    3.639969
        110  |   .9913261   1.667563     0.59   0.553    -2.290455    4.273107
        120  |   .7337319   1.921154     0.38   0.703    -3.047119    4.514583
        130  |   .9713419    2.17489     0.45   0.655    -3.308865    5.251549
        140  |   .5779105   2.643824     0.22   0.827    -4.625163    5.780984
             |
        year |
       1800  |   -.513645   .9963563    -0.52   0.607    -2.474485    1.447195
       1810  |  -.5920822   1.096835    -0.54   0.590    -2.750666    1.566501
       1820  |   .5236256    1.25798     0.42   0.678    -1.952093    2.999344
       1830  |   2.186999   1.443074     1.52   0.131    -.6529871    5.026984
       1840  |   3.052644   1.671766     1.83   0.069    -.2374094    6.342698
       1850  |   4.490914   1.905206     2.36   0.019     .7414477     8.24038
       1860  |   6.319908    2.06512     3.06   0.002      2.25573    10.38409
       1870  |   7.169818   2.378022     3.02   0.003     2.489846    11.84979
       1880  |   8.052599   2.597061     3.10   0.002     2.941555    13.16364
       1890  |   9.697605   2.780415     3.49   0.001      4.22572    15.16949
       1900  |   11.42464   3.071695     3.72   0.000     5.379508    17.46976
       1910  |   12.49905   3.322546     3.76   0.000      5.96024    19.03785
       1920  |     13.031   3.618875     3.60   0.000     5.909017    20.15299
       1930  |   13.24152   3.850993     3.44   0.001     5.662725    20.82032
       1940  |   13.25709   4.139781     3.20   0.002     5.109953    21.40422
       1950  |   13.61686   4.388151     3.10   0.002      4.98093    22.25279
             |
       _cons |  -.2298187   1.227917    -0.19   0.852    -2.646372    2.186734
-------------+----------------------------------------------------------------
     sigma_u |  5.4243542
     sigma_e |  2.4527996
         rho |  .83024118   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(34, 296) =    46.34             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       355
Group variable: river_bridge                    Number of groups   =        35

R-sq:  within  = 0.3637                         Obs per group: min =         5
       between = 0.0935                                        avg =      10.1
       overall = 0.3036                                        max =        13

                                                F(17,303)          =     10.19
corr(u_i, Xb)  = -0.0029                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .0309688   .0315685     0.98   0.327    -.0311523      .09309
             |
        year |
       1800  |   .0274971   .0560258     0.49   0.624    -.0827519    .1377461
       1810  |    .219761   .0555362     3.96   0.000     .1104756    .3290464
       1820  |   .3255106   .0558456     5.83   0.000     .2156163    .4354048
       1830  |    .261852   .0554384     4.72   0.000     .1527589     .370945
       1840  |   .4417946   .0573197     7.71   0.000     .3289996    .5545896
       1850  |   .4169161   .0583622     7.14   0.000     .3020696    .5317626
       1860  |   .3930356   .0587725     6.69   0.000     .2773816    .5086896
       1870  |   .3585693   .0610649     5.87   0.000     .2384044    .4787342
       1880  |   .3468453   .0634034     5.47   0.000     .2220784    .4716121
       1890  |   .3800095   .0657747     5.78   0.000     .2505764    .5094426
       1900  |   .3754266   .0687562     5.46   0.000     .2401265    .5107267
       1910  |   .3724997   .0728242     5.12   0.000     .2291944     .515805
       1920  |    .374329   .0745316     5.02   0.000      .227664    .5209941
       1930  |    .375249   .0772225     4.86   0.000     .2232887    .5272094
       1940  |   .3611754   .0836541     4.32   0.000     .1965588    .5257921
       1950  |   .3554816   .0867072     4.10   0.000      .184857    .5261061
             |
       _cons |  -.0025791   .0466711    -0.06   0.956    -.0944195    .0892614
-------------+----------------------------------------------------------------
     sigma_u |  .09893459
     sigma_e |  .15053675
         rho |  .30164079   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(34, 303) =     4.24             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        355
                                                  F(   8,     21) =       3.14
                                                  Prob > F        =     0.0168
                                                  R-squared       =     0.3205
                                                  Adj R-squared   =     0.2711
                                                  Root MSE        =     0.1734

                         (Std. Err. adjusted for 22 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   6.65e-06   .0358418     0.00   1.000    -.0745305    .0745438
         80  |   -.000186   .0410731    -0.00   0.996    -.0856022    .0852303
         90  |  -.0247755   .0358159    -0.69   0.497    -.0992587    .0497077
        100  |  -.0414405   .0417521    -0.99   0.332    -.1282688    .0453878
        110  |   -.003198    .041205    -0.08   0.939    -.0888885    .0824925
        120  |  -.0011723   .0416591    -0.03   0.978    -.0878071    .0854626
        130  |   .0562285   .0387243     1.45   0.161    -.0243031      .13676
        140  |   .0657398   .0376779     1.74   0.096    -.0126157    .1440953
             |
       _cons |   .3349866   .0299899    11.17   0.000     .2726191    .3973541
-------------+----------------------------------------------------------------
        year |   absorbed                                      (17 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    21) =    1.36
            Prob > F =    0.2567

. predict small_share_hat, xb

. gen se = .
(355 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(29 real changes made)
(33 real changes made)
(34 real changes made)
(34 real changes made)
(31 real changes made)
(30 real changes made)
(25 real changes made)
(64 real changes made)

. replace se = _se[_cons] if event_time==60
(75 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        320
                                                  F(   3,     21) =      18.07
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.3451
                                                  Adj R-squared   =     0.3059
                                                  Root MSE        =     0.1507

                         (Std. Err. adjusted for 22 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0265656   .0154284    -1.72   0.100    -.0586507    .0055196
lag_deviat~n |  -.4555895   .0964565    -4.72   0.000    -.6561818   -.2549972
_IaftXlag_~1 |  -.0455865   .1335468    -0.34   0.736    -.3233122    .2321392
       _cons |    .065327   .0165254     3.95   0.001     .0309606    .0996934
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (16 categories)

. 
. replace event_time = event_time - offset
(355 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/delaware.gph saved)

. 
. capture log close
