-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/Home/Dropbox/projects/borders/bridges/research_designs/co
> nvergence/results/hudson.log
  log type:  text
 opened on:   6 Oct 2014, 09:24:41

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06357.000001 no
> t found)
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06357.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
hudson
(343 vars, 33 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899 1900 1901 1902 1903 1904 1905 1906 1907 1908 1909 1910 19
> 11 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 1924 1925 1926
>  1927 1928 1929 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 1940 1941 1
> 942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 195
> 7 1958 1959)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       33   ->    5610
Number of variables                 345   ->       8
j variable (170 values)                   ->   year
xij variables:
      left_1790 left_1791 ... left_1959   ->   left_
   right_1790 right_1791 ... right_1959   ->   right_
-----------------------------------------------------------------------------
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06357.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1959
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(1530 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start+offset
(1530 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(2425 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(1916 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(40 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(20 real changes made)

. 
. forval t = 70/130 {
  2.         gen byte treatment`t' = (event_time==`t')
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(416 missing values generated)

. gen log_large = ln(large)
(234 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(218 missing values generated)

. replace small_share=0 if total==0
(218 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(218 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(14 missing values generated)

. gen lag_deviation = L1.deviation
(14 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       1269
                                                  F(  10,     10) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.2107
                                                  Adj R-squared   =     0.0877
                                                  Root MSE        =     0.2192

                         (Std. Err. adjusted for 11 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .1404703   .0815429     1.72   0.116    -.0412187    .3221592
 treatment71 |   .1515287    .087925     1.72   0.116    -.0443804    .3474379
 treatment72 |    .148785   .0884641     1.68   0.124    -.0483252    .3458953
 treatment73 |   .1306494   .0945494     1.38   0.197    -.0800199    .3413187
 treatment74 |   .1291295   .0950198     1.36   0.204    -.0825877    .3408468
 treatment75 |   .1293262   .0948188     1.36   0.203    -.0819434    .3405957
 treatment76 |   .1277481   .0941732     1.36   0.205    -.0820829    .3375792
 treatment77 |   .1179876   .0921902     1.28   0.229     -.087425    .3234002
 treatment78 |   .1191549   .0947456     1.26   0.237    -.0919514    .3302612
 treatment79 |   .1147694   .0957016     1.20   0.258    -.0984671    .3280059
 treatment80 |   .1380461    .088227     1.56   0.149    -.0585358     .334628
 treatment81 |   .1344922   .0888484     1.51   0.161    -.0634742    .3324587
 treatment82 |   .1347573   .0898547     1.50   0.165    -.0654515    .3349661
 treatment83 |     .12754   .0929418     1.37   0.200    -.0795472    .3346273
 treatment84 |   .1261174   .0929565     1.36   0.205    -.0810026    .3332373
 treatment85 |   .1627619    .088162     1.85   0.095    -.0336752     .359199
 treatment86 |   .1392966   .0743148     1.87   0.090    -.0262871    .3048804
 treatment87 |   .1348085    .074015     1.82   0.099    -.0301072    .2997242
 treatment88 |   .1287503   .0745544     1.73   0.115    -.0373672    .2948679
 treatment89 |   .1306768   .0746441     1.75   0.111    -.0356405    .2969941
 treatment90 |    .128267   .0751612     1.71   0.119    -.0392026    .2957365
 treatment91 |   .1206958    .079495     1.52   0.160    -.0564302    .2978218
 treatment92 |     .09817   .0922614     1.06   0.312    -.1074013    .3037412
 treatment93 |   .1485003   .0876661     1.69   0.121    -.0468318    .3438325
 treatment94 |   .1332864   .0885865     1.50   0.163    -.0640965    .3306693
 treatment95 |   .1893857   .0928088     2.04   0.069    -.0174051    .3961765
 treatment96 |   .1829638   .0895783     2.04   0.068    -.0166291    .3825567
 treatment97 |   .1754039   .0916724     1.91   0.085    -.0288549    .3796628
 treatment98 |   .1798448   .0922021     1.95   0.080    -.0255943     .385284
 treatment99 |   .1846285   .0926975     1.99   0.074    -.0219144    .3911714
treatment100 |   .1873732   .0921862     2.03   0.070    -.0180304    .3927768
treatment101 |   .1662336    .099719     1.67   0.126    -.0559542    .3884214
treatment102 |   .1646899    .100906     1.63   0.134    -.0601427    .3895224
treatment103 |   .1707947    .102416     1.67   0.126    -.0574024    .3989918
treatment104 |   .1690389   .1020848     1.66   0.129    -.0584203     .396498
treatment105 |   .1716607   .0987868     1.74   0.113      -.04845    .3917714
treatment106 |   .1661992   .1020956     1.63   0.135     -.061284    .3936825
treatment107 |   .1676776   .1019132     1.65   0.131    -.0593991    .3947542
treatment108 |   .1839641   .0939247     1.96   0.079    -.0253131    .3932413
treatment109 |   .1850007   .0941835     1.96   0.078    -.0248533    .3948547
treatment110 |   .1669041   .0964734     1.73   0.114     -.048052    .3818601
treatment111 |   .1616927   .1008714     1.60   0.140    -.0630627    .3864481
treatment112 |   .1514611   .0973439     1.56   0.151    -.0654347    .3683569
treatment113 |   .1976083   .0902838     2.19   0.053    -.0035567    .3987732
treatment114 |   .2048043    .086976     2.35   0.040     .0110098    .3985989
treatment115 |   .1949712   .0888322     2.19   0.053    -.0029591    .3929016
treatment116 |   .1868142   .0886057     2.11   0.061    -.0106116      .38424
treatment117 |   .1939542   .0869535     2.23   0.050     .0002097    .3876987
treatment118 |   .1961064   .0860256     2.28   0.046     .0044294    .3877834
treatment119 |   .2251723   .0858062     2.62   0.025     .0339842    .4163604
treatment120 |   .2129854   .0909594     2.34   0.041     .0103153    .4156555
treatment121 |   .2155019   .0902884     2.39   0.038     .0143268     .416677
treatment122 |   .2306735   .0931044     2.48   0.033     .0232238    .4381231
treatment123 |   .2774809   .0926315     3.00   0.013     .0710851    .4838767
treatment124 |   .2814488   .0906164     3.11   0.011      .079543    .4833547
treatment125 |   .2616675   .0915319     2.86   0.017     .0577217    .4656133
treatment126 |    .266038   .0909373     2.93   0.015     .0634171    .4686588
treatment127 |   .2667809   .0914001     2.92   0.015     .0631288     .470433
treatment128 |   .2980633   .0917345     3.25   0.009     .0936661    .5024605
treatment129 |   .2990357   .0919313     3.25   0.009        .0942    .5038713
treatment130 |   .3034487   .0897582     3.38   0.007      .103455    .5034425
       _cons |   .2630353   .0852998     3.08   0.012     .0729755    .4530951
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(1269 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(44 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(22 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       1255
                                                  F(   3,     10) =       3.57
                                                  Prob > F        =     0.0547
                                                  R-squared       =     0.1021
                                                  Adj R-squared   =     0.0140
                                                  Root MSE        =     0.0507

                         (Std. Err. adjusted for 11 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   -.006802   .0020846    -3.26   0.009    -.0114468   -.0021572
lag_deviat~n |  -.0218014   .0123631    -1.76   0.108    -.0493482    .0057455
_IaftXlag_~1 |  -.0119828   .0289637    -0.41   0.688     -.076518    .0525524
       _cons |   .0017789   .0010892     1.63   0.133    -.0006479    .0042058
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(270 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(999 missing values generated)

. gen lower = small_share_hat - 1.96*se
(999 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/hudson.gph saved)

. 
. capture log close
