-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/hudson.log
  log type:  text
 opened on:   2 Jul 2014, 16:34:58

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54542.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54542.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
hudson
(37 vars, 33 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       33   ->     561
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54542.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(153 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(153 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(231 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(189 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(4 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(2 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(48 missing values generated)

. gen log_large = ln(large)
(29 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(27 missing values generated)

. replace small_share=0 if total==0
(27 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(27 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(14 missing values generated)

. gen lag_deviation = L10.deviation
(14 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        141
                                                  F(   7,     10) =       3.82
                                                  Prob > F        =     0.0277
                                                  R-squared       =     0.2497
                                                  Adj R-squared   =     0.1391
                                                  Root MSE        =     0.2207

                         (Std. Err. adjusted for 11 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .1395112   .0760942     1.83   0.097    -.0300373    .3090597
 treatment80 |   .1246923   .0966051     1.29   0.226    -.0905572    .3399419
 treatment90 |   .1382011    .072645     1.90   0.086    -.0236621    .3000643
treatment100 |   .1492237   .0848923     1.76   0.109    -.0399281    .3383754
treatment110 |   .1682587   .0982552     1.71   0.118    -.0506675    .3871848
treatment120 |    .199882    .089952     2.22   0.051    -.0005437    .4003076
treatment130 |   .2786559   .0897054     3.11   0.011     .0787798     .478532
       _cons |   .2553844   .0823922     3.10   0.011     .0718031    .4389656
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*treatment130 = 0

       F(  1,    10) =    6.21
            Prob > F =    0.0319

. predict small_share_hat, xb

. gen se = .
(141 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(4 real changes made)
(5 real changes made)
(5 real changes made)
(4 real changes made)
(3 real changes made)
(4 real changes made)

. replace se = _se[_cons] if event_time==70
(8 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        127
                                                  F(   3,     10) =       4.08
                                                  Prob > F        =     0.0392
                                                  R-squared       =     0.2194
                                                  Adj R-squared   =     0.1296
                                                  Root MSE        =     0.1504

                         (Std. Err. adjusted for 11 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0657691   .0189449    -3.47   0.006    -.1079809   -.0235573
lag_deviat~n |  -.2025385   .1139242    -1.78   0.106    -.4563775    .0513004
_IaftXlag_~1 |   .2029497   .2360221     0.86   0.410    -.3229403    .7288397
       _cons |    .016932   .0134797     1.26   0.238    -.0131027    .0469667
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(33 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(108 missing values generated)

. gen lower = small_share_hat - 1.96*se
(108 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/hudson.gph saved)

. 
. capture log close
