-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/mississippi.log
  log type:  text
 opened on:   2 Jul 2014, 16:35:00

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54548.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54548.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
mississippi
(37 vars, 335 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      335   ->    5695
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54548.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(3179 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(3179 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(1535 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(1506 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(57 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(15 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(1691 missing values generated)

. gen log_large = ln(large)
(1268 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(1205 missing values generated)

. replace small_share=0 if total==0
(1205 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(1205 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(244 missing values generated)

. gen lag_deviation = L10.deviation
(244 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       2654
                                                  F(   7,    144) =       6.74
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2326
                                                  Adj R-squared   =     0.2274
                                                  Root MSE        =     0.2039

                        (Std. Err. adjusted for 145 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0469597   .0327753     1.43   0.154    -.0178232    .1117426
 treatment80 |   .0774241   .0362755     2.13   0.035     .0057228    .1491254
 treatment90 |   .0746418   .0369549     2.02   0.045     .0015976    .1476859
treatment100 |   .0428372   .0339074     1.26   0.209    -.0241833    .1098576
treatment110 |   .0837933   .0263195     3.18   0.002     .0317708    .1358159
treatment120 |    .069801   .0261903     2.67   0.009      .018034    .1215681
treatment130 |   .0837146   .0311329     2.69   0.008     .0221781    .1452511
       _cons |   .1419836   .0090442    15.70   0.000      .124107    .1598602
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*treatment130 = 0

       F(  1,   144) =    0.11
            Prob > F =    0.7405

. predict small_share_hat, xb

. gen se = .
(2654 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(57 real changes made)
(57 real changes made)
(57 real changes made)
(49 real changes made)
(36 real changes made)
(40 real changes made)

. replace se = _se[_cons] if event_time==70
(114 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       2410
                                                  F(   3,    144) =      91.57
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1722
                                                  Adj R-squared   =     0.1677
                                                  Root MSE        =     0.1620

                        (Std. Err. adjusted for 145 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0343296   .0237121    -1.45   0.150    -.0811984    .0125391
lag_deviat~n |  -.3464551   .0214773   -16.13   0.000    -.3889065   -.3040037
_IaftXlag_~1 |   .0816228   .1060154     0.77   0.443    -.1279247    .2911702
       _cons |   .0974543   .0081368    11.98   0.000     .0813713    .1135372
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(410 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(2244 missing values generated)

. gen lower = small_share_hat - 1.96*se
(2244 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/mississippi.gph saved)

. 
. capture log close
