-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/missouri.log
  log type:  text
 opened on:   2 Jul 2014, 16:35:00

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54554.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54554.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
missouri
(37 vars, 335 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      335   ->    5695
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54554.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(4063 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(4063 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(938 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(1633 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(39 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(1 real change made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(2676 missing values generated)

. gen log_large = ln(large)
(2351 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(2332 missing values generated)

. replace small_share=0 if total==0
(2332 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(2332 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(278 missing values generated)

. gen lag_deviation = L10.deviation
(278 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       3124
                                                  F(   7,    176) =      14.23
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2698
                                                  Adj R-squared   =     0.2656
                                                  Root MSE        =     0.1430

                        (Std. Err. adjusted for 177 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .1071195    .043305     2.47   0.014     .0216556    .1925833
 treatment80 |   .2109394   .0485118     4.35   0.000     .1151997    .3066791
 treatment90 |   .2127551   .0457396     4.65   0.000     .1224864    .3030239
treatment100 |   .2160324   .0387353     5.58   0.000      .139587    .2924777
treatment110 |   .3005479   .0417203     7.20   0.000     .2182114    .3828844
treatment120 |   .2992404   .0530408     5.64   0.000     .1945626    .4039182
treatment130 |   .3089544   .0437816     7.06   0.000       .22255    .3953589
       _cons |   .0472148   .0059082     7.99   0.000     .0355547    .0588749
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*treatment130 = 0

       F(  1,   176) =    6.56
            Prob > F =    0.0113

. predict small_share_hat, xb

. gen se = .
(3124 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(39 real changes made)
(39 real changes made)
(39 real changes made)
(30 real changes made)
(21 real changes made)
(10 real changes made)

. replace se = _se[_cons] if event_time==70
(78 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       2846
                                                  F(   3,    176) =      34.43
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0970
                                                  Adj R-squared   =     0.0929
                                                  Root MSE        =     0.1104

                        (Std. Err. adjusted for 177 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0549848   .0187129    -2.94   0.004    -.0919154   -.0180542
lag_deviat~n |  -.2321211   .0264327    -8.78   0.000     -.284287   -.1799552
_IaftXlag_~1 |  -.1282177   .1428959    -0.90   0.371    -.4102276    .1537921
       _cons |   .0889962   .0111191     8.00   0.000     .0670522    .1109402
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(256 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(2868 missing values generated)

. gen lower = small_share_hat - 1.96*se
(2868 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/missouri.gph saved)

. 
. capture log close
