-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox/projects/borders/bridges/research_designs/con
> vergence/results/mississippi.log
  log type:  text
 opened on:  14 May 2014, 20:54:03

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26637.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26637.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
mississippi
(37 vars, 150 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      150   ->    2550
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26637.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(34 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(34 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(1171 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(292 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(106 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small_share = cond(left_before<right_before,left,right)/total
(189 missing values generated)

. replace small_share=0 if total==0
(189 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(189 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(148 missing values generated)

. gen lag_deviation = L10.deviation
(148 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =      1379
Group variable: river_bridge                    Number of groups   =       148

R-sq:  within  = 0.6098                         Obs per group: min =         1
       between = 0.0420                                        avg =       9.3
       overall = 0.2741                                        max =        13

                                                F(24,1207)         =     78.58
corr(u_i, Xb)  = -0.0891                        Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.0779059   .1629726    -0.48   0.633     -.397647    .2418352
         80  |   .0004345   .2110051     0.00   0.998     -.413543     .414412
         90  |   .0062992   .2641682     0.02   0.981    -.5119806     .524579
        100  |   .1008198   .3199943     0.32   0.753     -.526987    .7286266
        110  |   .1074005   .3762707     0.29   0.775    -.6308168    .8456178
        120  |   .1694565   .4344817     0.39   0.697    -.6829667     1.02188
        130  |   .1290353   .4935428     0.26   0.794    -.8392619    1.097332
        140  |   .3146394   .5929567     0.53   0.596     -.848701     1.47798
             |
        year |
       1800  |  -.5731904   .6084491    -0.94   0.346    -1.766926     .620545
       1810  |  -.1565267   .5838988    -0.27   0.789    -1.302096    .9890426
       1820  |  -.3286152   .5788462    -0.57   0.570    -1.464272    .8070413
       1830  |  -.0932458   .5866325    -0.16   0.874    -1.244178    1.057687
       1840  |    .419908   .6013975     0.70   0.485    -.7599927    1.599809
       1850  |   .5989784   .6235944     0.96   0.337     -.624471    1.822428
       1860  |   1.756681   .6533575     2.69   0.007      .474838    3.038523
       1870  |   2.114794   .6838016     3.09   0.002     .7732216    3.456365
       1880  |   2.474996   .7187726     3.44   0.001     1.064814    3.885179
       1890  |   3.075978    .757892     4.06   0.000     1.589046     4.56291
       1900  |   3.738794   .8029494     4.66   0.000     2.163463    5.314126
       1910  |   3.991991   .8458692     4.72   0.000     2.332454    5.651528
       1920  |   4.122788   .8882754     4.64   0.000     2.380053    5.865524
       1930  |   4.094116   .9347668     4.38   0.000     2.260168    5.928064
       1940  |   4.200231   .9813204     4.28   0.000     2.274947    6.125514
       1950  |   4.152125   1.032451     4.02   0.000     2.126527    6.177724
             |
       _cons |  -.0757787   .6232859    -0.12   0.903    -1.298623    1.147065
-------------+----------------------------------------------------------------
     sigma_u |  2.1879427
     sigma_e |  1.1529862
         rho |  .78265615   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(147, 1207) =    27.12           Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =      1379
Group variable: river_bridge                    Number of groups   =       148

R-sq:  within  = 0.6424                         Obs per group: min =         1
       between = 0.1417                                        avg =       9.3
       overall = 0.2926                                        max =        13

                                                F(24,1207)         =     90.36
corr(u_i, Xb)  = 0.0278                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.0069741   .1173934    -0.06   0.953    -.2372919    .2233438
         80  |   .0892128   .1519924     0.59   0.557    -.2089859    .3874116
         90  |   .1421763   .1902872     0.75   0.455    -.2311541    .5155068
        100  |   .0380387   .2305002     0.17   0.869    -.4141868    .4902642
        110  |   .1251741   .2710376     0.46   0.644    -.4065829    .6569312
        120  |   .0547519   .3129684     0.17   0.861    -.5592707    .6687744
        130  |    .000849   .3555117     0.00   0.998    -.6966406    .6983386
        140  |  -.1771301   .4271221    -0.41   0.678    -1.015114    .6608542
             |
        year |
       1800  |   .0833685   .4382817     0.19   0.849    -.7765101     .943247
       1810  |   .1479562   .4205974     0.35   0.725    -.6772271    .9731395
       1820  |   .2404164   .4169579     0.58   0.564    -.5776265    1.058459
       1830  |   .2593035   .4225666     0.61   0.540    -.5697432     1.08835
       1840  |   .5976318   .4332023     1.38   0.168    -.2522813    1.447545
       1850  |   1.315368   .4491912     2.93   0.003     .4340852     2.19665
       1860  |   1.829527   .4706304     3.89   0.000     .9061822    2.752871
       1870  |   2.038748   .4925601     4.14   0.000     1.072379    3.005117
       1880  |   2.349251   .5177506     4.54   0.000      1.33346    3.365042
       1890  |   2.925132   .5459293     5.36   0.000     1.854056    3.996207
       1900  |   3.374164   .5783853     5.83   0.000     2.239412    4.508916
       1910  |   3.727295   .6093015     6.12   0.000     2.531888    4.922703
       1920  |   3.825686   .6398478     5.98   0.000     2.570348    5.081023
       1930  |   3.940574   .6733368     5.85   0.000     2.619533    5.261615
       1940  |     4.0265   .7068706     5.70   0.000     2.639668    5.413331
       1950  |   4.110288   .7437016     5.53   0.000     2.651197     5.56938
             |
       _cons |   -.036158    .448969    -0.08   0.936    -.9170043    .8446884
-------------+----------------------------------------------------------------
     sigma_u |  2.2143901
     sigma_e |  .83052593
         rho |  .87667858   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(147, 1207) =    49.87           Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =      1379
Group variable: river_bridge                    Number of groups   =       148

R-sq:  within  = 0.3398                         Obs per group: min =         1
       between = 0.0157                                        avg =       9.3
       overall = 0.1552                                        max =        13

                                                F(17,1214)         =     36.75
corr(u_i, Xb)  = -0.0644                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .0241823   .0127657     1.89   0.058    -.0008629    .0492275
             |
        year |
       1800  |   .0120971     .06122     0.20   0.843    -.1080116    .1322058
       1810  |   .0429423    .058497     0.73   0.463    -.0718241    .1577088
       1820  |   .0798638   .0572362     1.40   0.163    -.0324291    .1921566
       1830  |   .0999159   .0564971     1.77   0.077    -.0109268    .2107586
       1840  |   .1829366   .0562275     3.25   0.001     .0726227    .2932505
       1850  |    .185431   .0559838     3.31   0.001     .0755952    .2952667
       1860  |    .266989   .0559046     4.78   0.000     .1573087    .3766693
       1870  |   .2658745   .0560165     4.75   0.000     .1559747    .3757743
       1880  |    .290666   .0562035     5.17   0.000     .1803992    .4009327
       1890  |   .3382823   .0564364     5.99   0.000     .2275586     .449006
       1900  |    .339483   .0567439     5.98   0.000     .2281561    .4508099
       1910  |   .3395734   .0570094     5.96   0.000     .2277254    .4514213
       1920  |   .3311089   .0574729     5.76   0.000     .2183518    .4438661
       1930  |   .3293918   .0580585     5.67   0.000     .2154858    .4432979
       1940  |   .3283064   .0587013     5.59   0.000     .2131391    .4434737
       1950  |   .3265629   .0591638     5.52   0.000     .2104882    .4426376
             |
       _cons |  -.0564566   .0546742    -1.03   0.302     -.163723    .0508099
-------------+----------------------------------------------------------------
     sigma_u |  .15490168
     sigma_e |  .11620099
         rho |  .63990192   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(147, 1214) =    14.91           Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       1379
                                                  F(   8,     62) =       3.08
                                                  Prob > F        =     0.0055
                                                  R-squared       =     0.1646
                                                  Adj R-squared   =     0.1498
                                                  Root MSE        =     0.1837

                         (Std. Err. adjusted for 63 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0034898    .011341     0.31   0.759    -.0191805    .0261601
         80  |   .0052929   .0155494     0.34   0.735    -.0257899    .0363757
         90  |    .019856   .0195263     1.02   0.313    -.0191765    .0588884
        100  |   .0087351   .0198204     0.44   0.661    -.0308852    .0483554
        110  |   .0365372   .0208864     1.75   0.085    -.0052142    .0782885
        120  |   .0352533   .0231776     1.52   0.133    -.0110781    .0815847
        130  |   .0593284   .0254318     2.33   0.023      .008491    .1101659
        140  |   .0829084    .032174     2.58   0.012     .0185936    .1472233
             |
       _cons |   .2127772   .0207799    10.24   0.000     .1712388    .2543156
-------------+----------------------------------------------------------------
        year |   absorbed                                      (17 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    62) =    6.24
            Prob > F =    0.0152

. predict small_share_hat, xb

. gen se = .
(1379 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(138 real changes made)
(130 real changes made)
(120 real changes made)
(109 real changes made)
(103 real changes made)
(92 real changes made)
(80 real changes made)
(174 real changes made)

. replace se = _se[_cons] if event_time==60
(433 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       1231
                                                  F(   3,     60) =      16.95
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1491
                                                  Adj R-squared   =     0.1365
                                                  Root MSE        =     0.0971

                         (Std. Err. adjusted for 61 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0544836   .0109757    -4.96   0.000    -.0764382   -.0325289
lag_deviat~n |  -.2076268   .0395418    -5.25   0.000    -.2867221   -.1285314
_IaftXlag_~1 |   .1567513    .044641     3.51   0.001      .067456    .2460465
       _cons |    .048271   .0111084     4.35   0.000      .026051    .0704911
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (16 categories)

. 
. replace event_time = event_time - offset
(1379 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/mississippi.gph saved)

. 
. capture log close
