-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/Home/Dropbox/projects/borders/bridges/research_designs/co
> nvergence/results/ohio.log
  log type:  text
 opened on:   6 Oct 2014, 09:24:44

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06372.000001 no
> t found)
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06372.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
ohio
(343 vars, 164 obs)
(note: j = 1790 1791 1792 1793 1794 1795 1796 1797 1798 1799 1800 1801 1802 180
> 3 1804 1805 1806 1807 1808 1809 1810 1811 1812 1813 1814 1815 1816 1817 1818 
> 1819 1820 1821 1822 1823 1824 1825 1826 1827 1828 1829 1830 1831 1832 1833 18
> 34 1835 1836 1837 1838 1839 1840 1841 1842 1843 1844 1845 1846 1847 1848 1849
>  1850 1851 1852 1853 1854 1855 1856 1857 1858 1859 1860 1861 1862 1863 1864 1
> 865 1866 1867 1868 1869 1870 1871 1872 1873 1874 1875 1876 1877 1878 1879 188
> 0 1881 1882 1883 1884 1885 1886 1887 1888 1889 1890 1891 1892 1893 1894 1895 
> 1896 1897 1898 1899 1900 1901 1902 1903 1904 1905 1906 1907 1908 1909 1910 19
> 11 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 1924 1925 1926
>  1927 1928 1929 1930 1931 1932 1933 1934 1935 1936 1937 1938 1939 1940 1941 1
> 942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 195
> 7 1958 1959)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      164   ->   27880
Number of variables                 345   ->       8
j variable (170 values)                   ->   year
xij variables:
      left_1790 left_1791 ... left_1959   ->   left_
   right_1790 right_1791 ... right_1959   ->   right_
-----------------------------------------------------------------------------
file /var/folders/3z/vtnw_t3n5rj8d9vqpx133bsh0000gn/T//St06372.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1959
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(12070 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start+offset
(12070 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(10980 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(7680 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(240 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(19 real changes made)

. 
. forval t = 70/130 {
  2.         gen byte treatment`t' = (event_time==`t')
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(4363 missing values generated)

. gen log_large = ln(large)
(2507 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(2358 missing values generated)

. replace small_share=0 if total==0
(2358 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(2358 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900
                delta:  1 unit

. gen change = deviation-L1.deviation
(95 missing values generated)

. gen lag_deviation = L1.deviation
(95 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       9220
                                                  F(  60,     61) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.2459
                                                  Adj R-squared   =     0.2317
                                                  Root MSE        =     0.2034

                         (Std. Err. adjusted for 62 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0479998   .0397157     1.21   0.231    -.0314166    .1274162
 treatment71 |   .0442954   .0421042     1.05   0.297    -.0398971    .1284878
 treatment72 |   .0319203   .0407513     0.78   0.436     -.049567    .1134076
 treatment73 |   .0336898   .0416073     0.81   0.421    -.0495093    .1168888
 treatment74 |   .0239799   .0403151     0.59   0.554    -.0566351    .1045949
 treatment75 |   .0245818   .0407864     0.60   0.549    -.0569757    .1061392
 treatment76 |   .0199879   .0392624     0.51   0.613    -.0585222     .098498
 treatment77 |   .0136668   .0390003     0.35   0.727    -.0643192    .0916528
 treatment78 |   .0189382   .0414532     0.46   0.649    -.0639526    .1018291
 treatment79 |   .0467497   .0381301     1.23   0.225    -.0294962    .1229955
 treatment80 |    .045844   .0387066     1.18   0.241    -.0315545    .1232426
 treatment81 |   .0441995   .0404693     1.09   0.279    -.0367239    .1251229
 treatment82 |   .0458167   .0386007     1.19   0.240    -.0313702    .1230037
 treatment83 |   .0463005   .0397874     1.16   0.249    -.0332594    .1258604
 treatment84 |   .0579442   .0403998     1.43   0.157    -.0228402    .1387286
 treatment85 |    .053037   .0395505     1.34   0.185    -.0260491     .132123
 treatment86 |   .0701347     .03968     1.77   0.082    -.0092104    .1494798
 treatment87 |   .0658187   .0378358     1.74   0.087    -.0098388    .1414761
 treatment88 |   .0629383   .0376135     1.67   0.099    -.0122745    .1381512
 treatment89 |   .0544345   .0365891     1.49   0.142    -.0187299    .1275989
 treatment90 |   .0540325    .036577     1.48   0.145    -.0191078    .1271728
 treatment91 |   .0536694   .0373605     1.44   0.156    -.0210377    .1283764
 treatment92 |   .0582414   .0371017     1.57   0.122    -.0159479    .1324308
 treatment93 |     .05535    .036242     1.53   0.132    -.0171203    .1278203
 treatment94 |    .057618   .0358387     1.61   0.113    -.0140459    .1292819
 treatment95 |   .0510765   .0360236     1.42   0.161    -.0209571    .1231101
 treatment96 |   .0688048   .0373528     1.84   0.070    -.0058867    .1434964
 treatment97 |   .0731223   .0405767     1.80   0.076    -.0080159    .1542605
 treatment98 |   .0797683   .0403847     1.98   0.053    -.0009859    .1605224
 treatment99 |   .0799671   .0380721     2.10   0.040     .0038372     .156097
treatment100 |   .0969473   .0382282     2.54   0.014     .0205053    .1733893
treatment101 |   .0944623   .0398586     2.37   0.021     .0147601    .1741645
treatment102 |    .096082    .040822     2.35   0.022     .0144535    .1777106
treatment103 |    .091612   .0402566     2.28   0.026     .0111139    .1721101
treatment104 |   .0979349   .0427261     2.29   0.025     .0124987     .183371
treatment105 |   .0935041   .0431147     2.17   0.034     .0072909    .1797174
treatment106 |    .076497   .0405393     1.89   0.064    -.0045664    .1575604
treatment107 |   .0582473   .0421459     1.38   0.172    -.0260286    .1425231
treatment108 |   .0547875   .0418666     1.31   0.196      -.02893     .138505
treatment109 |   .0382751   .0421024     0.91   0.367    -.0459138     .122464
treatment110 |   .0506262   .0454635     1.11   0.270    -.0402837    .1415361
treatment111 |    .037639   .0460435     0.82   0.417    -.0544307    .1297086
treatment112 |   .0706953    .039875     1.77   0.081    -.0090396    .1504302
treatment113 |   .0646001   .0393493     1.64   0.106    -.0140837    .1432839
treatment114 |   .0699461   .0350087     2.00   0.050    -.0000583    .1399504
treatment115 |   .0565798   .0419814     1.35   0.183    -.0273671    .1405268
treatment116 |   .0594283    .047009     1.26   0.211    -.0345721    .1534287
treatment117 |   .0736931   .0444873     1.66   0.103    -.0152648     .162651
treatment118 |   .0956066   .0448922     2.13   0.037     .0058391    .1853741
treatment119 |   .0921381   .0454276     2.03   0.047     .0013001    .1829761
treatment120 |   .0836131   .0423415     1.97   0.053     -.001054    .1682803
treatment121 |   .0723407   .0435712     1.66   0.102    -.0147853    .1594668
treatment122 |   .0743297   .0495383     1.50   0.139    -.0247284    .1733877
treatment123 |   .0833078   .0484606     1.72   0.091    -.0135951    .1802106
treatment124 |   .0827703   .0574455     1.44   0.155    -.0320992    .1976398
treatment125 |   .0917718    .058478     1.57   0.122    -.0251621    .2087057
treatment126 |   .0864984   .0575435     1.50   0.138     -.028567    .2015638
treatment127 |   .0951773   .0623806     1.53   0.132    -.0295604    .2199149
treatment128 |   .0940486   .0619589     1.52   0.134     -.029846    .2179431
treatment129 |   .1077247   .0742482     1.45   0.152    -.0407438    .2561932
treatment130 |    .015619   .0421496     0.37   0.712    -.0686644    .0999024
       _cons |    .203485   .0181113    11.24   0.000     .1672693    .2397008
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (111 categories)

. *test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+tre
> atment130)/3
. predict small_share_hat, xb

. gen se = .
(9220 missing values generated)

. forval t=70/130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(264 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(24 real changes made)
(22 real changes made)
(21 real changes made)
(20 real changes made)
(20 real changes made)
(20 real changes made)
(20 real changes made)
(20 real changes made)
(20 real changes made)
(19 real changes made)
(19 real changes made)
(18 real changes made)
(17 real changes made)
(17 real changes made)
(16 real changes made)
(14 real changes made)
(13 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(10 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(8 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(7 real changes made)
(6 real changes made)
(24 real changes made)

. *replace se = _se[_cons] if event_time==70
. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       9125
                                                  F(   3,     61) =      17.45
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0385
                                                  Adj R-squared   =     0.0265
                                                  Root MSE        =     0.0571

                         (Std. Err. adjusted for 62 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0065784   .0022235    -2.96   0.004    -.0110246   -.0021321
lag_deviat~n |  -.0384435   .0053821    -7.14   0.000    -.0492057   -.0276814
_IaftXlag_~1 |   .0397998   .0097844     4.07   0.000     .0202346     .059365
       _cons |   .0081379   .0013968     5.83   0.000     .0053449    .0109309
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (110 categories)

. 
. replace event_time = event_time - offset
(1339 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(7881 missing values generated)

. gen lower = small_share_hat - 1.96*se
(7881 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/ohio.gph saved)

. 
. capture log close
