-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox/projects/borders/bridges/research_designs/con
> vergence/results/ohio.log
  log type:  text
 opened on:  14 May 2014, 20:54:03

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26649.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26649.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
ohio
(37 vars, 94 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       94   ->    1598
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26649.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(17 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(17 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(833 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(182 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(44 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small_share = cond(left_before<right_before,left,right)/total
(10 missing values generated)

. replace small_share=0 if total==0
(10 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(10 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(93 missing values generated)

. gen lag_deviation = L10.deviation
(93 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       765
Group variable: river_bridge                    Number of groups   =        93

R-sq:  within  = 0.6391                         Obs per group: min =         1
       between = 0.0542                                        avg =       8.2
       overall = 0.2466                                        max =        13

                                                F(24,648)          =     47.82
corr(u_i, Xb)  = -0.0400                        Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.2957919   .4622963    -0.64   0.523    -1.203572    .6119879
         80  |   -.230056   .6037543    -0.38   0.703    -1.415607    .9554951
         90  |   .0938634   .7632159     0.12   0.902    -1.404811    1.592538
        100  |   .2269951   .9247621     0.25   0.806    -1.588897    2.042887
        110  |   .2929264   1.085729     0.27   0.787    -1.839046    2.424898
        120  |   .4939531    1.25387     0.39   0.694    -1.968185    2.956091
        130  |   .7314354   1.424028     0.51   0.608    -2.064831    3.527702
        140  |   1.887544   1.710151     1.10   0.270    -1.470564    5.245651
             |
        year |
       1800  |  -.4786445   2.897582    -0.17   0.869    -6.168429     5.21114
       1810  |   .0549754   2.710616     0.02   0.984    -5.267675    5.377626
       1820  |   1.770504   2.690915     0.66   0.511    -3.513462     7.05447
       1830  |    2.05577   2.697461     0.76   0.446     -3.24105    7.352589
       1840  |   3.623687   2.734181     1.33   0.186    -1.745236    8.992611
       1850  |   4.263531   2.778445     1.53   0.125    -1.192312    9.719374
       1860  |   5.093232   2.852982     1.79   0.075    -.5089749    10.69544
       1870  |   5.989496   2.911429     2.06   0.040     .2725215    11.70647
       1880  |   7.162875   2.974317     2.41   0.016     1.322412    13.00334
       1890  |   8.852312   3.073404     2.88   0.004     2.817279    14.88734
       1900  |   10.63631   3.183937     3.34   0.001     4.384226    16.88838
       1910  |   10.99766   3.291595     3.34   0.001     4.534174    17.46114
       1920  |   11.16878   3.375501     3.31   0.001     4.540536    17.79702
       1930  |   11.39725   3.482634     3.27   0.001     4.558642    18.23586
       1940  |   11.42207    3.60423     3.17   0.002     4.344686    18.49945
       1950  |   11.33326   3.717966     3.05   0.002     4.032549    18.63398
             |
       _cons |  -1.273981   2.857935    -0.45   0.656    -6.885913    4.337951
-------------+----------------------------------------------------------------
     sigma_u |  5.7709155
     sigma_e |  2.4499917
         rho |  .84728869   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(92, 648) =    35.07             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       765
Group variable: river_bridge                    Number of groups   =        93

R-sq:  within  = 0.6594                         Obs per group: min =         1
       between = 0.0953                                        avg =       8.2
       overall = 0.3351                                        max =        13

                                                F(24,648)          =     52.28
corr(u_i, Xb)  = 0.0109                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .1361505   .4461838     0.31   0.760    -.7399902    1.012291
         80  |   .3150374   .5827115     0.54   0.589    -.8291933    1.459268
         90  |   .5751084   .7366153     0.78   0.435    -.8713327     2.02155
        100  |   .9550119   .8925311     1.07   0.285    -.7975904    2.707614
        110  |   1.325947   1.047888     1.27   0.206    -.7317188    3.383613
        120  |    1.75948   1.210168     1.45   0.146    -.6168447    4.135805
        130  |   1.986229   1.374396     1.45   0.149    -.7125785    4.685037
        140  |   2.341061   1.650547     1.42   0.157    -.9000054    5.582127
             |
        year |
       1800  |  -1.215394   2.796592    -0.43   0.664     -6.70687    4.276083
       1810  |  -1.762347   2.616142    -0.67   0.501    -6.899486    3.374792
       1820  |  -.5956252   2.597128    -0.23   0.819    -5.695428    4.504177
       1830  |  -1.146182   2.603446    -0.44   0.660     -6.25839    3.966027
       1840  |  -.3548259   2.638885    -0.13   0.893    -5.536625    4.826973
       1850  |  -.2187098   2.681607    -0.08   0.935    -5.484399    5.046979
       1860  |   .4582667   2.753547     0.17   0.868    -4.948685    5.865218
       1870  |   .8430775   2.809956     0.30   0.764    -4.674641    6.360796
       1880  |   1.651946   2.870653     0.58   0.565    -3.984958    7.288851
       1890  |   3.670933   2.966286     1.24   0.216    -2.153759    9.495625
       1900  |   5.592712   3.072966     1.82   0.069    -.4414612    11.62689
       1910  |   6.416792   3.176873     2.02   0.044     .1785851      12.655
       1920  |   6.383029   3.257854     1.96   0.051    -.0141959    12.78025
       1930  |   6.647409   3.361252     1.98   0.048     .0471475    13.24767
       1940  |   6.539888   3.478611     1.88   0.061    -.2908228     13.3706
       1950  |   6.521559   3.588383     1.82   0.070    -.5247036    13.56782
             |
       _cons |   1.676663   2.758327     0.61   0.543    -3.739675    7.093001
-------------+----------------------------------------------------------------
     sigma_u |  4.4679497
     sigma_e |  2.3646015
         rho |  .78119438   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(92, 648) =    24.98             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       765
Group variable: river_bridge                    Number of groups   =        93

R-sq:  within  = 0.2796                         Obs per group: min =         1
       between = 0.0304                                        avg =       8.2
       overall = 0.1523                                        max =        13

                                                F(17,655)          =     14.95
corr(u_i, Xb)  = -0.0218                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .0301602    .015217     1.98   0.048     .0002803    .0600401
             |
        year |
       1800  |   .0747147   .1199694     0.62   0.534    -.1608563    .3102857
       1810  |   .0734428   .1111104     0.66   0.509    -.1447326    .2916183
       1820  |   .0454642   .1097331     0.41   0.679    -.1700068    .2609351
       1830  |   .0669602   .1086831     0.62   0.538    -.1464491    .2803695
       1840  |    .117529   .1083812     1.08   0.279    -.0952875    .3303456
       1850  |   .1731649   .1081816     1.60   0.110    -.0392596    .3855894
       1860  |    .201863   .1078972     1.87   0.062    -.0100031     .413729
       1870  |   .2150927   .1079554     1.99   0.047     .0031122    .4270732
       1880  |   .2155763   .1080746     1.99   0.046     .0033618    .4277908
       1890  |   .2692061   .1082626     2.49   0.013     .0566225    .4817897
       1900  |   .2696663   .1085185     2.48   0.013     .0565802    .4827523
       1910  |   .2774993   .1088385     2.55   0.011      .063785    .4912137
       1920  |   .2763424   .1090197     2.53   0.011     .0622721    .4904127
       1930  |   .2745832   .1096046     2.51   0.012     .0593645    .4898019
       1940  |   .2726629   .1099751     2.48   0.013     .0567167    .4886091
       1950  |     .27257   .1101441     2.47   0.014     .0562919    .4888481
             |
       _cons |   .1170842   .1071716     1.09   0.275    -.0933572    .3275255
-------------+----------------------------------------------------------------
     sigma_u |  .10927005
     sigma_e |  .10170718
         rho |  .53580082   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(92, 655) =    10.15             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        765
                                                  F(   8,     41) =       2.63
                                                  Prob > F        =     0.0201
                                                  R-squared       =     0.1572
                                                  Adj R-squared   =     0.1299
                                                  Root MSE        =     0.1490

                         (Std. Err. adjusted for 42 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.0039744    .014058    -0.28   0.779     -.032365    .0244163
         80  |  -.0187736   .0198783    -0.94   0.350    -.0589185    .0213714
         90  |  -.0056448   .0188548    -0.30   0.766    -.0437229    .0324333
        100  |   .0094687   .0222997     0.42   0.673    -.0355664    .0545039
        110  |   .0308443   .0241015     1.28   0.208    -.0178297    .0795182
        120  |   .0406627   .0220643     1.84   0.073    -.0038971    .0852225
        130  |   .0512296   .0234984     2.18   0.035     .0037736    .0986856
        140  |    .053628   .0346255     1.55   0.129    -.0162997    .1235557
             |
       _cons |    .355726   .0187467    18.98   0.000     .3178663    .3935856
-------------+----------------------------------------------------------------
        year |   absorbed                                      (17 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    41) =    8.06
            Prob > F =    0.0070

. predict small_share_hat, xb

. gen se = .
(765 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(82 real changes made)
(77 real changes made)
(66 real changes made)
(56 real changes made)
(52 real changes made)
(49 real changes made)
(42 real changes made)
(73 real changes made)

. replace se = _se[_cons] if event_time==60
(268 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        672
                                                  F(   3,     40) =       7.44
                                                  Prob > F        =     0.0004
                                                  R-squared       =     0.1872
                                                  Adj R-squared   =     0.1648
                                                  Root MSE        =     0.0709

                         (Std. Err. adjusted for 41 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0290143   .0074988    -3.87   0.000      -.04417   -.0138586
lag_deviat~n |  -.2182304   .0548523    -3.98   0.000     -.329091   -.1073699
_IaftXlag_~1 |   .1779478   .0404115     4.40   0.000     .0962731    .2596226
       _cons |   .0235371   .0060889     3.87   0.000     .0112309    .0358432
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (16 categories)

. 
. replace event_time = event_time - offset
(765 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/ohio.gph saved)

. 
. capture log close
