-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/pooled_event_study.log
  log type:  text
 opened on:   2 Jul 2014, 12:09:08

. 
. do create_variables  `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' 

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
arkansas
(37 vars, 86 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       86   ->    1462
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 20 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       20   ->     340
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 32 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       32   ->     544
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str36, now str46 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 54 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       54   ->     918
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 39 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       39   ->     663
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str50 to accommodate using data's values)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 24 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       24   ->     408
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str50 to accommodate using data's values)
(note: variable river was str6, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 150 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      150   ->    2550
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 98 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       98   ->    1666
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str42, now str61 to accommodate using data's values)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 94 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       94   ->    1598
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str45, now str61 to accommodate using data's values)
(note: variable river was str4, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 32 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       32   ->     544
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str34, now str61 to accommodate using data's values)
(note: variable river was str3, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 38 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       38   ->     646
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str61 to accommodate using data's values)
(note: variable river was str5, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved
arkansas
(37 vars, 27 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       27   ->     459
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str57, now str61 to accommodate using data's values)
(note: variable river was str9, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50470.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(765 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(765 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(5616 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(1235 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(423 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(1960 missing values generated)

. gen log_large = ln(large)
(1285 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(1237 missing values generated)

. replace small_share=0 if total==0
(1237 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(1237 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(649 missing values generated)

. gen lag_deviation = L10.deviation
(649 missing values generated)

. 
end of do-file

. 
. forval r=1/12 {
  2.         gen river_mile_`r' = river_mile*(river=="``r''")
  3. }

. 
. xtpoisson total i.event_time river_mile_*, i(river_year) fe
warning: existing panel variable is not river_year
note: 7 groups (7 obs) dropped because of only one obs per group
note: 21 groups (177 obs) dropped because of all zero outcomes

Iteration 0:   log likelihood = -18785.016  
Iteration 1:   log likelihood = -15744.977  
Iteration 2:   log likelihood = -15653.625  
Iteration 3:   log likelihood = -15652.111  
Iteration 4:   log likelihood = -15652.111  

Conditional fixed-effects Poisson regression    Number of obs      =      5998
Group variable: river_year                      Number of groups   =       163

                                                Obs per group: min =         2
                                                               avg =      36.8
                                                               max =       133

                                                Wald chi2(21)      =   5412.95
Log likelihood  = -15652.111                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       total |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0043561   .0195421     0.22   0.824    -.0339458     .042658
         80  |    .035961   .0190122     1.89   0.059    -.0013022    .0732243
         90  |   .0265119   .0191318     1.39   0.166    -.0109857    .0640095
        100  |   .0378804   .0191926     1.97   0.048     .0002635    .0754972
        110  |   .0656179   .0195014     3.36   0.001     .0273958      .10384
        120  |   .0694034   .0196358     3.53   0.000     .0309179    .1078888
        130  |    .093141   .0205399     4.53   0.000     .0528834    .1333985
        140  |     .12599   .0170088     7.41   0.000     .0926534    .1593265
             |
river_mile~q |  -6.46e-07   3.34e-08   -19.36   0.000    -7.12e-07   -5.81e-07
river_mile_1 |   -.002633   .0000994   -26.48   0.000    -.0028279   -.0024381
river_mile_2 |  -.0003769   .0002155    -1.75   0.080    -.0007993    .0000456
river_mile_3 |  -.0019412    .000151   -12.86   0.000    -.0022372   -.0016453
river_mile_4 |  -.0033891   .0001788   -18.96   0.000    -.0037395   -.0030387
river_mile_5 |  -.0049422   .0001923   -25.70   0.000     -.005319   -.0045653
river_mile_6 |  -.0071114   .0001911   -37.21   0.000    -.0074859   -.0067368
river_mile_7 |   .0012139   .0000784    15.49   0.000     .0010603    .0013675
river_mile_8 |   .0005436   .0000661     8.23   0.000     .0004141    .0006732
river_mile_9 |   .0014949   .0000516    28.95   0.000     .0013937    .0015962
river_mil~10 |  -.0028215   .0002397   -11.77   0.000    -.0032914   -.0023517
river_mil~11 |   .0000211   .0001862     0.11   0.910     -.000344    .0003861
river_mil~12 |   .0016425    .000168     9.77   0.000     .0013132    .0019719
------------------------------------------------------------------------------

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*[total]70.event_time - .25*[total]80.event_time -
       .25*[total]90.event_time + .25*[total]110.event_time +
       .25*[total]120.event_time + .25*[total]130.event_time +
       .25*[total]140.event_time = 0

           chi2(  1) =   40.36
         Prob > chi2 =    0.0000

. gen po_hat = .
(6182 missing values generated)

. gen se = .
(6182 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace po_hat = _b[`t'.event_time] if event_time==`t'
  3.         replace se = _se[`t'.event_time] if event_time==`t'
  4. }
(601 real changes made)
(601 real changes made)
(586 real changes made)
(586 real changes made)
(568 real changes made)
(568 real changes made)
(534 real changes made)
(534 real changes made)
(488 real changes made)
(488 real changes made)
(462 real changes made)
(462 real changes made)
(382 real changes made)
(382 real changes made)
(716 real changes made)
(716 real changes made)

. replace po_hat = 0 if event_time==60
(1845 real changes made)

. replace se = 0 if event_time==60
(1845 real changes made)

. 
. replace event_time = event_time - offset
(6182 real changes made)

. label var po_hat "Post office count (log)"

. label var event_time "Years since bridge"

. 
. gen upper = po_hat + 1.96*se

. gen lower = po_hat - 1.96*se

. tw (area  upper lower event_time, base(-0.05 -0.05) sort astyle( ci plotregio
> n)) (line po_hat event_time, sort),  scheme(s2color) legend(order(1 "95% conf
> idence interval" 3 "Post office count (log)"))

. graph save results/pooled_event_study.gph, replace
(file results/pooled_event_study.gph saved)

. 
. 
. capture log close
