---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/research_designs/convergence/r
> esults/pooled.log
  log type:  text
 opened on:   2 Jul 2014, 16:32:27

. 
. do create_variables  `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' 

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 not found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
arkansas
(37 vars, 145 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      145   ->    2465
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 159 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      159   ->    2703
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 104 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      104   ->    1768
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str36, now str46 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 55 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       55   ->     935
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 53 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       53   ->     901
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str50 to accommodate using data's values)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 33 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       33   ->     561
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str50 to accommodate using data's values)
(note: variable river was str6, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 335 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      335   ->    5695
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 335 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      335   ->    5695
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str42, now str61 to accommodate using data's values)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 164 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      164   ->    2788
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str45, now str61 to accommodate using data's values)
(note: variable river was str4, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 126 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      126   ->    2142
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str34, now str61 to accommodate using data's values)
(note: variable river was str3, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 128 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      128   ->    2176
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str61 to accommodate using data's values)
(note: variable river was str5, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved
arkansas
(37 vars, 75 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       75   ->    1275
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str57, now str61 to accommodate using data's values)
(note: variable river was str9, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//S_16047.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(18071 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(18071 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(6509 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(8240 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(220 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing(event_time)
(56 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(11208 missing values generated)

. gen log_large = ln(large)
(9490 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(9324 missing values generated)

. replace small_share=0 if total==0
(9324 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/sqrt(total)
(9324 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(1300 missing values generated)

. gen lag_deviation = L10.deviation
(1300 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =      14355
                                                  F(   7,    817) =       7.34
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.3379
                                                  Adj R-squared   =     0.3309
                                                  Root MSE        =     0.1593

                        (Std. Err. adjusted for 818 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |   .0560738   .0168041     3.34   0.001     .0230896     .089058
 treatment80 |   .0733888   .0198237     3.70   0.000     .0344774    .1123001
 treatment90 |   .0665628   .0205977     3.23   0.001     .0261322    .1069935
treatment100 |   .0634288   .0217185     2.92   0.004     .0207983    .1060593
treatment110 |   .1318226   .0210388     6.27   0.000     .0905261    .1731191
treatment120 |   .1174911    .023175     5.07   0.000     .0720016    .1629806
treatment130 |   .1347317   .0280108     4.81   0.000     .0797501    .1897132
       _cons |   .0837322   .0035719    23.44   0.000     .0767209    .0907434
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (144 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+treatment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 - .3333333*treatment120 -
       .3333333*treatment130 = 0

       F(  1,   817) =    9.91
            Prob > F =    0.0017

. predict small_share_hat, xb

. gen se = .
(14355 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(226 real changes made)
(235 real changes made)
(236 real changes made)
(186 real changes made)
(130 real changes made)
(145 real changes made)

. replace se = _se[_cons] if event_time==70
(441 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =      13055
                                                  F(   3,    817) =     205.96
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1576
                                                  Adj R-squared   =     0.1489
                                                  Root MSE        =     0.1250

                         (Std. Err. adjusted for 818 clusters in river_segment)
-------------------------------------------------------------------------------
              |               Robust
       change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
    _Iafter_1 |  -.0404649   .0100685    -4.02   0.000    -.0602281   -.0207017
lag_deviation |  -.2978487   .0124641   -23.90   0.000    -.3223141   -.2733832
_IaftXlag_d_1 |  -.0528375   .0541573    -0.98   0.330    -.1591413    .0534663
        _cons |     .10729   .0049735    21.57   0.000     .0975276    .1170525
--------------+----------------------------------------------------------------
   river_year |   absorbed                                     (132 categories)

. 
. replace event_time = event_time - offset
(1599 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(12756 missing values generated)

. gen lower = small_share_hat - 1.96*se
(12756 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_share_hat event_time, sort),
>   scheme(s2color) legend(order(1 "95% confidence interval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/pooled.gph, replace
(file results/pooled.gph saved)

. 
. 
. capture log close
