-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/pooled.log
  log type:  text
 opened on:   2 Jul 2014, 12:09:08

. 
. do create_variables  `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' 

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
arkansas
(37 vars, 86 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       86   ->    1462
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 20 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       20   ->     340
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 32 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       32   ->     544
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str36, now str46 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 54 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       54   ->     918
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 39 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       39   ->     663
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str50 to accommodate using data's values)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 24 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       24   ->     408
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str50 to accommodate using data's values)
(note: variable river was str6, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 150 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      150   ->    2550
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 98 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       98   ->    1666
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str42, now str61 to accommodate using data's values)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 94 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       94   ->    1598
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str45, now str61 to accommodate using data's values)
(note: variable river was str4, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 32 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       32   ->     544
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str34, now str61 to accommodate using data's values)
(note: variable river was str3, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 38 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       38   ->     646
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str41, now str61 to accommodate using data's values)
(note: variable river was str5, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved
arkansas
(37 vars, 27 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       27   ->     459
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
(note: variable name was str57, now str61 to accommodate using data's values)
(note: variable river was str9, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50464.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(765 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(765 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(5616 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(1235 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(423 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(1960 missing values generated)

. gen log_large = ln(large)
(1285 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(1237 missing values generated)

. replace small_share=0 if total==0
(1237 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(1237 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(649 missing values generated)

. gen lag_deviation = L10.deviation
(649 missing values generated)

. 
end of do-file

. 
. areg small_share i.event_time , a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       6182
                                                  F(   8,    325) =       3.97
                                                  Prob > F        =     0.0002
                                                  R-squared       =     0.3125
                                                  Adj R-squared   =     0.2897
                                                  Root MSE        =     0.1806

                        (Std. Err. adjusted for 326 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0022196   .0062036     0.36   0.721    -.0099847    .0144239
         80  |  -.0016201   .0076666    -0.21   0.833    -.0167026    .0134624
         90  |  -.0013863   .0089626    -0.15   0.877    -.0190183    .0162458
        100  |   .0014993   .0104623     0.14   0.886     -.019083    .0220817
        110  |   .0316134   .0118518     2.67   0.008     .0082975    .0549293
        120  |   .0356157   .0127594     2.79   0.006     .0105144    .0607171
        130  |   .0432857   .0144811     2.99   0.003     .0147971    .0717743
        140  |   .0665941   .0171703     3.88   0.000     .0328152     .100373
             |
       _cons |   .2517381   .0112797    22.32   0.000     .2295477    .2739285
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (191 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,   325) =   16.37
            Prob > F =    0.0001

. predict small_share_hat, xb

. gen se = .
(6182 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(601 real changes made)
(586 real changes made)
(568 real changes made)
(534 real changes made)
(488 real changes made)
(462 real changes made)
(382 real changes made)
(716 real changes made)

. replace se = _se[_cons] if event_time==60
(1845 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =       5533
                                                  F(   3,    321) =      39.54
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1971
                                                  Adj R-squared   =     0.1699
                                                  Root MSE        =     0.1066

                        (Std. Err. adjusted for 322 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   -.038812   .0057781    -6.72   0.000    -.0501798   -.0274442
lag_deviat~n |  -.2392301   .0249063    -9.61   0.000    -.2882303   -.1902299
_IaftXlag_~1 |   .0999493   .0290682     3.44   0.001      .042761    .1571377
       _cons |   .0491712   .0056133     8.76   0.000     .0381276    .0602147
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (179 categories)

. tempvar hat

. 
. gen fitted=.
(6182 missing values generated)

. forval t=-4/4 {
  2.         di in ye "`t'0"
  3.         areg small L10.large L10.small if event_time==`t'*10+offset, a(riv
> er_year) cluster(river_segment)
  4.         predict `hat', xb
  5.         replace fitted=`hat' if event_time==`t'*10+offset
  6.         drop `hat'
  7. }
-40

Linear regression, absorbing indicators           Number of obs   =       1213
                                                  F(   2,    312) =     719.24
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9689
                                                  Adj R-squared   =     0.9642
                                                  Root MSE        =     0.6055

                        (Std. Err. adjusted for 313 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0367619   .0220688     1.67   0.097    -.0066607    .0801844
             |
       small |
        L10. |   1.050977   .0318816    32.97   0.000     .9882472    1.113707
             |
       _cons |   .1009402   .0577881     1.75   0.082    -.0127635    .2146439
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (158 categories)
(649 missing values generated)
(1213 real changes made)
-30

Linear regression, absorbing indicators           Number of obs   =        600
                                                  F(   2,    312) =    2006.28
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9761
                                                  Adj R-squared   =     0.9689
                                                  Root MSE        =     0.6131

                        (Std. Err. adjusted for 313 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |    .059333   .0231073     2.57   0.011     .0138672    .1047989
             |
       small |
        L10. |   .9914535   .0239318    41.43   0.000     .9443654    1.038542
             |
       _cons |   .1454881   .0589014     2.47   0.014     .0295938    .2613823
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (137 categories)
(649 missing values generated)
(600 real changes made)
-20

Linear regression, absorbing indicators           Number of obs   =        581
                                                  F(   2,    307) =     706.33
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9759
                                                  Adj R-squared   =     0.9688
                                                  Root MSE        =     0.6759

                        (Std. Err. adjusted for 308 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0398319   .0200837     1.98   0.048     .0003127    .0793511
             |
       small |
        L10. |   1.064306   .0312677    34.04   0.000      1.00278    1.125832
             |
       _cons |   .0322923   .0793262     0.41   0.684    -.1237996    .1883843
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (132 categories)
(649 missing values generated)
(581 real changes made)
-10

Linear regression, absorbing indicators           Number of obs   =        559
                                                  F(   2,    300) =     575.32
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9724
                                                  Adj R-squared   =     0.9643
                                                  Root MSE        =     0.7209

                        (Std. Err. adjusted for 301 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0421104    .023977     1.76   0.080     -.005074    .0892948
             |
       small |
        L10. |   1.049955   .0330717    31.75   0.000     .9848729    1.115037
             |
       _cons |   .0450846   .1016403     0.44   0.658    -.1549337     .245103
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (126 categories)
(649 missing values generated)
(559 real changes made)
00

Linear regression, absorbing indicators           Number of obs   =        533
                                                  F(   2,    289) =    1221.92
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9755
                                                  Adj R-squared   =     0.9683
                                                  Root MSE        =     0.7414

                        (Std. Err. adjusted for 290 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0217135   .0229971     0.94   0.346    -.0235497    .0669766
             |
       small |
        L10. |   1.092087   .0276884    39.44   0.000      1.03759    1.146583
             |
       _cons |   .0188626   .0747635     0.25   0.801    -.1282874    .1660125
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (120 categories)
(649 missing values generated)
(533 real changes made)
10

Linear regression, absorbing indicators           Number of obs   =        487
                                                  F(   2,    265) =     913.78
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9785
                                                  Adj R-squared   =     0.9722
                                                  Root MSE        =     0.7253

                        (Std. Err. adjusted for 266 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0037678    .017286     0.22   0.828    -.0302675    .0378031
             |
       small |
        L10. |   1.064569   .0283135    37.60   0.000     1.008821    1.120317
             |
       _cons |   .2485416   .0874362     2.84   0.005     .0763835    .4206996
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (109 categories)
(649 missing values generated)
(487 real changes made)
20

Linear regression, absorbing indicators           Number of obs   =        462
                                                  F(   2,    254) =     326.74
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9749
                                                  Adj R-squared   =     0.9678
                                                  Root MSE        =     0.9223

                        (Std. Err. adjusted for 255 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0135815    .030958     0.44   0.661    -.0473857    .0745486
             |
       small |
        L10. |   1.179543   .0463439    25.45   0.000     1.088276     1.27081
             |
       _cons |  -.2929313   .2236559    -1.31   0.191    -.7333875    .1475249
-------------+----------------------------------------------------------------
  river_year |   absorbed                                     (101 categories)
(649 missing values generated)
(462 real changes made)
30

Linear regression, absorbing indicators           Number of obs   =        382
                                                  F(   2,    214) =     840.46
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9884
                                                  Adj R-squared   =     0.9848
                                                  Root MSE        =     0.5324

                        (Std. Err. adjusted for 215 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0043874   .0123581     0.36   0.723    -.0199718    .0287466
             |
       small |
        L10. |   1.066148    .026005    41.00   0.000     1.014889    1.117407
             |
       _cons |    .031681   .1125051     0.28   0.779    -.1900791    .2534411
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (89 categories)
(649 missing values generated)
(382 real changes made)
40

Linear regression, absorbing indicators           Number of obs   =        716
                                                  F(   2,    171) =     392.21
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9809
                                                  Adj R-squared   =     0.9782
                                                  Root MSE        =     0.6773

                        (Std. Err. adjusted for 172 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
       small |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       large |
        L10. |   .0021247   .0121603     0.17   0.862     -.021879    .0261284
             |
       small |
        L10. |   1.083456   .0386908    28.00   0.000     1.007083    1.159829
             |
       _cons |  -.1010831   .1667301    -0.61   0.545    -.4301973    .2280312
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (89 categories)
(649 missing values generated)
(716 real changes made)

. BRK
unrecognized command:  BRK
r(199);

end of do-file
r(199);
