-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/red.log
  log type:  text
 opened on:   2 Jul 2014, 16:35:03

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54567.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54567.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
red
(37 vars, 126 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      126   ->    2142
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54567.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(1768 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(1768 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(219 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(656 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(3 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(0 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(1125 missing values generated)

. gen log_large = ln(large)
(975 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(958 missing values generated)

. replace small_share=0 if total==0
(958 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(958 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(107 missing values generated)

. gen lag_deviation = L10.deviation
(107 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =       1267
                                                  F(   7,     68) =      14.33
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1846
                                                  Adj R-squared   =     0.1728
                                                  Root MSE        =     0.1573

                         (Std. Err. adjusted for 69 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |  -.0377966   .0214964    -1.76   0.083    -.0806921    .0050988
 treatment80 |  -.0632296   .0273238    -2.31   0.024    -.1177534   -.0087058
 treatment90 |  -.1127014   .0351159    -3.21   0.002     -.182774   -.0426288
treatment100 |   .0124335   .1142189     0.11   0.914    -.2154868    .2403538
treatment110 |   .3386796   .3151459     1.07   0.286    -.2901844    .9675435
treatment120 |  -.1727563   .0261962    -6.59   0.000    -.2250301   -.1204826
treatment130 |  -.2213582   .0280497    -7.89   0.000    -.2773305   -.1653858
       _cons |   .0555467   .0096712     5.74   0.000      .036248    .0748454
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*treatment130 = 0

       F(  1,    68) =    0.09
            Prob > F =    0.7594

. predict small_share_hat, xb

. gen se = .
(1267 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(3 real changes made)
(3 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)

. replace se = _se[_cons] if event_time==70
(6 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)
note: _IaftXlag_d_1 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =       1160
                                                  F(   2,     68) =      41.05
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1311
                                                  Adj R-squared   =     0.1220
                                                  Root MSE        =     0.1287

                         (Std. Err. adjusted for 69 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.1633297   .2635843    -0.62   0.538     -.689304    .3626446
lag_deviat~n |  -.2909365    .032158    -9.05   0.000    -.3551068   -.2267663
_IaftXlag_~1 |          0  (omitted)
       _cons |   .1139318   .0133157     8.56   0.000     .0873609    .1405028
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(19 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(1248 missing values generated)

. gen lower = small_share_hat - 1.96*se
(1248 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/red.gph saved)

. 
. capture log close
