-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/red.log
  log type:  text
 opened on:   2 Jul 2014, 12:08:53

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50442.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50442.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
red
(37 vars, 32 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       32   ->     544
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50442.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(170 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(170 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(340 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(44 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(5 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(95 missing values generated)

. gen log_large = ln(large)
(67 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(64 missing values generated)

. replace small_share=0 if total==0
(64 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(64 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1810 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(22 missing values generated)

. gen lag_deviation = L10.deviation
(22 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       204
Group variable: river_bridge                    Number of groups   =        22

R-sq:  within  = 0.4614                         Obs per group: min =         5
       between = 0.4383                                        avg =       9.3
       overall = 0.3580                                        max =        13

                                                F(22,160)          =      6.23
corr(u_i, Xb)  = 0.1570                         Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.3303896   .3061208    -1.08   0.282     -.934948    .2741688
         80  |  -.7901521   .4068353    -1.94   0.054    -1.593612    .0133075
         90  |  -1.249577   .5129323    -2.44   0.016    -2.262568   -.2365867
        100  |  -1.721745   .6271156    -2.75   0.007    -2.960237   -.4832539
        110  |  -2.137409   .7462366    -2.86   0.005    -3.611153   -.6636649
        120  |  -2.554681    .862419    -2.96   0.004    -4.257873   -.8514881
        130  |  -3.025219   .9921605    -3.05   0.003    -4.984638     -1.0658
        140  |   -3.68012   1.181115    -3.12   0.002    -6.012705   -1.347535
             |
        year |
       1820  |   2.80e-14    1.08898     0.00   1.000    -2.150628    2.150628
       1830  |   .2298682   .9629186     0.24   0.812    -1.671801    2.131538
       1840  |   .5252316   .9487756     0.55   0.581    -1.348507     2.39897
       1850  |  -.1172099   .9425291    -0.12   0.901    -1.978612    1.744192
       1860  |   1.059329   .9784416     1.08   0.281    -.8729972    2.991655
       1870  |   1.105327   1.025378     1.08   0.283    -.9196948    3.130348
       1880  |   1.752129   1.055215     1.66   0.099    -.3318174    3.836074
       1890  |   2.318081   1.134738     2.04   0.043     .0770859    4.559076
       1900  |   3.006034   1.252036     2.40   0.018     .5333867    5.478681
       1910  |   3.765441   1.333554     2.82   0.005     1.131804    6.399078
       1920  |   4.399838   1.419805     3.10   0.002     1.595863    7.203813
       1930  |   4.805464   1.522702     3.16   0.002     1.798277    7.812651
       1940  |   5.276231    1.63629     3.22   0.002      2.04472    8.507741
       1950  |   5.700342   1.738952     3.28   0.001     2.266083    9.134602
             |
       _cons |  -.1089654   .9968876    -0.11   0.913     -2.07772     1.85979
-------------+----------------------------------------------------------------
     sigma_u |  2.0274023
     sigma_e |  .77002496
         rho |  .87393136   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(21, 160) =    56.47             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       204
Group variable: river_bridge                    Number of groups   =        22

R-sq:  within  = 0.3915                         Obs per group: min =         5
       between = 0.4232                                        avg =       9.3
       overall = 0.2296                                        max =        13

                                                F(22,160)          =      4.68
corr(u_i, Xb)  = 0.1415                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .2754886   .4636711     0.59   0.553    -.6402161    1.191193
         80  |   .2445321     .61622     0.40   0.692    -.9724416    1.461506
         90  |   .3407362   .7769216     0.44   0.662    -1.193608     1.87508
        100  |   .2564809   .9498713     0.27   0.787    -1.619421    2.132383
        110  |   .2729027     1.1303     0.24   0.810    -1.959329    2.505134
        120  |    .179277   1.306278     0.14   0.891    -2.400493    2.759047
        130  |  -.1741369   1.502793    -0.12   0.908    -3.142005    2.793731
        140  |   .0406108   1.788995     0.02   0.982    -3.492479      3.5737
             |
        year |
       1820  |  -3.96e-14   1.649442    -0.00   1.000    -3.257485    3.257485
       1830  |  -.1129855   1.458501    -0.08   0.938    -2.993381     2.76741
       1840  |   -.302299   1.437079    -0.21   0.834    -3.140389    2.535791
       1850  |  -1.233499   1.427618    -0.86   0.389    -4.052904    1.585905
       1860  |  -.5244525   1.482013    -0.35   0.724    -3.451283    2.402378
       1870  |  -.5923385   1.553107    -0.38   0.703    -3.659572    2.474895
       1880  |   -.629553   1.598299    -0.39   0.694    -3.786037    2.526931
       1890  |   -.341643    1.71875    -0.20   0.843    -3.736005    3.052719
       1900  |   .0957896   1.896417     0.05   0.960    -3.649448    3.841027
       1910  |   .3963399    2.01989     0.20   0.845    -3.592743    4.385423
       1920  |   .6059338   2.150532     0.28   0.778    -3.641155    4.853022
       1930  |   1.121594   2.306387     0.49   0.627    -3.433293    5.676481
       1940  |   1.340712   2.478434     0.54   0.589     -3.55395    6.235375
       1950  |   1.721665   2.633934     0.65   0.514    -3.480094    6.923425
             |
       _cons |   1.195788   1.509953     0.79   0.430     -1.78622    4.177796
-------------+----------------------------------------------------------------
     sigma_u |  2.0700313
     sigma_e |  1.1663314
         rho |  .75903587   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(21, 160) =    17.65             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       204
Group variable: river_bridge                    Number of groups   =        22

R-sq:  within  = 0.4321                         Obs per group: min =         5
       between = 0.1257                                        avg =       9.3
       overall = 0.2644                                        max =        13

                                                F(15,167)          =      8.47
corr(u_i, Xb)  = 0.0387                         Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .0578976   .0423734     1.37   0.174    -.0257589    .1415541
             |
        year |
       1820  |  -1.12e-14   .2104476    -0.00   1.000    -.4154805    .4154805
       1830  |  -.1258415   .1848559    -0.68   0.497     -.490797    .2391141
       1840  |  -.1451147   .1757647    -0.83   0.410    -.4921219    .2018925
       1850  |  -.2073562    .168366    -1.23   0.220    -.5397563    .1250439
       1860  |  -.1753744   .1630683    -1.08   0.284    -.4973154    .1465666
       1870  |  -.1206486    .161227    -0.75   0.455    -.4389543    .1976572
       1880  |  -.0946426    .161573    -0.59   0.559    -.4136314    .2243463
       1890  |   .0500094   .1615178     0.31   0.757    -.2688704    .3688892
       1900  |   .1492678   .1618959     0.92   0.358    -.1703587    .4688942
       1910  |   .1107182   .1626972     0.68   0.497    -.2104902    .4319266
       1920  |   .1087063   .1631101     0.67   0.506    -.2133172    .4307299
       1930  |   .1028905   .1654955     0.62   0.535    -.2238425    .4296234
       1940  |   .1118827   .1707366     0.66   0.513    -.2251976    .4489631
       1950  |   .1162395   .1707366     0.68   0.497    -.2208408    .4533198
             |
       _cons |   .1868377   .1573751     1.19   0.237    -.1238633    .4975387
-------------+----------------------------------------------------------------
     sigma_u |  .17389252
     sigma_e |   .1488089
         rho |  .57726329   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(21, 167) =    11.65             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        204
                                                  F(   8,     12) =       1.68
                                                  Prob > F        =     0.2027
                                                  R-squared       =     0.2868
                                                  Adj R-squared   =     0.2001
                                                  Root MSE        =     0.2227

                         (Std. Err. adjusted for 13 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   -.027664    .042773    -0.65   0.530    -.1208584    .0655304
         80  |  -.0159471   .0730425    -0.22   0.831    -.1750931    .1431988
         90  |   -.080771   .0526098    -1.54   0.151    -.1953979     .033856
        100  |  -.0688932   .0727922    -0.95   0.363    -.2274938    .0897074
        110  |  -.0085942   .1165483    -0.07   0.942    -.2625311    .2453427
        120  |  -.0585978   .1193917    -0.49   0.632      -.31873    .2015343
        130  |  -.0935698   .1580604    -0.59   0.565    -.4379538    .2508142
        140  |  -.0324159   .1963328    -0.17   0.872    -.4601883    .3953565
             |
       _cons |   .2769352   .0744135     3.72   0.003      .114802    .4390684
-------------+----------------------------------------------------------------
        year |   absorbed                                      (15 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    12) =    0.02
            Prob > F =    0.8829

. predict small_share_hat, xb

. gen se = .
(204 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(22 real changes made)
(22 real changes made)
(21 real changes made)
(19 real changes made)
(17 real changes made)
(17 real changes made)
(10 real changes made)
(10 real changes made)

. replace se = _se[_cons] if event_time==60
(66 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        182
                                                  F(   3,     12) =       1.81
                                                  Prob > F        =     0.1995
                                                  R-squared       =     0.2369
                                                  Adj R-squared   =     0.1629
                                                  Root MSE        =     0.1509

                         (Std. Err. adjusted for 13 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0500529   .0413318    -1.21   0.249    -.1401072    .0400014
lag_deviat~n |  -.3353121   .1505384    -2.23   0.046    -.6633071    -.007317
_IaftXlag_~1 |   .1557124   .2223841     0.70   0.497     -.328821    .6402458
       _cons |   .0695317   .0385564     1.80   0.096    -.0144756    .1535389
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (14 categories)

. 
. replace event_time = event_time - offset
(204 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/red.gph saved)

. 
. capture log close
