-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/snake.log
  log type:  text
 opened on:   2 Jul 2014, 12:09:02

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50450.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50450.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
snake
(37 vars, 38 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       38   ->     646
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50450.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(153 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(153 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(342 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(58 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(20 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(219 missing values generated)

. gen log_large = ln(large)
(165 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(159 missing values generated)

. replace small_share=0 if total==0
(159 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(159 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1810 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(29 missing values generated)

. gen lag_deviation = L10.deviation
(29 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       304
Group variable: river_bridge                    Number of groups   =        29

R-sq:  within  = 0.5770                         Obs per group: min =         4
       between = 0.2027                                        avg =      10.5
       overall = 0.3525                                        max =        13

                                                F(22,253)          =     15.69
corr(u_i, Xb)  = 0.0179                         Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.1436827   .2143574    -0.67   0.503    -.5658348    .2784694
         80  |  -.1704722   .2768457    -0.62   0.539    -.7156879    .3747435
         90  |  -.3459496   .3458706    -1.00   0.318    -1.027102    .3352028
        100  |  -.1520051   .4259157    -0.36   0.721    -.9907971    .6867868
        110  |  -.0022007   .5070166    -0.00   0.997    -1.000712    .9963102
        120  |   .1300152   .5799855     0.22   0.823      -1.0122     1.27223
        130  |   .2829355   .6536827     0.43   0.666    -1.004417    1.570288
        140  |   .5925457     .78618     0.75   0.452    -.9557452    2.140837
             |
        year |
       1820  |  -.6527848   .8185578    -0.80   0.426     -2.26484    .9592704
       1830  |  -.6218792   .7282394    -0.85   0.394    -2.056063    .8123044
       1840  |  -.6073978   .7288643    -0.83   0.405    -2.042812    .8280166
       1850  |  -.4283526   .7357792    -0.58   0.561    -1.877385     1.02068
       1860  |  -.2047107   .7692416    -0.27   0.790    -1.719643    1.310222
       1870  |  -.0271469   .7899462    -0.03   0.973    -1.582855    1.528561
       1880  |   .1668775   .8250354     0.20   0.840    -1.457935     1.79169
       1890  |   .2871692   .8864154     0.32   0.746    -1.458524    2.032862
       1900  |   .5414869   .9369597     0.58   0.564    -1.303747    2.386721
       1910  |   .9492489   .9887306     0.96   0.338    -.9979421     2.89644
       1920  |   1.148184   1.048826     1.09   0.275     -.917358    3.213725
       1930  |   1.073028   1.115011     0.96   0.337    -1.122858    3.268915
       1940  |   1.027595   1.166476     0.88   0.379    -1.269646    3.324836
       1950  |    .921412   1.223813     0.75   0.452    -1.488747    3.331571
             |
       _cons |    .363115   .7421615     0.49   0.625    -1.098487    1.824716
-------------+----------------------------------------------------------------
     sigma_u |  .90845965
     sigma_e |  .65895039
         rho |  .65525161   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(28, 253) =    14.90             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       304
Group variable: river_bridge                    Number of groups   =        29

R-sq:  within  = 0.5538                         Obs per group: min =         4
       between = 0.0120                                        avg =      10.5
       overall = 0.3576                                        max =        13

                                                F(22,253)          =     14.27
corr(u_i, Xb)  = -0.0230                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.2156868   .2049951    -1.05   0.294    -.6194011    .1880275
         80  |  -.3062515   .2647542    -1.16   0.248    -.8276545    .2151514
         90  |  -.3957483   .3307644    -1.20   0.233    -1.047151    .2556542
        100  |  -.2576111   .4073135    -0.63   0.528    -1.059768    .5445459
        110  |  -.0404033   .4848723    -0.08   0.934    -.9953034    .9144967
        120  |   .0933963   .5546542     0.17   0.866    -.9989312    1.185724
        130  |   .3615121   .6251325     0.58   0.564    -.8696144    1.592639
        140  |   .9103398   .7518429     1.21   0.227    -.5703282    2.391008
             |
        year |
       1820  |   .6758836   .7828066     0.86   0.389    -.8657638    2.217531
       1830  |   .4098722   .6964329     0.59   0.557    -.9616722    1.781417
       1840  |   .5067773   .6970306     0.73   0.468    -.8659441    1.879499
       1850  |    .725589   .7036435     1.03   0.303    -.6601558    2.111334
       1860  |   .8772269   .7356443     1.19   0.234    -.5715399    2.325994
       1870  |    .941965   .7554447     1.25   0.214    -.5457962    2.429726
       1880  |   1.089077   .7890013     1.38   0.169    -.4647698    2.642924
       1890  |   1.346259   .8477005     1.59   0.114    -.3231895    3.015707
       1900  |   1.803475   .8960372     2.01   0.045     .0388325    3.568117
       1910  |   2.005778    .945547     2.12   0.035     .1436325    3.867924
       1920  |   1.915466   1.003018     1.91   0.057    -.0598614    3.890794
       1930  |   1.732404   1.066312     1.62   0.105     -.367575    3.832383
       1940  |   1.572974    1.11553     1.41   0.160    -.6239333    3.769881
       1950  |   1.443206   1.170362     1.23   0.219    -.8616873    3.748099
             |
       _cons |   -.812329    .709747    -1.14   0.253    -2.210094    .5854359
-------------+----------------------------------------------------------------
     sigma_u |  .61431311
     sigma_e |  .63017018
         rho |  .48726018   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(28, 253) =     8.59             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       304
Group variable: river_bridge                    Number of groups   =        29

R-sq:  within  = 0.4486                         Obs per group: min =         4
       between = 0.0584                                        avg =      10.5
       overall = 0.2662                                        max =        13

                                                F(15,260)          =     14.10
corr(u_i, Xb)  = -0.0543                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .1296637    .038467     3.37   0.001     .0539171    .2054102
             |
        year |
       1820  |     .17896   .2022897     0.88   0.377    -.2193748    .5772947
       1830  |   .1560145   .1777972     0.88   0.381    -.1940913    .5061203
       1840  |   .1548055   .1764877     0.88   0.381    -.1927217    .5023327
       1850  |    .206664   .1747426     1.18   0.238    -.1374269     .550755
       1860  |   .2483037   .1737355     1.43   0.154     -.093804    .5904115
       1870  |   .2490464   .1738165     1.43   0.153     -.093221    .5913137
       1880  |   .2698797   .1738165     1.55   0.122    -.0723877    .6121471
       1890  |   .3264317   .1743061     1.87   0.062    -.0167996    .6696631
       1900  |   .4068403   .1757101     2.32   0.021     .0608442    .7528364
       1910  |   .4763982   .1765608     2.70   0.007     .1287271    .8240693
       1920  |    .421995   .1778031     2.37   0.018     .0718776    .7721124
       1930  |   .3970153   .1798895     2.21   0.028     .0427894    .7512411
       1940  |    .382623   .1809639     2.11   0.035     .0262816    .7389643
       1950  |   .3725627   .1820318     2.05   0.042     .0141184     .731007
             |
       _cons |  -.2428559   .1705947    -1.42   0.156    -.5787791    .0930672
-------------+----------------------------------------------------------------
     sigma_u |  .16217299
     sigma_e |  .16297831
         rho |  .49752328   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(28, 260) =     8.83             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        304
                                                  F(   8,     19) =       1.99
                                                  Prob > F        =     0.1040
                                                  R-squared       =     0.3725
                                                  Adj R-squared   =     0.3233
                                                  Root MSE        =     0.2056

                         (Std. Err. adjusted for 20 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.0224266   .0203219    -1.10   0.284    -.0649608    .0201076
         80  |  -.0535445   .0323557    -1.65   0.114    -.1212658    .0141767
         90  |  -.0508457   .0514469    -0.99   0.335    -.1585253    .0568339
        100  |  -.0007239    .087837    -0.01   0.994    -.1845689     .183121
        110  |   .0962446   .0985463     0.98   0.341    -.1100152    .3025044
        120  |   .1789351   .1277826     1.40   0.178     -.088517    .4463871
        130  |    .223345   .1294857     1.72   0.101    -.0476716    .4943616
        140  |   .3819848   .1490113     2.56   0.019     .0701005     .693869
             |
       _cons |   .0708326    .059568     1.19   0.249    -.0538447    .1955098
-------------+----------------------------------------------------------------
        year |   absorbed                                      (15 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    19) =    5.45
            Prob > F =    0.0307

. predict small_share_hat, xb

. gen se = .
(304 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(29 real changes made)
(28 real changes made)
(27 real changes made)
(26 real changes made)
(24 real changes made)
(24 real changes made)
(23 real changes made)
(36 real changes made)

. replace se = _se[_cons] if event_time==60
(87 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        275
                                                  F(   3,     19) =       3.57
                                                  Prob > F        =     0.0334
                                                  R-squared       =     0.2001
                                                  Adj R-squared   =     0.1505
                                                  Root MSE        =     0.1392

                         (Std. Err. adjusted for 20 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.1595965   .0768356    -2.08   0.052    -.3204152    .0012223
lag_deviat~n |  -.3475077    .202829    -1.71   0.103    -.7720336    .0770182
_IaftXlag_~1 |   .1775962   .2070524     0.86   0.402    -.2557694    .6109619
       _cons |   .1568522   .0848865     1.85   0.080    -.0208173    .3345217
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (14 categories)

. 
. replace event_time = event_time - offset
(304 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/snake.gph saved)

. 
. capture log close
