-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox/projects/borders/bridges/research_designs/con
> vergence/results/snake.log
  log type:  text
 opened on:  14 May 2014, 20:54:08

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26662.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26662.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
snake
(37 vars, 38 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       38   ->     646
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26662.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(153 missing values generated)

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(153 missing values generated)

. keep if abs(event_time-offset)<=`sample_window'
(342 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(58 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(20 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small_share = cond(left_before<right_before,left,right)/total
(162 missing values generated)

. replace small_share=0 if total==0
(162 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(162 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1810 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(29 missing values generated)

. gen lag_deviation = L10.deviation
(29 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       304
Group variable: river_bridge                    Number of groups   =        29

R-sq:  within  = 0.5714                         Obs per group: min =         4
       between = 0.2046                                        avg =      10.5
       overall = 0.3459                                        max =        13

                                                F(22,253)          =     15.33
corr(u_i, Xb)  = 0.0167                         Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.1782954   .2137319    -0.83   0.405    -.5992158    .2426249
         80  |  -.2068972   .2760379    -0.75   0.454    -.7505221    .3367276
         90  |  -.3738216   .3448614    -1.08   0.279    -1.052986    .3053433
        100  |  -.1817684    .424673    -0.43   0.669    -1.018113    .6545761
        110  |  -.0323255   .5055372    -0.06   0.949    -1.027923    .9632719
        120  |    .099284   .5782932     0.17   0.864    -1.039598    1.238166
        130  |   .2503829   .6517753     0.38   0.701    -1.033214    1.533979
        140  |   .5617796    .783886     0.72   0.474    -.9819936    2.105553
             |
        year |
       1820  |  -.6517058   .8161694    -0.80   0.425    -2.259057    .9556458
       1830  |  -.6182777   .7261145    -0.85   0.395    -2.048277    .8117211
       1840  |  -.6000416   .7267376    -0.83   0.410    -2.031268    .8311844
       1850  |  -.3725311   .7336323    -0.51   0.612    -1.817335    1.072273
       1860  |  -.1531504   .7669971    -0.20   0.842    -1.663663    1.357362
       1870  |   .0256907   .7876413     0.03   0.974    -1.525478    1.576859
       1880  |   .1830097   .8226281     0.22   0.824    -1.437062    1.803081
       1890  |   .3122161    .883829     0.35   0.724    -1.428383    2.052815
       1900  |   .5664639   .9342258     0.61   0.545    -1.273386    2.406314
       1910  |   .9722209   .9858456     0.99   0.325    -.9692885     2.91373
       1920  |   1.174047   1.045766     1.12   0.263    -.8854682    3.233561
       1930  |   1.100161   1.111758     0.99   0.323    -1.089318     3.28964
       1940  |    1.05565   1.163073     0.91   0.365    -1.234888    3.346188
       1950  |   .9506231   1.220242     0.78   0.437    -1.452503     3.35375
             |
       _cons |   .3300135    .739996     0.45   0.656    -1.127323     1.78735
-------------+----------------------------------------------------------------
     sigma_u |  .91053487
     sigma_e |  .65702769
         rho |  .65759884   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(28, 253) =    15.01             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       304
Group variable: river_bridge                    Number of groups   =        29

R-sq:  within  = 0.5289                         Obs per group: min =         4
       between = 0.0055                                        avg =      10.5
       overall = 0.3343                                        max =        13

                                                F(22,253)          =     12.91
corr(u_i, Xb)  = -0.0161                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.1867785   .1977892    -0.94   0.346    -.5763015    .2027445
         80  |  -.2587803   .2554476    -1.01   0.312     -.761855    .2442944
         90  |  -.3284231   .3191375    -1.03   0.304    -.9569276    .3000814
        100  |  -.1797674   .3929957    -0.46   0.648    -.9537271    .5941923
        110  |    .051112   .4678281     0.11   0.913    -.8702215    .9724456
        120  |   .1333503   .5351571     0.25   0.803      -.92058    1.187281
        130  |   .3399381    .603158     0.56   0.574    -.8479121    1.527788
        140  |   .8208217   .7254143     1.13   0.259    -.6077982    2.249442
             |
        year |
       1820  |    .508411   .7552895     0.67   0.501    -.9790447    1.995867
       1830  |   .1450856    .671952     0.22   0.829    -1.178247    1.468418
       1840  |   .2244199   .6725287     0.33   0.739    -1.100048    1.548888
       1850  |   .4207802   .6789091     0.62   0.536    -.9162531    1.757813
       1860  |   .5513167   .7097851     0.78   0.438    -.8465233    1.949157
       1870  |   .6064254   .7288894     0.83   0.406    -.8290383    2.041889
       1880  |   .7391696   .7612665     0.97   0.332     -.760057    2.238396
       1890  |    .981584   .8179023     1.20   0.231    -.6291803    2.592348
       1900  |   1.391937   .8645399     1.61   0.109    -.3106745    3.094549
       1910  |   1.568936   .9123093     1.72   0.087    -.2277517    3.365624
       1920  |   1.494143   .9677597     1.54   0.124    -.4117481    3.400034
       1930  |   1.334675   1.028829     1.30   0.196    -.6914862    3.360836
       1940  |   1.218686   1.076317     1.13   0.259    -.9009959    3.338368
       1950  |   1.112057   1.129222     0.98   0.326    -1.111815    3.335929
             |
       _cons |  -.4977233   .6847981    -0.73   0.468    -1.846354    .8509076
-------------+----------------------------------------------------------------
     sigma_u |  .59902737
     sigma_e |  .60801856
         rho |  .49255149   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(28, 253) =     9.25             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       304
Group variable: river_bridge                    Number of groups   =        29

R-sq:  within  = 0.4440                         Obs per group: min =         4
       between = 0.0655                                        avg =      10.5
       overall = 0.2629                                        max =        13

                                                F(15,260)          =     13.84
corr(u_i, Xb)  = -0.0488                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |    .132399   .0377012     3.51   0.001     .0581604    .2066376
             |
        year |
       1820  |   .1721928   .1982626     0.87   0.386     -.218212    .5625976
       1830  |   .1501418   .1742576     0.86   0.390    -.1929941    .4932778
       1840  |   .1471469   .1729742     0.85   0.396    -.1934618    .4877556
       1850  |   .1961801   .1712639     1.15   0.253    -.1410608    .5334209
       1860  |   .2356342   .1702768     1.38   0.168     -.099663    .5709313
       1870  |   .2360171   .1703562     1.39   0.167    -.0994365    .5714707
       1880  |   .2568504   .1703562     1.51   0.133    -.0786031     .592304
       1890  |   .3125091    .170836     1.83   0.069    -.0238893    .6489075
       1900  |    .392007   .1722121     2.28   0.024     .0528989     .731115
       1910  |   .4532223   .1730458     2.62   0.009     .1124726     .793972
       1920  |   .3984255   .1742634     2.29   0.023     .0552782    .7415728
       1930  |   .3728799   .1763083     2.11   0.035     .0257059    .7200539
       1940  |   .3594113   .1773613     2.03   0.044     .0101639    .7086587
       1950  |   .3488913    .178408     1.96   0.052    -.0024172    .7001998
             |
       _cons |  -.2296373   .1671985    -1.37   0.171     -.558873    .0995983
-------------+----------------------------------------------------------------
     sigma_u |  .16064311
     sigma_e |  .15973377
         rho |  .50283832   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(28, 260) =     9.05             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        304
                                                  F(   8,     19) =       1.85
                                                  Prob > F        =     0.1302
                                                  R-squared       =     0.3581
                                                  Adj R-squared   =     0.3078
                                                  Root MSE        =     0.2040

                         (Std. Err. adjusted for 20 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |  -.0231334   .0205462    -1.13   0.274    -.0661371    .0198704
         80  |  -.0545415   .0326754    -1.67   0.111    -.1229319    .0138488
         90  |  -.0506699   .0514537    -0.98   0.337    -.1583637    .0570239
        100  |  -.0001349   .0875058    -0.00   0.999    -.1832866    .1830168
        110  |   .0959798   .0987016     0.97   0.343     -.110605    .3025645
        120  |    .170749   .1276163     1.34   0.197    -.0963549    .4378529
        130  |   .2126856    .129439     1.64   0.117    -.0582333    .4836046
        140  |   .3582768   .1475036     2.43   0.025     .0495484    .6670053
             |
       _cons |   .0719723   .0597062     1.21   0.243    -.0529942    .1969389
-------------+----------------------------------------------------------------
        year |   absorbed                                      (15 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    19) =    5.03
            Prob > F =    0.0370

. predict small_share_hat, xb

. gen se = .
(304 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(29 real changes made)
(28 real changes made)
(27 real changes made)
(26 real changes made)
(24 real changes made)
(24 real changes made)
(23 real changes made)
(36 real changes made)

. replace se = _se[_cons] if event_time==60
(87 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        275
                                                  F(   3,     19) =       3.50
                                                  Prob > F        =     0.0357
                                                  R-squared       =     0.1997
                                                  Adj R-squared   =     0.1500
                                                  Root MSE        =     0.1374

                         (Std. Err. adjusted for 20 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   -.156134   .0768892    -2.03   0.057    -.3170649     .004797
lag_deviat~n |  -.3492737     .20318    -1.72   0.102    -.7745344    .0759869
_IaftXlag_~1 |   .1784618   .2076182     0.86   0.401    -.2560882    .6130118
       _cons |   .1572182   .0850814     1.85   0.080    -.0208592    .3352955
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (14 categories)

. 
. replace event_time = event_time - offset
(304 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/snake.gph saved)

. 
. capture log close
