-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/tennessee.log
  log type:  text
 opened on:   2 Jul 2014, 12:09:08

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50458.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50458.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
tennessee
(37 vars, 27 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       27   ->     459
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St50458.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset

. keep if abs(event_time-offset)<=`sample_window'
(191 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(52 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(18 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(82 missing values generated)

. gen log_large = ln(large)
(29 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(29 missing values generated)

. replace small_share=0 if total==0
(29 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(29 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(27 missing values generated)

. gen lag_deviation = L10.deviation
(27 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       268
Group variable: river_bridge                    Number of groups   =        27

R-sq:  within  = 0.8223                         Obs per group: min =         4
       between = 0.0935                                        avg =       9.9
       overall = 0.5138                                        max =        13

                                                F(24,217)          =     41.84
corr(u_i, Xb)  = -0.0876                        Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0220352    .275637     0.08   0.936    -.5212333    .5653036
         80  |  -.1389767   .3555113    -0.39   0.696    -.8396739    .5617204
         90  |   .0257108   .4451285     0.06   0.954    -.8516179    .9030395
        100  |   .1739697   .5464183     0.32   0.751    -.9029968    1.250936
        110  |   .6975773   .6471191     1.08   0.282    -.5778663    1.973021
        120  |   .9536752   .7439146     1.28   0.201     -.512548    2.419898
        130  |   1.631853   .8401096     1.94   0.053    -.0239664    3.287672
        140  |   1.650946   1.021965     1.62   0.108    -.3633024    3.665195
             |
        year |
       1800  |   .1689347   .4711912     0.36   0.720    -.7597626    1.097632
       1810  |   .1919364   .4734338     0.41   0.686    -.7411809    1.125054
       1820  |   .8468247   .5183367     1.63   0.104    -.1747943    1.868444
       1830  |   1.171119   .5786426     2.02   0.044     .0306396    2.311598
       1840  |   2.075526    .629805     3.30   0.001     .8342081    3.316844
       1850  |   1.961831   .7079838     2.77   0.006     .5664255    3.357236
       1860  |   2.111082   .8011017     2.64   0.009     .5321459    3.690019
       1870  |   2.477492   .8846361     2.80   0.006     .7339128    4.221071
       1880  |   3.159255     .92875     3.40   0.001     1.328729     4.98978
       1890  |   3.513717   1.016682     3.46   0.001     1.509881    5.517554
       1900  |   4.246794   1.135581     3.74   0.000     2.008614    6.484974
       1910  |   4.553324    1.20567     3.78   0.000     2.177001    6.929647
       1920  |   4.533237   1.316375     3.44   0.001     1.938719    7.127755
       1930  |   4.562356   1.423343     3.21   0.002      1.75701    7.367703
       1940  |   4.359086   1.512751     2.88   0.004     1.377519    7.340654
       1950  |   4.035297   1.619927     2.49   0.013     .8424912    7.228102
             |
       _cons |    -.67416   .6554499    -1.03   0.305    -1.966023    .6177032
-------------+----------------------------------------------------------------
     sigma_u |  1.5587444
     sigma_e |  .78981012
         rho |  .79570878   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(26, 217) =    28.75             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       268
Group variable: river_bridge                    Number of groups   =        27

R-sq:  within  = 0.5130                         Obs per group: min =         4
       between = 0.0419                                        avg =       9.9
       overall = 0.2417                                        max =        13

                                                F(24,217)          =      9.52
corr(u_i, Xb)  = 0.0253                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .1607028   .7674258     0.21   0.834     -1.35186    1.673265
         80  |   .3510373   .9898109     0.35   0.723    -1.599837    2.301911
         90  |    .408155   1.239322     0.33   0.742    -2.034495    2.850805
        100  |   .9820856   1.521332     0.65   0.519    -2.016394    3.980565
        110  |   1.609621   1.801703     0.89   0.373    -1.941457    5.160698
        120  |   2.104657     2.0712     1.02   0.311    -1.977587    6.186901
        130  |   3.054876   2.339025     1.31   0.193     -1.55524    7.664992
        140  |   2.884631   2.845345     1.01   0.312     -2.72342    8.492682
             |
        year |
       1800  |   .0084312   1.311886     0.01   0.995    -2.577238    2.594101
       1810  |  -.0187594    1.31813    -0.01   0.989    -2.616735    2.579216
       1820  |  -1.171105   1.443148    -0.81   0.418    -4.015486    1.673277
       1830  |  -1.680321   1.611051    -1.04   0.298    -4.855632     1.49499
       1840  |  -1.039951   1.753497    -0.59   0.554    -4.496017    2.416114
       1850  |  -1.699934   1.971162    -0.86   0.389    -5.585007    2.185139
       1860  |  -1.375602   2.230419    -0.62   0.538    -5.771661    3.020457
       1870  |  -.0937796   2.462995    -0.04   0.970    -4.948235    4.760676
       1880  |  -.0399811   2.585817    -0.02   0.988    -5.136512     5.05655
       1890  |   1.333483   2.830637     0.47   0.638    -4.245578    6.912545
       1900  |   2.139538   3.161673     0.68   0.499    -4.091981    8.371056
       1910  |   2.355734   3.356815     0.70   0.484    -4.260401    8.971869
       1920  |   2.885409   3.665039     0.79   0.432    -4.338222    10.10904
       1930  |     2.7097   3.962858     0.68   0.495    -5.100919    10.52032
       1940  |   2.363063   4.211788     0.56   0.575    -5.938186    10.66431
       1950  |   1.551734   4.510185     0.34   0.731    -7.337643    10.44111
             |
       _cons |   1.355968   1.824897     0.74   0.458    -2.240824    4.952761
-------------+----------------------------------------------------------------
     sigma_u |  3.1544133
     sigma_e |  2.1989815
         rho |  .67296288   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(26, 217) =    22.12             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       268
Group variable: river_bridge                    Number of groups   =        27

R-sq:  within  = 0.4893                         Obs per group: min =         4
       between = 0.0747                                        avg =       9.9
       overall = 0.2247                                        max =        13

                                                F(17,224)          =     12.63
corr(u_i, Xb)  = -0.0701                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .0292204   .0275646     1.06   0.290    -.0250987    .0835396
             |
        year |
       1800  |  -.0035564   .0597152    -0.06   0.953    -.1212319     .114119
       1810  |  -.0035564   .0597152    -0.06   0.953    -.1212319     .114119
       1820  |   .0200743    .058323     0.34   0.731    -.0948576    .1350063
       1830  |   .2087812   .0572592     3.65   0.000     .0959455    .3216169
       1840  |    .197598   .0574957     3.44   0.001     .0842963    .3108996
       1850  |   .2158287   .0567973     3.80   0.000     .1039034     .327754
       1860  |   .2534617   .0577242     4.39   0.000     .1397099    .3672136
       1870  |   .2471564   .0579823     4.26   0.000     .1328958    .3614171
       1880  |   .2769397   .0585158     4.73   0.000     .1616279    .3922515
       1890  |   .3248149    .059132     5.49   0.000     .2082887    .4413411
       1900  |   .3379169   .0596647     5.66   0.000      .220341    .4554928
       1910  |   .3517125   .0597827     5.88   0.000      .233904     .469521
       1920  |    .359696    .062085     5.79   0.000     .2373506    .4820414
       1930  |   .3509075   .0664204     5.28   0.000     .2200186    .4817963
       1940  |   .3398903   .0723964     4.69   0.000     .1972251    .4825555
       1950  |   .3374903   .0740761     4.56   0.000     .1915151    .4834655
             |
       _cons |  -.0415904   .0504549    -0.82   0.411    -.1410174    .0578367
-------------+----------------------------------------------------------------
     sigma_u |  .15439355
     sigma_e |  .10129331
         rho |  .69909016   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(26, 224) =    24.24             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        268
                                                  F(   8,     16) =       1.89
                                                  Prob > F        =     0.1335
                                                  R-squared       =     0.2283
                                                  Adj R-squared   =     0.1521
                                                  Root MSE        =     0.1897

                         (Std. Err. adjusted for 17 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0093514   .0229537     0.41   0.689    -.0393083    .0580111
         80  |  -.0028382    .034631    -0.08   0.936    -.0762525    .0705762
         90  |   .0038464   .0425207     0.09   0.929    -.0862934    .0939862
        100  |    .029164   .0548708     0.53   0.602    -.0871568    .1454849
        110  |    .035844   .0560717     0.64   0.532    -.0830227    .1547106
        120  |   .0243049    .061355     0.40   0.697    -.1057619    .1543717
        130  |    .018692   .0865826     0.22   0.832     -.164855     .202239
        140  |   .0314654   .1157205     0.27   0.789    -.2138512    .2767819
             |
       _cons |   .2318245   .0387117     5.99   0.000     .1497595    .3138895
-------------+----------------------------------------------------------------
        year |   absorbed                                      (17 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    16) =    0.18
            Prob > F =    0.6746

. predict small_share_hat, xb

. gen se = .
(268 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(27 real changes made)
(26 real changes made)
(25 real changes made)
(24 real changes made)
(23 real changes made)
(22 real changes made)
(14 real changes made)
(28 real changes made)

. replace se = _se[_cons] if event_time==60
(79 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        241
                                                  F(   3,     16) =       9.64
                                                  Prob > F        =     0.0007
                                                  R-squared       =     0.1906
                                                  Adj R-squared   =     0.1250
                                                  Root MSE        =     0.0885

                         (Std. Err. adjusted for 17 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |   -.006475   .0112565    -0.58   0.573    -.0303378    .0173878
lag_deviat~n |  -.1250286   .0525642    -2.38   0.030    -.2364598   -.0135974
_IaftXlag_~1 |   .0405526   .0620288     0.65   0.523    -.0909426    .1720478
       _cons |   .0100723   .0109114     0.92   0.370    -.0130589    .0332035
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (16 categories)

. 
. replace event_time = event_time - offset
(268 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/tennessee.gph saved)

. 
. capture log close
