-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox/projects/borders/bridges/research_designs/con
> vergence/results/tennessee.log
  log type:  text
 opened on:  14 May 2014, 20:54:08

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26668.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26668.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
tennessee
(37 vars, 27 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       27   ->     459
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St26668.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10

. local window 40

. 
. local sample_window 60

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset

. keep if abs(event_time-offset)<=`sample_window'
(191 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(52 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset
(18 real changes made)

. 
. gen byte before = year<start

. gen byte after = year>=start

. 
. egen left_before = sum(cond(before,left,0)), by(river_bridge)

. egen right_before = sum(cond(before,right,0)), by(river_bridge)

. 
. gen small_share = cond(left_before<right_before,left,right)/total
(30 missing values generated)

. replace small_share=0 if total==0
(30 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(30 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(27 missing values generated)

. gen lag_deviation = L10.deviation
(27 missing values generated)

. 
end of do-file

. 
. xtreg left i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       268
Group variable: river_bridge                    Number of groups   =        27

R-sq:  within  = 0.7827                         Obs per group: min =         4
       between = 0.0460                                        avg =       9.9
       overall = 0.4963                                        max =        13

                                                F(24,217)          =     32.57
corr(u_i, Xb)  = -0.0361                        Prob > F           =    0.0000

------------------------------------------------------------------------------
        left |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0311393   .3165234     0.10   0.922    -.5927145     .654993
         80  |  -.0552741   .4082457    -0.14   0.892    -.8599085    .7493604
         90  |   .2416957   .5111562     0.47   0.637    -.7657709    1.249162
        100  |   .4568807   .6274708     0.73   0.467    -.7798368    1.693598
        110  |   1.020668    .743109     1.37   0.171    -.4439674    2.485303
        120  |   1.248115   .8542626     1.46   0.145    -.4355991    2.931829
        130  |   1.957961   .9647266     2.03   0.044     .0565269    3.859395
        140  |   2.243072   1.173557     1.91   0.057    -.0699584    4.556103
             |
        year |
       1800  |   .1834012    .541085     0.34   0.735    -.8830537    1.249856
       1810  |   .1957459   .5436602     0.36   0.719    -.8757846    1.267276
       1820  |   .6714836   .5952238     1.13   0.261    -.5016764    1.844644
       1830  |   .8697052   .6644751     1.31   0.192    -.4399461    2.179357
       1840  |   1.694279   .7232266     2.34   0.020     .2688306    3.119727
       1850  |   1.453384    .813002     1.79   0.075    -.1490072    3.055776
       1860  |   1.586358   .9199324     1.72   0.086    -.2267884    3.399505
       1870  |   2.010276   1.015858     1.98   0.049     .0080643    4.012487
       1880  |   2.720616   1.066515     2.55   0.011     .6185611    4.822672
       1890  |   3.084063   1.167491     2.64   0.009     .7829892    5.385137
       1900  |   3.728378   1.304026     2.86   0.005       1.1582    6.298557
       1910  |   3.937901   1.384512     2.84   0.005     1.209088    6.666714
       1920  |   3.781165   1.511639     2.50   0.013     .8017913    6.760539
       1930  |   3.781297   1.634473     2.31   0.022     .5598213    7.002773
       1940  |   3.551956   1.737144     2.04   0.042     .1281211    6.975792
       1950  |   3.204963   1.860218     1.72   0.086    -.4614453     6.87137
             |
       _cons |  -.4026063   .7526756    -0.53   0.593    -1.886097    1.080884
-------------+----------------------------------------------------------------
     sigma_u |  1.6148945
     sigma_e |  .90696597
         rho |  .76021159   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(26, 217) =    22.58             Prob > F = 0.0000

. xtreg right i.event_time i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       268
Group variable: river_bridge                    Number of groups   =        27

R-sq:  within  = 0.4831                         Obs per group: min =         4
       between = 0.0611                                        avg =       9.9
       overall = 0.2196                                        max =        13

                                                F(24,217)          =      8.45
corr(u_i, Xb)  = 0.0340                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       right |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .3090121   .7942877     0.39   0.698    -1.256494    1.874518
         80  |   .5545684   1.024457     0.54   0.589    -1.464591    2.573728
         90  |    .627859   1.282702     0.49   0.625     -1.90029    3.156008
        100  |   1.188446   1.574583     0.75   0.451    -1.914988     4.29188
        110  |   1.731132   1.864767     0.93   0.354    -1.944242    5.406506
        120  |   2.257299   2.143697     1.05   0.294    -1.967834    6.482432
        130  |   3.275412   2.420897     1.35   0.177     -1.49607    8.046894
        140  |   3.149104    2.94494     1.07   0.286    -2.655243    8.953452
             |
        year |
       1800  |  -.1170555   1.357805    -0.09   0.931     -2.79323    2.559119
       1810  |   -.152135   1.364268    -0.11   0.911    -2.841047    2.536777
       1820  |   -1.52382   1.493662    -1.02   0.309    -4.467762    1.420123
       1830  |  -2.110815   1.667442    -1.27   0.207     -5.39727     1.17564
       1840  |  -1.480477   1.814874    -0.82   0.416    -5.057514     2.09656
       1850  |  -2.173969   2.040157    -1.07   0.288     -6.19503    1.847092
       1860  |  -2.038285    2.30849    -0.88   0.378    -6.588218    2.511647
       1870  |   -.852517   2.549206    -0.33   0.738    -5.876891    4.171857
       1880  |  -.7299215   2.676327    -0.27   0.785    -6.004845    4.545002
       1890  |   .5651734   2.929717     0.19   0.847     -5.20917    6.339517
       1900  |   1.343107   3.272339     0.41   0.682    -5.106531    7.792745
       1910  |   1.490948   3.474312     0.43   0.668    -5.356769    8.338664
       1920  |   2.071277   3.793324     0.55   0.586      -5.4052    9.547753
       1930  |   1.884676   4.101568     0.46   0.646    -6.199335    9.968687
       1940  |    1.55204   4.359211     0.36   0.722    -7.039775    10.14385
       1950  |   .6905033   4.668053     0.15   0.883    -8.510025    9.891032
             |
       _cons |   1.851615   1.888773     0.98   0.328    -1.871075    5.574305
-------------+----------------------------------------------------------------
     sigma_u |  3.2697276
     sigma_e |  2.2759515
         rho |  .67362288   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(26, 217) =    22.47             Prob > F = 0.0000

. 
. xtreg small_share after i.year, i(river_bridge) fe

Fixed-effects (within) regression               Number of obs      =       268
Group variable: river_bridge                    Number of groups   =        27

R-sq:  within  = 0.3645                         Obs per group: min =         4
       between = 0.1997                                        avg =       9.9
       overall = 0.2567                                        max =        13

                                                F(17,224)          =      7.56
corr(u_i, Xb)  = 0.0837                         Prob > F           =    0.0000

------------------------------------------------------------------------------
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       after |   .0183638   .0277454     0.66   0.509    -.0363117    .0730393
             |
        year |
       1800  |  -.0360653   .0601069    -0.60   0.549    -.1545127    .0823821
       1810  |  -.0360653   .0601069    -0.60   0.549    -.1545127    .0823821
       1820  |  -.0222549   .0587056    -0.38   0.705    -.1379408     .093431
       1830  |   .0984081   .0576349     1.71   0.089    -.0151678     .211984
       1840  |   .0884312   .0578729     1.53   0.128    -.0256137    .2024761
       1850  |   .0849183   .0571699     1.49   0.139    -.0277413    .1975778
       1860  |   .1018232   .0581028     1.75   0.081    -.0126748    .2163213
       1870  |    .131466   .0583627     2.25   0.025     .0164558    .2464762
       1880  |   .1814045   .0588996     3.08   0.002     .0653363    .2974728
       1890  |   .2108413   .0595199     3.54   0.000     .0935506    .3281319
       1900  |   .2314088   .0600561     3.85   0.000     .1130616     .349756
       1910  |   .2305838   .0601749     3.83   0.000     .1120025    .3491651
       1920  |    .247836   .0624923     3.97   0.000      .124688     .370984
       1930  |   .2357161   .0668562     3.53   0.001     .1039686    .3674636
       1940  |   .2284987   .0728714     3.14   0.002     .0848976    .3720999
       1950  |   .2264868   .0745621     3.04   0.003      .079554    .3734196
             |
       _cons |   .0443501   .0507859     0.87   0.383    -.0557292    .1444294
-------------+----------------------------------------------------------------
     sigma_u |  .14243427
     sigma_e |   .1019578
         rho |  .66119929   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(26, 224) =    18.81             Prob > F = 0.0000

. areg small_share i.event_time, a(year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        268
                                                  F(   8,     16) =       4.87
                                                  Prob > F        =     0.0035
                                                  R-squared       =     0.2734
                                                  Adj R-squared   =     0.2016
                                                  Root MSE        =     0.1743

                         (Std. Err. adjusted for 17 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  event_time |
         70  |   .0111067   .0218911     0.51   0.619    -.0353004    .0575138
         80  |  -.0191694   .0216498    -0.89   0.389    -.0650649    .0267261
         90  |  -.0236711   .0282267    -0.84   0.414    -.0835091    .0361669
        100  |  -.0097006   .0332561    -0.29   0.774    -.0802005    .0607992
        110  |  -.0308467   .0350674    -0.88   0.392    -.1051862    .0434927
        120  |  -.0129214   .0586336    -0.22   0.828     -.137219    .1113763
        130  |  -.0189995   .0779864    -0.24   0.811    -.1843232    .1463243
        140  |   -.050002   .0803861    -0.62   0.543     -.220413     .120409
             |
       _cons |   .2349921   .0373676     6.29   0.000     .1557763    .3142079
-------------+----------------------------------------------------------------
        year |   absorbed                                      (17 categories)

. test (110.event_time+120.event_time+130.event_time+140.event_time)/4==(0+70.e
> vent_time+80.event_time+90.event_time)/4

 ( 1)  - .25*70.event_time - .25*80.event_time - .25*90.event_time +
       .25*110.event_time + .25*120.event_time + .25*130.event_time +
       .25*140.event_time = 0

       F(  1,    16) =    0.16
            Prob > F =    0.6911

. predict small_share_hat, xb

. gen se = .
(268 missing values generated)

. foreach t in 70 80 90 100 110 120 130 140 {
  2.         replace se = _se[`t'.event_time] if event_time==`t'
  3. }
(27 real changes made)
(26 real changes made)
(25 real changes made)
(24 real changes made)
(23 real changes made)
(22 real changes made)
(14 real changes made)
(28 real changes made)

. replace se = _se[_cons] if event_time==60
(79 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        241
                                                  F(   3,     16) =       6.66
                                                  Prob > F        =     0.0040
                                                  R-squared       =     0.1623
                                                  Adj R-squared   =     0.0944
                                                  Root MSE        =     0.0909

                         (Std. Err. adjusted for 17 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0056129   .0120258    -0.47   0.647    -.0311064    .0198806
lag_deviat~n |  -.1746493   .0531215    -3.29   0.005    -.2872618   -.0620367
_IaftXlag_~1 |    .059304   .0688869     0.86   0.402    -.0867297    .2053378
       _cons |    .028113   .0109521     2.57   0.021     .0048956    .0513303
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (16 categories)

. 
. replace event_time = event_time - offset
(268 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se

. gen lower = small_share_hat - 1.96*se

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. graph save results/`1'.gph, replace
(file results/tennessee.gph saved)

. 
. capture log close
