-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Dropbox (CEU MicroData)/projects/borders/bridges/rese
> arch_designs/convergence/results/tennessee.log
  log type:  text
 opened on:   2 Jul 2014, 16:35:03

. 
. do create_variables `1'

. tempfile rivers

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54579.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54579.000001 saved

. foreach river in `1' `2' `3' `4' `5' `6' `7' `8' `9' `10' `11' `12' {
  2.         di "`1'"
  3.         insheet using data/`river'.csv, clear
  4.         gen bridge = _n
  5.         gen str river = "`river'"
  6.         reshape long left_ right_, i(bridge) j(year)
  7.         ren left_ left
  8.         ren right_ right
  9.         append using `rivers'
 10.         save `rivers', replace
 11. }
tennessee
(37 vars, 75 obs)
(note: j = 1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 192
> 0 1930 1940 1950)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       75   ->    1275
Number of variables                  39   ->       8
j variable (17 values)                    ->   year
xij variables:
      left_1790 left_1800 ... left_1950   ->   left_
   right_1790 right_1800 ... right_1950   ->   right_
-----------------------------------------------------------------------------
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St54579.000001 saved

. egen river_bridge = group(river bridge)

. egen river_year = group(river year)

. gen segment = int(river_mile/10)

. egen river_segment = group(river segment)

. 
. tsset river_bridge year
       panel variable:  river_bridge (strongly balanced)
        time variable:  year, 1790 to 1950, but with gaps
                delta:  1 unit

. 
. gen total = left+right

. 
. gen start_decade = int(start/10)*10
(816 missing values generated)

. local dec 3

. local window `dec'0

. 
. local sample_window 40

. local latest 1900

. 
. * for ease of reading, introduce a round offset for event time
. scalar offset = 100

. gen event_time = year-start_decade+offset
(816 missing values generated)

. * also keep control regions
. keep if abs(event_time-offset)<=`sample_window' | missing(start)
(261 observations deleted)

. * only use 19th century, when post offices are relevant
. keep if year<=`latest' & (start_decade<=`latest' | missing(start))
(362 observations deleted)

. 
. replace event_time = -`window'+offset if event_time<-`window'+offset
(9 real changes made)

. replace event_time = `window'+offset if event_time>`window'+offset & !missing
> (event_time)
(7 real changes made)

. 
. forval t = 7/13 {
  2.         gen byte treatment`t'0 = (event_time==`t'0)
  3. }

. 
. gen byte no_bridge = missing(start)

. gen byte before = year<start & !no_bridge

. gen byte after = year>=start

. 
. egen left_before = sum(cond(!after,left,0)), by(river_bridge)

. egen right_before = sum(cond(!after,right,0)), by(river_bridge)

. 
. gen small = cond(left_before<right_before,left,right)

. gen large = cond(left_before<right_before,right,left)

. gen log_small = ln(small)
(401 missing values generated)

. gen log_large = ln(large)
(270 missing values generated)

. 
. gen river_mile_sq = river_mile^2

. 
. gen small_share = small/total
(256 missing values generated)

. replace small_share=0 if total==0
(256 real changes made)

. * if total number of post offices is poisson, the variance is sqrt of mean
. gen scaled_difference = cond(left_before<right_before,right-left,left-right)/
> sqrt(total)
(256 missing values generated)

. 
. gen deviation = 0.5-small_share

. tsset river_bridge year
       panel variable:  river_bridge (unbalanced)
        time variable:  year, 1790 to 1900, but with gaps
                delta:  1 unit

. gen change = deviation-L10.deviation
(57 missing values generated)

. gen lag_deviation = L10.deviation
(57 missing values generated)

. 
end of do-file

. do estimate_and_plot

. areg small_share treatment*, a(river_year) cluster(river_segment)

Linear regression, absorbing indicators           Number of obs   =        652
                                                  F(   7,     37) =       2.52
                                                  Prob > F        =     0.0320
                                                  R-squared       =     0.2600
                                                  Adj R-squared   =     0.2390
                                                  Root MSE        =     0.1994

                         (Std. Err. adjusted for 38 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
 small_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 treatment70 |  -.0389331   .0543031    -0.72   0.478    -.1489615    .0710954
 treatment80 |  -.0015486   .1115689    -0.01   0.989    -.2276087    .2245115
 treatment90 |  -.0289008   .1027115    -0.28   0.780    -.2370142    .1792125
treatment100 |    .006466   .1317447     0.05   0.961    -.2604741    .2734062
treatment110 |   .0534411   .1104637     0.48   0.631    -.1703795    .2772618
treatment120 |   .0499524   .0849722     0.59   0.560    -.1222175    .2221224
treatment130 |   .0500422   .1272553     0.39   0.696    -.2078016    .3078859
       _cons |   .1498324   .0173922     8.61   0.000     .1145925    .1850722
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (12 categories)

. test (treatment70+treatment80+treatment80)/3==(treatment110+treatment120+trea
> tment130)/3

 ( 1)  .3333333*treatment70 + .6666667*treatment80 - .3333333*treatment110 -
       .3333333*treatment120 - .3333333*treatment130 = 0

       F(  1,    37) =    1.54
            Prob > F =    0.2226

. predict small_share_hat, xb

. gen se = .
(652 missing values generated)

. foreach t in 80 90 100 110 120 130 {
  2.         replace se = _se[treatment`t'] if event_time==`t'
  3. }
(9 real changes made)
(9 real changes made)
(9 real changes made)
(9 real changes made)
(8 real changes made)
(14 real changes made)

. replace se = _se[_cons] if event_time==70
(18 real changes made)

. 
. xi: areg change i.after*lag_deviation, a(river_year)  cluster(river_segment)
i.after           _Iafter_0-1         (naturally coded; _Iafter_0 omitted)
i.after*lag_d~n   _IaftXlag_d_#       (coded as above)

Linear regression, absorbing indicators           Number of obs   =        595
                                                  F(   3,     37) =      19.60
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2023
                                                  Adj R-squared   =     0.1845
                                                  Root MSE        =     0.1669

                         (Std. Err. adjusted for 38 clusters in river_segment)
------------------------------------------------------------------------------
             |               Robust
      change |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   _Iafter_1 |  -.0665527   .0306992    -2.17   0.037    -.1287552   -.0043502
lag_deviat~n |  -.3986728   .0605583    -6.58   0.000    -.5213755     -.27597
_IaftXlag_~1 |   .2339767   .0961809     2.43   0.020     .0390956    .4288578
       _cons |   .1151747   .0229156     5.03   0.000     .0687432    .1616062
-------------+----------------------------------------------------------------
  river_year |   absorbed                                      (11 categories)

. 
. replace event_time = event_time - offset
(76 real changes made)

. label var small_share_hat "Share of smaller side of the river"

. label var event_time "Years since bridge"

. 
. gen upper = small_share_hat + 1.96*se
(576 missing values generated)

. gen lower = small_share_hat - 1.96*se
(576 missing values generated)

. tw (area  upper lower event_time, sort astyle( ci plotregion)) (line small_sh
> are_hat event_time, sort),  scheme(s2color) legend(order(1 "95% confidence in
> terval" 3 "Share of smaller side of the river"))

. 
end of do-file

. graph save results/`1'.gph, replace
(file results/tennessee.gph saved)

. 
. capture log close
