
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.0   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501306004725
         Licensed to:  Miklos Koren
                       Central European University

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

. do iv 

. set more off

. set matsize 5000, permanently
(set matsize preference recorded)

. local RIVERS arkansas colorado columbia connecticut delaware hudson ohio red 
> snake tennessee missouri  mississippi

. tempfile rivers

. clear

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved

. 
. foreach river in `RIVERS' {
  2.         insheet using output/`river'.csv, clear
  3.         gen location = _n
  4.         gen str river = "`river'"
  5.         append using `rivers'
  6.         save `rivers', replace
  7. }
(5 vars, 118 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 166 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 112 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 44 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 51 obs)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 44 obs)
(note: variable river was str6, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 154 obs)
(note: variable river was str4, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 125 obs)
(note: variable river was str3, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 130 obs)
(note: variable river was str5, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 82 obs)
(note: variable river was str9, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 345 obs)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved
(5 vars, 299 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St02385.000001 saved

. 
. egen river_number = group(river)

. su river_number

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
river_number |      1670    6.816766    3.190941          1         12

. local N = r(max)

. 
. forval n=1/`N' {
  2.         gen river_mile_`n' = river_mile*(river_number==`n')
  3.         gen river_mile_sq_`n' = river_mile^2*(river_number==`n')
  4. }

. 
. gen segment = int(river_mile*1.6/30)

. egen cluster = group(river segment)

. 
. gen log_post_office_count = log(post_office_count)
(496 missing values generated)

. gen byte has_bridge = bridges>0 & !missing(bridges)

. 
. tsset river_number location
       panel variable:  river_number (unbalanced)
        time variable:  location, 1 to 345
                delta:  1 unit

. 
. reg bridges river_mile_* water_covered_area crossing_points, robust

Linear regression                                      Number of obs =    1670
                                                       F( 26,  1643) =    6.11
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0819
                                                       Root MSE      =  .96684

------------------------------------------------------------------------------
             |               Robust
     bridges |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
river_mile_1 |     .00123   .0008835     1.39   0.164    -.0005028    .0029629
river_mi~q_1 |  -1.49e-06   1.52e-06    -0.98   0.326    -4.47e-06    1.49e-06
river_mile_2 |  -.0009517   .0003043    -3.13   0.002    -.0015485   -.0003549
river_mi~q_2 |   9.59e-07   3.38e-07     2.83   0.005     2.95e-07    1.62e-06
river_mile_3 |   .0002532   .0007626     0.33   0.740    -.0012425    .0017489
river_mi~q_3 |  -3.59e-07   1.33e-06    -0.27   0.787    -2.97e-06    2.25e-06
river_mile_4 |    .016884   .0065363     2.58   0.010     .0040637    .0297044
river_mi~q_4 |  -.0000612   .0000276    -2.22   0.027    -.0001152   -7.07e-06
river_mile_5 |   .0093071   .0032019     2.91   0.004     .0030269    .0155873
river_mi~q_5 |  -.0000268   .0000121    -2.21   0.027    -.0000505   -3.02e-06
river_mile_6 |   .0058551   .0028503     2.05   0.040     .0002646    .0114456
river_mi~q_6 |  -.0000212   .0000121    -1.75   0.081    -.0000449    2.60e-06
river_mile_7 |   .0001737   .0002864     0.61   0.544     -.000388    .0007354
river_mi~q_7 |   1.16e-07   2.01e-07     0.58   0.564    -2.78e-07    5.10e-07
river_mile_8 |   .0002343   .0001807     1.30   0.195    -.0001202    .0005888
river_mi~q_8 |  -1.55e-07   9.71e-08    -1.60   0.111    -3.45e-07    3.55e-08
river_mile_9 |  -.0002243   .0009385    -0.24   0.811    -.0020651    .0016165
river_mi~q_9 |   1.39e-06   1.19e-06     1.17   0.244    -9.45e-07    3.72e-06
river_m~e_10 |  -.0001582   .0006683    -0.24   0.813     -.001469    .0011527
river_m~q_10 |  -1.88e-07   1.03e-06    -0.18   0.855    -2.21e-06    1.83e-06
river_m~e_11 |   -.000257   .0005858    -0.44   0.661     -.001406    .0008919
river_m~q_11 |   3.80e-07   8.45e-07     0.45   0.653    -1.28e-06    2.04e-06
river_m~e_12 |   .0009711   .0009745     1.00   0.319    -.0009403    .0028825
river_m~q_12 |  -2.14e-06   2.05e-06    -1.04   0.297    -6.17e-06    1.89e-06
water_cove~a |  -.6254796   .1221625    -5.12   0.000    -.8650902    -.385869
crossing_p~s |   .0537433    .051979     1.03   0.301    -.0482087    .1556954
       _cons |   .3265985   .0618846     5.28   0.000     .2052175    .4479796
------------------------------------------------------------------------------

. test water_covered_area crossing_points

 ( 1)  water_covered_area = 0
 ( 2)  crossing_points = 0

       F(  2,  1643) =   13.54
            Prob > F =    0.0000

. 
. label var log_post_office_count "Number of post offices (log)"

. label var bridges "Number of bridges"

. label var has_bridge "Segment has a bridge (dummy)"

. label var water_covered_area "Width of the river"

. label var crossing_points "Number of predicted crossing points"

. 
. reg bridges water_covered_area L.water_covered_area F.water_covered_area cros
> sing_points F.crossing_points L.crossing_points river_mile_*, robust

Linear regression                                      Number of obs =    1646
                                                       F( 30,  1615) =    5.50
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0825
                                                       Root MSE      =   .9689

------------------------------------------------------------------------------
             |               Robust
     bridges |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
water_cove~a |
         --. |  -.6862793   .3042423    -2.26   0.024     -1.28303   -.0895282
         L1. |  -.3128909   .1939032    -1.61   0.107    -.6932193    .0674375
         F1. |   .3976953   .2997338     1.33   0.185    -.1902128    .9856034
             |
crossing_p~s |
         --. |   .0519928   .0538181     0.97   0.334    -.0535679    .1575535
         F1. |  -.0025765   .0547089    -0.05   0.962    -.1098843    .1047314
         L1. |   .0457457   .0549643     0.83   0.405    -.0620631    .1535546
             |
river_mile_1 |   .0012233   .0009011     1.36   0.175    -.0005441    .0029907
river_mi~q_1 |  -1.34e-06   1.57e-06    -0.85   0.393    -4.43e-06    1.74e-06
river_mile_2 |  -.0007823   .0003192    -2.45   0.014    -.0014084   -.0001562
river_mi~q_2 |   7.79e-07   3.53e-07     2.21   0.027     8.76e-08    1.47e-06
river_mile_3 |   .0003228    .000781     0.41   0.679    -.0012091    .0018548
river_mi~q_3 |  -3.46e-07   1.39e-06    -0.25   0.803    -3.07e-06    2.37e-06
river_mile_4 |   .0169017   .0068027     2.48   0.013     .0035586    .0302447
river_mi~q_4 |  -.0000597   .0000294    -2.03   0.042    -.0001173   -2.04e-06
river_mile_5 |    .008972   .0033347     2.69   0.007     .0024313    .0155128
river_mi~q_5 |  -.0000245   .0000129    -1.90   0.058    -.0000498    8.03e-07
river_mile_6 |   .0058672   .0029902     1.96   0.050     2.18e-06    .0117323
river_mi~q_6 |  -.0000197   .0000131    -1.51   0.132    -.0000455    5.98e-06
river_mile_7 |   .0001893   .0002907     0.65   0.515    -.0003809    .0007595
river_mi~q_7 |   1.18e-07   2.06e-07     0.57   0.568    -2.87e-07    5.22e-07
river_mile_8 |   .0002724   .0001832     1.49   0.137    -.0000869    .0006316
river_mi~q_8 |  -1.65e-07   9.88e-08    -1.67   0.094    -3.59e-07    2.84e-08
river_mile_9 |  -.0000453   .0009565    -0.05   0.962    -.0019215    .0018308
river_mi~q_9 |   1.11e-06   1.21e-06     0.92   0.360    -1.27e-06    3.49e-06
river_m~e_10 |  -.0001332   .0006887    -0.19   0.847    -.0014841    .0012177
river_m~q_10 |  -1.47e-07   1.08e-06    -0.14   0.891    -2.26e-06    1.96e-06
river_m~e_11 |  -.0001819   .0006002    -0.30   0.762    -.0013591    .0009953
river_m~q_11 |   3.59e-07   8.75e-07     0.41   0.682    -1.36e-06    2.08e-06
river_m~e_12 |   .0010334   .0009948     1.04   0.299    -.0009179    .0029847
river_m~q_12 |  -2.07e-06   2.13e-06    -0.97   0.331    -6.24e-06    2.11e-06
       _cons |   .2913138     .06704     4.35   0.000     .1598192    .4228083
------------------------------------------------------------------------------

. outreg2 using output/bridges_first_stage.tex, tex(frag) replace label
output/bridges_first_stage.tex
dir : seeout

. 
. reg has_bridge water_covered_area L.water_covered_area F.water_covered_area c
> rossing_points F.crossing_points L.crossing_points river_mile_*, robust

Linear regression                                      Number of obs =    1646
                                                       F( 30,  1615) =    8.00
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1165
                                                       Root MSE      =  .39226

------------------------------------------------------------------------------
             |               Robust
  has_bridge |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
water_cove~a |
         --. |  -.2097683   .1346551    -1.56   0.119    -.4738854    .0543488
         L1. |  -.1326174   .1125774    -1.18   0.239    -.3534304    .0881957
         F1. |   .0837313   .1101662     0.76   0.447    -.1323524    .2998151
             |
crossing_p~s |
         --. |  -.0125103   .0236864    -0.53   0.597    -.0589696     .033949
         F1. |   .0015155    .022211     0.07   0.946      -.04205    .0450809
         L1. |   .0198565   .0221702     0.90   0.371    -.0236289    .0633419
             |
river_mile_1 |   .0005644   .0004302     1.31   0.190    -.0002793    .0014081
river_mi~q_1 |  -5.88e-07   7.31e-07    -0.80   0.421    -2.02e-06    8.46e-07
river_mile_2 |  -.0007056   .0001904    -3.70   0.000    -.0010791    -.000332
river_mi~q_2 |   7.70e-07   2.33e-07     3.30   0.001     3.12e-07    1.23e-06
river_mile_3 |   .0003032   .0004482     0.68   0.499    -.0005758    .0011822
river_mi~q_3 |  -4.69e-07   7.99e-07    -0.59   0.558    -2.04e-06    1.10e-06
river_mile_4 |   .0061851   .0020609     3.00   0.003     .0021427    .0102275
river_mi~q_4 |  -.0000182   9.73e-06    -1.87   0.061    -.0000373    8.48e-07
river_mile_5 |   .0054448   .0015127     3.60   0.000     .0024778    .0084117
river_mi~q_5 |  -.0000139   6.27e-06    -2.22   0.026    -.0000262   -1.64e-06
river_mile_6 |   .0035504   .0020017     1.77   0.076    -.0003757    .0074765
river_mi~q_6 |  -9.73e-06   9.61e-06    -1.01   0.311    -.0000286    9.11e-06
river_mile_7 |  -.0000151   .0001116    -0.14   0.892     -.000234    .0002037
river_mi~q_7 |   6.75e-08   7.00e-08     0.96   0.335    -6.98e-08    2.05e-07
river_mile_8 |   .0000299   .0000879     0.34   0.734    -.0001425    .0002023
river_mi~q_8 |  -3.45e-08   4.60e-08    -0.75   0.453    -1.25e-07    5.56e-08
river_mile_9 |  -.0000556   .0003013    -0.18   0.854    -.0006466    .0005355
river_mi~q_9 |   5.28e-07   3.85e-07     1.37   0.170    -2.27e-07    1.28e-06
river_m~e_10 |  -.0001037   .0003407    -0.30   0.761     -.000772    .0005646
river_m~q_10 |  -5.80e-08   5.32e-07    -0.11   0.913    -1.10e-06    9.85e-07
river_m~e_11 |  -.0001783   .0003172    -0.56   0.574    -.0008004    .0004437
river_m~q_11 |   3.07e-07   4.69e-07     0.66   0.512    -6.13e-07    1.23e-06
river_m~e_12 |   .0006581   .0006542     1.01   0.315    -.0006251    .0019412
river_m~q_12 |  -1.38e-06   1.52e-06    -0.91   0.363    -4.36e-06    1.60e-06
       _cons |   .2019424   .0319836     6.31   0.000     .1392086    .2646762
------------------------------------------------------------------------------

. outreg2 using output/bridges_first_stage, tex(frag) append label
output/bridges_first_stage.tex
dir : seeout

.  
. ivregress 2sls log_post_office_count (bridges = water_covered_area L.water_co
> vered_area F.water_covered_area crossing_points F.crossing_points L.crossing_
> points) river_mile_*, robust

Instrumental variables (2SLS) regression               Number of obs =    1155
                                                       Wald chi2(25) =  847.16
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.3675
                                                       Root MSE      =  .57912

------------------------------------------------------------------------------
             |               Robust
log_post_o~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bridges |   .2316948   .1251211     1.85   0.064    -.0135381    .4769278
river_mile_1 |   -.002819   .0005821    -4.84   0.000      -.00396   -.0016781
river_mi~q_1 |   2.58e-06   9.11e-07     2.83   0.005     7.89e-07    4.36e-06
river_mile_2 |  -.0038248   .0007381    -5.18   0.000    -.0052714   -.0023782
river_mi~q_2 |   3.15e-06   7.64e-07     4.13   0.000     1.65e-06    4.65e-06
river_mile_3 |  -.0017772   .0006561    -2.71   0.007    -.0030632   -.0004913
river_mi~q_3 |   1.63e-06   1.10e-06     1.47   0.140    -5.36e-07    3.80e-06
river_mile_4 |   .0032871   .0032804     1.00   0.316    -.0031424    .0097166
river_mi~q_4 |  -.0000153   .0000142    -1.08   0.282    -.0000431    .0000125
river_mile_5 |   .0110207   .0022479     4.90   0.000     .0066149    .0154265
river_mi~q_5 |  -.0000372   8.10e-06    -4.60   0.000    -.0000531   -.0000214
river_mile_6 |   .0183264   .0027068     6.77   0.000      .013021    .0236317
river_mi~q_6 |  -.0000864   .0000141    -6.13   0.000     -.000114   -.0000587
river_mile_7 |  -.0004697   .0001833    -2.56   0.010    -.0008291   -.0001104
river_mi~q_7 |   9.26e-08   1.18e-07     0.78   0.434    -1.39e-07    3.24e-07
river_mile_8 |  -.0012356   .0001573    -7.86   0.000    -.0015438   -.0009273
river_mi~q_8 |   4.56e-07   8.22e-08     5.54   0.000     2.94e-07    6.17e-07
river_mile_9 |   .0002891   .0004516     0.64   0.522     -.000596    .0011742
river_mi~q_9 |   5.31e-07   5.68e-07     0.93   0.350    -5.83e-07    1.64e-06
river_m~e_10 |  -.0017657   .0007238    -2.44   0.015    -.0031842   -.0003471
river_m~q_10 |   5.04e-07   1.17e-06     0.43   0.665    -1.78e-06    2.79e-06
river_m~e_11 |  -.0040953   .0006408    -6.39   0.000    -.0053512   -.0028394
river_m~q_11 |   4.60e-06   1.07e-06     4.28   0.000     2.50e-06    6.71e-06
river_m~e_12 |  -.0005949   .0010492    -0.57   0.571    -.0026513    .0014616
river_m~q_12 |  -1.01e-06   2.52e-06    -0.40   0.690    -5.95e-06    3.93e-06
       _cons |   1.007695   .0691746    14.57   0.000     .8721149    1.143274
------------------------------------------------------------------------------
Instrumented:  bridges
Instruments:   river_mile_1 river_mile_sq_1 river_mile_2 river_mile_sq_2
               river_mile_3 river_mile_sq_3 river_mile_4 river_mile_sq_4
               river_mile_5 river_mile_sq_5 river_mile_6 river_mile_sq_6
               river_mile_7 river_mile_sq_7 river_mile_8 river_mile_sq_8
               river_mile_9 river_mile_sq_9 river_mile_10 river_mile_sq_10
               river_mile_11 river_mile_sq_11 river_mile_12 river_mile_sq_12
               water_covered_area L.water_covered_area F.water_covered_area
               crossing_points F.crossing_points L.crossing_points

. outreg2 using output/bridges_iv.tex, tex(frag) replace label
output/bridges_iv.tex
dir : seeout

. 
. ivregress 2sls log_post_office_count (has_bridge = water_covered_area L.water
> _covered_area F.water_covered_area crossing_points F.crossing_points L.crossi
> ng_points) river_mile_*, robust

Instrumental variables (2SLS) regression               Number of obs =    1155
                                                       Wald chi2(25) =  861.33
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.3669
                                                       Root MSE      =  .57936

------------------------------------------------------------------------------
             |               Robust
log_post_o~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  has_bridge |   .5798648   .3668092     1.58   0.114     -.139068    1.298798
river_mile_1 |  -.0028431   .0006211    -4.58   0.000    -.0040603   -.0016258
river_mi~q_1 |   2.53e-06   9.37e-07     2.70   0.007     6.93e-07    4.37e-06
river_mile_2 |  -.0036257   .0007337    -4.94   0.000    -.0050638   -.0021877
river_mi~q_2 |   2.88e-06   7.71e-07     3.74   0.000     1.37e-06    4.39e-06
river_mile_3 |  -.0019035   .0006762    -2.81   0.005    -.0032288   -.0005781
river_mi~q_3 |   1.81e-06   1.16e-06     1.56   0.118    -4.62e-07    4.08e-06
river_mile_4 |   .0035981   .0035451     1.01   0.310    -.0033501    .0105463
river_mi~q_4 |  -.0000185   .0000145    -1.27   0.203    -.0000469    9.97e-06
river_mile_5 |   .0098987   .0028179     3.51   0.000     .0043758    .0154216
river_mi~q_5 |  -.0000345   9.23e-06    -3.74   0.000    -.0000526   -.0000164
river_mile_6 |   .0179317   .0030448     5.89   0.000     .0119641    .0238994
river_mi~q_6 |  -.0000873   .0000157    -5.57   0.000    -.0001181   -.0000566
river_mile_7 |  -.0004033   .0001893    -2.13   0.033    -.0007744   -.0000321
river_mi~q_7 |   7.59e-08   1.23e-07     0.62   0.538    -1.65e-07    3.17e-07
river_mile_8 |   -.001203   .0001598    -7.53   0.000    -.0015162   -.0008897
river_mi~q_8 |   4.40e-07   8.46e-08     5.20   0.000     2.74e-07    6.06e-07
river_mile_9 |   .0003573   .0004239     0.84   0.399    -.0004735    .0011882
river_mi~q_9 |   4.38e-07   5.57e-07     0.79   0.431    -6.53e-07    1.53e-06
river_m~e_10 |  -.0016087   .0007752    -2.08   0.038    -.0031281   -.0000892
river_m~q_10 |   2.47e-07   1.22e-06     0.20   0.840    -2.15e-06    2.65e-06
river_m~e_11 |  -.0041425   .0006648    -6.23   0.000    -.0054455   -.0028394
river_m~q_11 |   4.62e-06   1.10e-06     4.21   0.000     2.47e-06    6.78e-06
river_m~e_12 |  -.0007961   .0011105    -0.72   0.473    -.0029727    .0013806
river_m~q_12 |  -4.75e-07   2.65e-06    -0.18   0.858    -5.68e-06    4.73e-06
       _cons |   .9596757   .0964272     9.95   0.000     .7706818     1.14867
------------------------------------------------------------------------------
Instrumented:  has_bridge
Instruments:   river_mile_1 river_mile_sq_1 river_mile_2 river_mile_sq_2
               river_mile_3 river_mile_sq_3 river_mile_4 river_mile_sq_4
               river_mile_5 river_mile_sq_5 river_mile_6 river_mile_sq_6
               river_mile_7 river_mile_sq_7 river_mile_8 river_mile_sq_8
               river_mile_9 river_mile_sq_9 river_mile_10 river_mile_sq_10
               river_mile_11 river_mile_sq_11 river_mile_12 river_mile_sq_12
               water_covered_area L.water_covered_area F.water_covered_area
               crossing_points F.crossing_points L.crossing_points

. outreg2 using output/bridges_iv.tex, tex(frag) append label
output/bridges_iv.tex
dir : seeout

. 
. /*
> Instrumental variables (2SLS) regression               Number of obs =     90
> 7
>                                                        F( 23,   399) =   27.0
> 3
>                                                        Prob > F      =  0.000
> 0
>                                                        R-squared     =  0.473
> 9
>                                                        Root MSE      =  .5637
> 2
> 
>                                   (Std. Err. adjusted for 400 clusters in clu
> ster)
> -----------------------------------------------------------------------------
> -----
>                  |               Robust
> log_post_offic~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Inte
> rval]
> -----------------+-----------------------------------------------------------
> -----
>          bridges |    .136285   .2181477     0.62   0.533    -.2925776    .56
> 51476
> 
> */
. 
end of do-file
