
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.0   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501306004725
         Licensed to:  Miklos Koren
                       Central European University

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode

. do iv 

. set more off

. set matsize 5000, permanently
(set matsize preference recorded)

. local RIVERS arkansas colorado columbia connecticut delaware hudson ohio red 
> snake tennessee missouri  mississippi

. tempfile rivers

. clear

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved

. 
. foreach river in `RIVERS' {
  2.         insheet using output/`river'.csv, clear
  3.         gen location = _n
  4.         gen str river = "`river'"
  5.         append using `rivers'
  6.         save `rivers', replace
  7. }
(5 vars, 118 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 166 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 112 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 44 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 51 obs)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 44 obs)
(note: variable river was str6, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 154 obs)
(note: variable river was str4, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 125 obs)
(note: variable river was str3, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 130 obs)
(note: variable river was str5, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 82 obs)
(note: variable river was str9, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 345 obs)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved
(5 vars, 299 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St94845.000001 saved

. 
. egen river_number = group(river)

. su river_number

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
river_number |      1670    6.816766    3.190941          1         12

. local N = r(max)

. 
. forval n=1/`N' {
  2.         gen river_mile_`n' = river_mile*(river_number==`n')
  3.         gen river_mile_sq_`n' = river_mile^2*(river_number==`n')
  4. }

. 
. gen segment = int(river_mile*1.6/30)

. egen cluster = group(river segment)

. 
. gen log_post_office_count = log(post_office_count)
(496 missing values generated)

. gen byte has_bridge = bridges>0 & !missing(bridges)

. 
. tsset river_number location
       panel variable:  river_number (unbalanced)
        time variable:  location, 1 to 345
                delta:  1 unit

. 
. reg bridges river_mile_* water_covered_area crossing_points, robust

Linear regression                                      Number of obs =    1670
                                                       F( 26,  1643) =    6.11
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0819
                                                       Root MSE      =  .96684

------------------------------------------------------------------------------
             |               Robust
     bridges |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
river_mile_1 |     .00123   .0008835     1.39   0.164    -.0005028    .0029629
river_mi~q_1 |  -1.49e-06   1.52e-06    -0.98   0.326    -4.47e-06    1.49e-06
river_mile_2 |  -.0009517   .0003043    -3.13   0.002    -.0015485   -.0003549
river_mi~q_2 |   9.59e-07   3.38e-07     2.83   0.005     2.95e-07    1.62e-06
river_mile_3 |   .0002532   .0007626     0.33   0.740    -.0012425    .0017489
river_mi~q_3 |  -3.59e-07   1.33e-06    -0.27   0.787    -2.97e-06    2.25e-06
river_mile_4 |    .016884   .0065363     2.58   0.010     .0040637    .0297044
river_mi~q_4 |  -.0000612   .0000276    -2.22   0.027    -.0001152   -7.07e-06
river_mile_5 |   .0093071   .0032019     2.91   0.004     .0030269    .0155873
river_mi~q_5 |  -.0000268   .0000121    -2.21   0.027    -.0000505   -3.02e-06
river_mile_6 |   .0058551   .0028503     2.05   0.040     .0002646    .0114456
river_mi~q_6 |  -.0000212   .0000121    -1.75   0.081    -.0000449    2.60e-06
river_mile_7 |   .0001737   .0002864     0.61   0.544     -.000388    .0007354
river_mi~q_7 |   1.16e-07   2.01e-07     0.58   0.564    -2.78e-07    5.10e-07
river_mile_8 |   .0002343   .0001807     1.30   0.195    -.0001202    .0005888
river_mi~q_8 |  -1.55e-07   9.71e-08    -1.60   0.111    -3.45e-07    3.55e-08
river_mile_9 |  -.0002243   .0009385    -0.24   0.811    -.0020651    .0016165
river_mi~q_9 |   1.39e-06   1.19e-06     1.17   0.244    -9.45e-07    3.72e-06
river_m~e_10 |  -.0001582   .0006683    -0.24   0.813     -.001469    .0011527
river_m~q_10 |  -1.88e-07   1.03e-06    -0.18   0.855    -2.21e-06    1.83e-06
river_m~e_11 |   -.000257   .0005858    -0.44   0.661     -.001406    .0008919
river_m~q_11 |   3.80e-07   8.45e-07     0.45   0.653    -1.28e-06    2.04e-06
river_m~e_12 |   .0009711   .0009745     1.00   0.319    -.0009403    .0028825
river_m~q_12 |  -2.14e-06   2.05e-06    -1.04   0.297    -6.17e-06    1.89e-06
water_cove~a |  -.6254796   .1221625    -5.12   0.000    -.8650902    -.385869
crossing_p~s |   .0537433    .051979     1.03   0.301    -.0482087    .1556954
       _cons |   .3265985   .0618846     5.28   0.000     .2052175    .4479796
------------------------------------------------------------------------------

. test water_covered_area crossing_points

 ( 1)  water_covered_area = 0
 ( 2)  crossing_points = 0

       F(  2,  1643) =   13.54
            Prob > F =    0.0000

.  
. ivregress 2sls log_post_office_count (bridges = water_covered_area L.water_co
> vered_area F.water_covered_area crossing_points F.crossing_points L.crossing_
> points) river_mile_*, robust first

First-stage regressions
-----------------------

                                                  Number of obs   =       1155
                                                  F(  30,   1124) =       2.92
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0684
                                                  Adj R-squared   =     0.0435
                                                  Root MSE        =     1.1298

------------------------------------------------------------------------------
             |               Robust
     bridges |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
river_mile_1 |   .0018416   .0010867     1.69   0.090    -.0002906    .0039738
river_mi~q_1 |  -2.00e-06   1.85e-06    -1.08   0.280    -5.63e-06    1.63e-06
river_mile_2 |   .0001517   .0010626     0.14   0.887    -.0019332    .0022366
river_mi~q_2 |  -8.55e-08   1.11e-06    -0.08   0.939    -2.26e-06    2.09e-06
river_mile_3 |   .0006951   .0009584     0.73   0.468    -.0011853    .0025755
river_mi~q_3 |  -6.30e-07   1.67e-06    -0.38   0.705    -3.90e-06    2.64e-06
river_mile_4 |   .0160994   .0068966     2.33   0.020     .0025678     .029631
river_mi~q_4 |  -.0000571   .0000296    -1.93   0.054    -.0001152    9.81e-07
river_mile_5 |   .0101879   .0034756     2.93   0.003     .0033686    .0170072
river_mi~q_5 |  -.0000301   .0000134    -2.24   0.025    -.0000565   -3.78e-06
river_mile_6 |   .0051264   .0031853     1.61   0.108    -.0011234    .0113762
river_mi~q_6 |  -.0000156   .0000143    -1.09   0.276    -.0000437    .0000125
river_mile_7 |   .0002276   .0003492     0.65   0.515    -.0004576    .0009129
river_mi~q_7 |   1.44e-07   2.50e-07     0.57   0.566    -3.47e-07    6.35e-07
river_mile_8 |   .0005474   .0002747     1.99   0.047     8.40e-06    .0010864
river_mi~q_8 |  -2.73e-07   1.50e-07    -1.82   0.069    -5.67e-07    2.13e-08
river_mile_9 |  -.0001116   .0010018    -0.11   0.911    -.0020773    .0018541
river_mi~q_9 |   1.14e-06   1.26e-06     0.91   0.365    -1.32e-06    3.60e-06
river_m~e_10 |  -.0001463   .0011123    -0.13   0.895    -.0023287    .0020362
river_m~q_10 |  -3.27e-07   1.93e-06    -0.17   0.865    -4.11e-06    3.46e-06
river_m~e_11 |  -.0000442   .0010009    -0.04   0.965    -.0020081    .0019196
river_m~q_11 |   4.02e-07   1.55e-06     0.26   0.796    -2.65e-06    3.45e-06
river_m~e_12 |   .0016823   .0012406     1.36   0.175    -.0007519    .0041164
river_m~q_12 |  -3.54e-06   2.60e-06    -1.36   0.173    -8.65e-06    1.56e-06
             |
water_cove~a |
         --. |  -1.373476   .5011628    -2.74   0.006    -2.356796   -.3901563
         L1. |  -.3334875   .3553982    -0.94   0.348    -1.030806    .3638311
         F1. |   .6954181   .5446287     1.28   0.202    -.3731853    1.764021
             |
crossing_p~s |
         --. |   .0391162   .0612684     0.64   0.523    -.0810972    .1593295
         F1. |  -.0158083   .0628687    -0.25   0.802    -.1391615     .107545
         L1. |   .0527847   .0659883     0.80   0.424    -.0766893    .1822588
             |
       _cons |   .3587506   .0891032     4.03   0.000     .1839232     .533578
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression               Number of obs =    1155
                                                       Wald chi2(25) =  847.16
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.3675
                                                       Root MSE      =  .57912

------------------------------------------------------------------------------
             |               Robust
log_post_o~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bridges |   .2316948   .1251211     1.85   0.064    -.0135381    .4769278
river_mile_1 |   -.002819   .0005821    -4.84   0.000      -.00396   -.0016781
river_mi~q_1 |   2.58e-06   9.11e-07     2.83   0.005     7.89e-07    4.36e-06
river_mile_2 |  -.0038248   .0007381    -5.18   0.000    -.0052714   -.0023782
river_mi~q_2 |   3.15e-06   7.64e-07     4.13   0.000     1.65e-06    4.65e-06
river_mile_3 |  -.0017772   .0006561    -2.71   0.007    -.0030632   -.0004913
river_mi~q_3 |   1.63e-06   1.10e-06     1.47   0.140    -5.36e-07    3.80e-06
river_mile_4 |   .0032871   .0032804     1.00   0.316    -.0031424    .0097166
river_mi~q_4 |  -.0000153   .0000142    -1.08   0.282    -.0000431    .0000125
river_mile_5 |   .0110207   .0022479     4.90   0.000     .0066149    .0154265
river_mi~q_5 |  -.0000372   8.10e-06    -4.60   0.000    -.0000531   -.0000214
river_mile_6 |   .0183264   .0027068     6.77   0.000      .013021    .0236317
river_mi~q_6 |  -.0000864   .0000141    -6.13   0.000     -.000114   -.0000587
river_mile_7 |  -.0004697   .0001833    -2.56   0.010    -.0008291   -.0001104
river_mi~q_7 |   9.26e-08   1.18e-07     0.78   0.434    -1.39e-07    3.24e-07
river_mile_8 |  -.0012356   .0001573    -7.86   0.000    -.0015438   -.0009273
river_mi~q_8 |   4.56e-07   8.22e-08     5.54   0.000     2.94e-07    6.17e-07
river_mile_9 |   .0002891   .0004516     0.64   0.522     -.000596    .0011742
river_mi~q_9 |   5.31e-07   5.68e-07     0.93   0.350    -5.83e-07    1.64e-06
river_m~e_10 |  -.0017657   .0007238    -2.44   0.015    -.0031842   -.0003471
river_m~q_10 |   5.04e-07   1.17e-06     0.43   0.665    -1.78e-06    2.79e-06
river_m~e_11 |  -.0040953   .0006408    -6.39   0.000    -.0053512   -.0028394
river_m~q_11 |   4.60e-06   1.07e-06     4.28   0.000     2.50e-06    6.71e-06
river_m~e_12 |  -.0005949   .0010492    -0.57   0.571    -.0026513    .0014616
river_m~q_12 |  -1.01e-06   2.52e-06    -0.40   0.690    -5.95e-06    3.93e-06
       _cons |   1.007695   .0691746    14.57   0.000     .8721149    1.143274
------------------------------------------------------------------------------
Instrumented:  bridges
Instruments:   river_mile_1 river_mile_sq_1 river_mile_2 river_mile_sq_2
               river_mile_3 river_mile_sq_3 river_mile_4 river_mile_sq_4
               river_mile_5 river_mile_sq_5 river_mile_6 river_mile_sq_6
               river_mile_7 river_mile_sq_7 river_mile_8 river_mile_sq_8
               river_mile_9 river_mile_sq_9 river_mile_10 river_mile_sq_10
               river_mile_11 river_mile_sq_11 river_mile_12 river_mile_sq_12
               water_covered_area L.water_covered_area F.water_covered_area
               crossing_points F.crossing_points L.crossing_points

. ivregress 2sls log_post_office_count (has_bridge = water_covered_area L.water
> _covered_area F.water_covered_area crossing_points F.crossing_points L.crossi
> ng_points) river_mile_*, robust first

First-stage regressions
-----------------------

                                                  Number of obs   =       1155
                                                  F(  30,   1124) =       4.33
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0989
                                                  Adj R-squared   =     0.0748
                                                  Root MSE        =     0.4363

------------------------------------------------------------------------------
             |               Robust
  has_bridge |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
river_mile_1 |   .0008087   .0005055     1.60   0.110    -.0001832    .0018005
river_mi~q_1 |  -8.03e-07   8.46e-07    -0.95   0.342    -2.46e-06    8.56e-07
river_mile_2 |  -.0003485   .0005372    -0.65   0.517    -.0014025    .0007055
river_mi~q_2 |   4.87e-07   5.69e-07     0.86   0.393    -6.30e-07    1.60e-06
river_mile_3 |   .0004447   .0005308     0.84   0.402    -.0005967    .0014861
river_mi~q_3 |  -5.22e-07   9.28e-07    -0.56   0.574    -2.34e-06    1.30e-06
river_mile_4 |   .0057134   .0020885     2.74   0.006     .0016155    .0098112
river_mi~q_4 |  -.0000168   9.76e-06    -1.72   0.087    -.0000359    2.41e-06
river_mile_5 |   .0060592   .0015413     3.93   0.000     .0030351    .0090833
river_mi~q_5 |  -.0000168   6.35e-06    -2.65   0.008    -.0000293   -4.37e-06
river_mile_6 |    .002537   .0021237     1.19   0.232    -.0016298    .0067038
river_mi~q_6 |  -3.95e-06   .0000105    -0.38   0.707    -.0000245    .0000166
river_mile_7 |  -.0000251   .0001347    -0.19   0.852    -.0002894    .0002392
river_mi~q_7 |   8.20e-08   8.36e-08     0.98   0.327    -8.20e-08    2.46e-07
river_mile_8 |   .0001471   .0001261     1.17   0.244    -.0001004    .0003947
river_mi~q_8 |  -7.95e-08   6.69e-08    -1.19   0.235    -2.11e-07    5.17e-08
river_mile_9 |  -.0001437   .0003172    -0.45   0.651    -.0007661    .0004788
river_mi~q_9 |   6.04e-07   3.97e-07     1.52   0.128    -1.74e-07    1.38e-06
river_m~e_10 |   -.000258   .0005101    -0.51   0.613    -.0012588    .0007428
river_m~q_10 |   1.82e-07   9.19e-07     0.20   0.843    -1.62e-06    1.99e-06
river_m~e_11 |   .0000492   .0004988     0.10   0.921    -.0009295    .0010279
river_m~q_11 |   1.31e-07   7.71e-07     0.17   0.865    -1.38e-06    1.64e-06
river_m~e_12 |   .0009397   .0007448     1.26   0.207    -.0005217    .0024012
river_m~q_12 |  -2.20e-06   1.62e-06    -1.35   0.176    -5.38e-06    9.87e-07
             |
water_cove~a |
         --. |  -.4988721   .2005679    -2.49   0.013    -.8924018   -.1053424
         L1. |  -.0052359   .1833136    -0.03   0.977    -.3649113    .3544395
         F1. |   .1427472    .186384     0.77   0.444    -.2229525    .5084469
             |
crossing_p~s |
         --. |  -.0277655   .0261148    -1.06   0.288    -.0790047    .0234738
         F1. |  -.0016756   .0250368    -0.07   0.947    -.0507997    .0474485
         L1. |   .0255335   .0258216     0.99   0.323    -.0251304    .0761974
             |
       _cons |   .2367699   .0409705     5.78   0.000     .1563827    .3171571
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression               Number of obs =    1155
                                                       Wald chi2(25) =  861.33
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.3669
                                                       Root MSE      =  .57936

------------------------------------------------------------------------------
             |               Robust
log_post_o~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  has_bridge |   .5798648   .3668092     1.58   0.114     -.139068    1.298798
river_mile_1 |  -.0028431   .0006211    -4.58   0.000    -.0040603   -.0016258
river_mi~q_1 |   2.53e-06   9.37e-07     2.70   0.007     6.93e-07    4.37e-06
river_mile_2 |  -.0036257   .0007337    -4.94   0.000    -.0050638   -.0021877
river_mi~q_2 |   2.88e-06   7.71e-07     3.74   0.000     1.37e-06    4.39e-06
river_mile_3 |  -.0019035   .0006762    -2.81   0.005    -.0032288   -.0005781
river_mi~q_3 |   1.81e-06   1.16e-06     1.56   0.118    -4.62e-07    4.08e-06
river_mile_4 |   .0035981   .0035451     1.01   0.310    -.0033501    .0105463
river_mi~q_4 |  -.0000185   .0000145    -1.27   0.203    -.0000469    9.97e-06
river_mile_5 |   .0098987   .0028179     3.51   0.000     .0043758    .0154216
river_mi~q_5 |  -.0000345   9.23e-06    -3.74   0.000    -.0000526   -.0000164
river_mile_6 |   .0179317   .0030448     5.89   0.000     .0119641    .0238994
river_mi~q_6 |  -.0000873   .0000157    -5.57   0.000    -.0001181   -.0000566
river_mile_7 |  -.0004033   .0001893    -2.13   0.033    -.0007744   -.0000321
river_mi~q_7 |   7.59e-08   1.23e-07     0.62   0.538    -1.65e-07    3.17e-07
river_mile_8 |   -.001203   .0001598    -7.53   0.000    -.0015162   -.0008897
river_mi~q_8 |   4.40e-07   8.46e-08     5.20   0.000     2.74e-07    6.06e-07
river_mile_9 |   .0003573   .0004239     0.84   0.399    -.0004735    .0011882
river_mi~q_9 |   4.38e-07   5.57e-07     0.79   0.431    -6.53e-07    1.53e-06
river_m~e_10 |  -.0016087   .0007752    -2.08   0.038    -.0031281   -.0000892
river_m~q_10 |   2.47e-07   1.22e-06     0.20   0.840    -2.15e-06    2.65e-06
river_m~e_11 |  -.0041425   .0006648    -6.23   0.000    -.0054455   -.0028394
river_m~q_11 |   4.62e-06   1.10e-06     4.21   0.000     2.47e-06    6.78e-06
river_m~e_12 |  -.0007961   .0011105    -0.72   0.473    -.0029727    .0013806
river_m~q_12 |  -4.75e-07   2.65e-06    -0.18   0.858    -5.68e-06    4.73e-06
       _cons |   .9596757   .0964272     9.95   0.000     .7706818     1.14867
------------------------------------------------------------------------------
Instrumented:  has_bridge
Instruments:   river_mile_1 river_mile_sq_1 river_mile_2 river_mile_sq_2
               river_mile_3 river_mile_sq_3 river_mile_4 river_mile_sq_4
               river_mile_5 river_mile_sq_5 river_mile_6 river_mile_sq_6
               river_mile_7 river_mile_sq_7 river_mile_8 river_mile_sq_8
               river_mile_9 river_mile_sq_9 river_mile_10 river_mile_sq_10
               river_mile_11 river_mile_sq_11 river_mile_12 river_mile_sq_12
               water_covered_area L.water_covered_area F.water_covered_area
               crossing_points F.crossing_points L.crossing_points

. 
. /*
> Instrumental variables (2SLS) regression               Number of obs =     90
> 7
>                                                        F( 23,   399) =   27.0
> 3
>                                                        Prob > F      =  0.000
> 0
>                                                        R-squared     =  0.473
> 9
>                                                        Root MSE      =  .5637
> 2
> 
>                                   (Std. Err. adjusted for 400 clusters in clu
> ster)
> -----------------------------------------------------------------------------
> -----
>                  |               Robust
> log_post_offic~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Inte
> rval]
> -----------------+-----------------------------------------------------------
> -----
>          bridges |    .136285   .2181477     0.62   0.533    -.2925776    .56
> 51476
> 
> */
. 
end of do-file
