
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do iv 

. set more off

. set matsize 5000, permanently
(set matsize preference recorded)

. local RIVERS arkansas colorado columbia connecticut delaware hudson ohio red 
> snake tennessee missouri  mississippi

. tempfile rivers

. clear

. save `rivers', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved

. 
. * historical crossing points at following rivermiles
. local x_connecticut 68 86 144 197

. local x_hudson 42 67 93 154 220

. local x_delaware 128 139 146

. local x_tennessee 190 369 400

. local x_ohio 897 810 626 586 494

. * from 1800 map
. local x_mississippi 64 313 533 658 881 923 

. local x_missouri 130 353 600 770 1020 1179 1354 1575 2095 2260

. local x_arkansas 112 312 364 757

. 
. foreach river in `RIVERS' {
  2.         insheet using output/`river'.csv, clear
  3.         gen location = _n
  4.         gen str river = "`river'"
  5.         
.         * distance to nearest historical crossing
.         local crossings : word count `x_`river''
  6.         forval i=1/`crossings' {
  7.                 local crossing : word `i' of `x_`river''
  8.                 gen distance_`i' = abs(river_mile-`crossing')
  9.         }
 10.         capture egen closest_crossing = rmin(distance_*)
 11.         capture drop distance_*
 12.         
.         append using `rivers'
 13.         save `rivers', replace
 14. }
(5 vars, 118 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 166 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 112 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 44 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 51 obs)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 44 obs)
(note: variable river was str6, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 154 obs)
(note: variable river was str4, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 125 obs)
(note: variable river was str3, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 130 obs)
(note: variable river was str5, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 82 obs)
(note: variable river was str9, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 345 obs)
(note: variable river was str8, now str11 to accommodate using data's values)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved
(5 vars, 299 obs)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St85496.000001 saved

. 
. egen river_number = group(river)

. su river_number

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
river_number |      1,670    6.816766    3.190941          1         12

. local N = r(max)

. 
. forval n=1/`N' {
  2.         gen river_mile_`n' = river_mile*(river_number==`n')
  3.         gen river_mile_sq_`n' = river_mile^2*(river_number==`n')
  4. }

. 
. gen segment = int(river_mile*1.6/30)

. egen cluster = group(river segment)

. 
. gen log_post_office_count = log(post_office_count)
(496 missing values generated)

. gen byte has_bridge = bridges>0 & !missing(bridges)

. 
. tsset river_number location
       panel variable:  river_number (unbalanced)
        time variable:  location, 1 to 345
                delta:  1 unit

. 
. reg bridges river_mile_* water_covered_area crossing_points, robust

Linear regression                               Number of obs     =      1,670
                                                F(26, 1643)       =       6.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0819
                                                Root MSE          =     .96684

------------------------------------------------------------------------------
             |               Robust
     bridges |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
river_mile_1 |     .00123   .0008835     1.39   0.164    -.0005028    .0029629
river_mi~q_1 |  -1.49e-06   1.52e-06    -0.98   0.326    -4.47e-06    1.49e-06
river_mile_2 |  -.0009517   .0003043    -3.13   0.002    -.0015485   -.0003549
river_mi~q_2 |   9.59e-07   3.38e-07     2.83   0.005     2.95e-07    1.62e-06
river_mile_3 |   .0002532   .0007626     0.33   0.740    -.0012425    .0017489
river_mi~q_3 |  -3.59e-07   1.33e-06    -0.27   0.787    -2.97e-06    2.25e-06
river_mile_4 |    .016884   .0065363     2.58   0.010     .0040637    .0297044
river_mi~q_4 |  -.0000612   .0000276    -2.22   0.027    -.0001152   -7.07e-06
river_mile_5 |   .0093071   .0032019     2.91   0.004     .0030269    .0155873
river_mi~q_5 |  -.0000268   .0000121    -2.21   0.027    -.0000505   -3.02e-06
river_mile_6 |   .0058551   .0028503     2.05   0.040     .0002646    .0114456
river_mi~q_6 |  -.0000212   .0000121    -1.75   0.081    -.0000449    2.60e-06
river_mile_7 |   .0001737   .0002864     0.61   0.544     -.000388    .0007354
river_mi~q_7 |   1.16e-07   2.01e-07     0.58   0.564    -2.78e-07    5.10e-07
river_mile_8 |   .0002343   .0001807     1.30   0.195    -.0001202    .0005888
river_mi~q_8 |  -1.55e-07   9.71e-08    -1.60   0.111    -3.45e-07    3.55e-08
river_mile_9 |  -.0002243   .0009385    -0.24   0.811    -.0020651    .0016165
river_mi~q_9 |   1.39e-06   1.19e-06     1.17   0.244    -9.45e-07    3.72e-06
river_m~e_10 |  -.0001582   .0006683    -0.24   0.813     -.001469    .0011527
river_m~q_10 |  -1.88e-07   1.03e-06    -0.18   0.855    -2.21e-06    1.83e-06
river_m~e_11 |   -.000257   .0005858    -0.44   0.661     -.001406    .0008919
river_m~q_11 |   3.80e-07   8.45e-07     0.45   0.653    -1.28e-06    2.04e-06
river_m~e_12 |   .0009711   .0009745     1.00   0.319    -.0009403    .0028825
river_m~q_12 |  -2.14e-06   2.05e-06    -1.04   0.297    -6.17e-06    1.89e-06
water_cove~a |  -.6254796   .1221625    -5.12   0.000    -.8650902    -.385869
crossing_p~s |   .0537433    .051979     1.03   0.301    -.0482087    .1556954
       _cons |   .3265985   .0618846     5.28   0.000     .2052175    .4479796
------------------------------------------------------------------------------

. test water_covered_area crossing_points

 ( 1)  water_covered_area = 0
 ( 2)  crossing_points = 0

       F(  2,  1643) =   13.54
            Prob > F =    0.0000

. 
. label var log_post_office_count "Number of post offices (log)"

. label var bridges "Number of bridges"

. label var has_bridge "Segment has a bridge (dummy)"

. label var water_covered_area "Width of the river"

. label var crossing_points "Number of predicted crossing points"

. 
. * a cycle of potential bridges every 30 miles
. gen cycle = cos(closest_crossing/30*2*c(pi))
(533 missing values generated)

. gen within_10mi = closest_crossing<=10

. 
. local instruments closest_crossing F.closest_crossing L.closest_crossing wate
> r_covered_area L.water_covered_area F.water_covered_area

. 
. reg bridges `instruments' river_mile_*, robust
note: river_mile_2 omitted because of collinearity
note: river_mile_sq_2 omitted because of collinearity
note: river_mile_3 omitted because of collinearity
note: river_mile_sq_3 omitted because of collinearity
note: river_mile_10 omitted because of collinearity
note: river_mile_sq_10 omitted because of collinearity
note: river_mile_11 omitted because of collinearity
note: river_mile_sq_11 omitted because of collinearity

Linear regression                               Number of obs     =      1,121
                                                F(22, 1098)       =       5.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0850
                                                Root MSE          =     1.0961

------------------------------------------------------------------------------
             |               Robust
     bridges |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
closest_cr~g |
         --. |  -.0861537   .0404851    -2.13   0.034    -.1655906   -.0067167
         F1. |   .0416431    .020616     2.02   0.044     .0011918    .0820944
         L1. |   .0438666   .0201236     2.18   0.029     .0043816    .0833516
             |
water_cove~a |
         --. |  -1.221743   .4222492    -2.89   0.004    -2.050249   -.3932362
         L1. |  -.1935912   .2603028    -0.74   0.457    -.7043383    .3171559
         F1. |   .6915667   .4571375     1.51   0.131    -.2053951    1.588528
             |
river_mile_1 |   .0008652   .0009982     0.87   0.386    -.0010934    .0028238
river_mi~q_1 |  -9.93e-07   1.67e-06    -0.60   0.552    -4.27e-06    2.28e-06
river_mile_2 |          0  (omitted)
river_mi~q_2 |          0  (omitted)
river_mile_3 |          0  (omitted)
river_mi~q_3 |          0  (omitted)
river_mile_4 |   .0142421   .0068196     2.09   0.037     .0008613    .0276229
river_mi~q_4 |  -.0000506   .0000292    -1.73   0.083    -.0001078    6.65e-06
river_mile_5 |   .0073568   .0035849     2.05   0.040     .0003228    .0143908
river_mi~q_5 |  -.0000188   .0000137    -1.37   0.171    -.0000458    8.15e-06
river_mile_6 |   .0040368   .0031455     1.28   0.200    -.0021351    .0102087
river_mi~q_6 |  -.0000148   .0000133    -1.11   0.268    -.0000409    .0000114
river_mile_7 |  -.0001459   .0003798    -0.38   0.701    -.0008911    .0005993
river_mi~q_7 |   4.42e-07   2.84e-07     1.56   0.119    -1.15e-07    9.99e-07
river_mile_8 |   .0001028   .0002272     0.45   0.651    -.0003429    .0005486
river_mi~q_8 |  -9.71e-08   1.13e-07    -0.86   0.391    -3.19e-07    1.25e-07
river_mile_9 |  -.0000175   .0010132    -0.02   0.986    -.0020055    .0019705
river_mi~q_9 |   9.32e-07   1.30e-06     0.71   0.475    -1.63e-06    3.49e-06
river_m~e_10 |          0  (omitted)
river_m~q_10 |          0  (omitted)
river_m~e_11 |          0  (omitted)
river_m~q_11 |          0  (omitted)
river_m~e_12 |   .0002731   .0011919     0.23   0.819    -.0020656    .0026117
river_m~q_12 |  -7.84e-07   2.46e-06    -0.32   0.750    -5.62e-06    4.05e-06
       _cons |   .4552541   .1125613     4.04   0.000     .2343945    .6761137
------------------------------------------------------------------------------

. predict predicted_bridges
(option xb assumed; fitted values)
(549 missing values generated)

. outreg2 using output/bridges_first_stage.tex, tex(frag) replace label
output/bridges_first_stage.tex
dir : seeout

. 
. reg has_bridge `instruments' river_mile_*, robust
note: river_mile_2 omitted because of collinearity
note: river_mile_sq_2 omitted because of collinearity
note: river_mile_3 omitted because of collinearity
note: river_mile_sq_3 omitted because of collinearity
note: river_mile_10 omitted because of collinearity
note: river_mile_sq_10 omitted because of collinearity
note: river_mile_11 omitted because of collinearity
note: river_mile_sq_11 omitted because of collinearity

Linear regression                               Number of obs     =      1,121
                                                F(22, 1098)       =       7.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1223
                                                Root MSE          =     .41454

------------------------------------------------------------------------------
             |               Robust
  has_bridge |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
closest_cr~g |
         --. |  -.0162806   .0097883    -1.66   0.097    -.0354864    .0029252
         F1. |   .0078436   .0050357     1.56   0.120    -.0020371    .0177244
         L1. |   .0081559   .0050737     1.61   0.108    -.0017993    .0181111
             |
water_cove~a |
         --. |   -.390071   .1743565    -2.24   0.025    -.7321806   -.0479613
         L1. |   .0170918   .1401436     0.12   0.903    -.2578877    .2920713
         F1. |   .1010986   .1440139     0.70   0.483    -.1814749     .383672
             |
river_mile_1 |   .0002008   .0004805     0.42   0.676    -.0007419    .0011436
river_mi~q_1 |  -1.42e-07   7.81e-07    -0.18   0.856    -1.67e-06    1.39e-06
river_mile_2 |          0  (omitted)
river_mi~q_2 |          0  (omitted)
river_mile_3 |          0  (omitted)
river_mi~q_3 |          0  (omitted)
river_mile_4 |    .004864   .0021269     2.29   0.022     .0006908    .0090372
river_mi~q_4 |  -.0000139   9.84e-06    -1.41   0.158    -.0000332    5.41e-06
river_mile_5 |   .0043599   .0016129     2.70   0.007     .0011952    .0075246
river_mi~q_5 |  -.0000105   6.55e-06    -1.60   0.109    -.0000233    2.35e-06
river_mile_6 |   .0023246   .0020304     1.14   0.253    -.0016594    .0063086
river_mi~q_6 |  -5.91e-06   9.59e-06    -0.62   0.538    -.0000247    .0000129
river_mile_7 |  -.0002463   .0001643    -1.50   0.134    -.0005688    .0000762
river_mi~q_7 |   2.52e-07   1.23e-07     2.04   0.041     9.97e-09    4.94e-07
river_mile_8 |  -.0000988    .000113    -0.87   0.382    -.0003206     .000123
river_mi~q_8 |   1.92e-08   5.57e-08     0.34   0.730    -9.00e-08    1.28e-07
river_mile_9 |  -.0001832   .0003202    -0.57   0.567    -.0008114     .000445
river_mi~q_9 |   5.69e-07   4.06e-07     1.40   0.162    -2.28e-07    1.37e-06
river_m~e_10 |          0  (omitted)
river_m~q_10 |          0  (omitted)
river_m~e_11 |          0  (omitted)
river_m~q_11 |          0  (omitted)
river_m~e_12 |   .0001126   .0007216     0.16   0.876    -.0013033    .0015284
river_m~q_12 |  -4.83e-07   1.62e-06    -0.30   0.766    -3.67e-06    2.70e-06
       _cons |   .2880248   .0509949     5.65   0.000     .1879663    .3880832
------------------------------------------------------------------------------

. outreg2 using output/bridges_first_stage, tex(frag) append label
output/bridges_first_stage.tex
dir : seeout

.  
. ivregress 2sls log_post_office_count (bridges = `instruments') river_mile_*, 
> robust
note: river_mile_2 omitted because of collinearity
note: river_mile_sq_2 omitted because of collinearity
note: river_mile_3 omitted because of collinearity
note: river_mile_sq_3 omitted because of collinearity
note: river_mile_10 omitted because of collinearity
note: river_mile_sq_10 omitted because of collinearity
note: river_mile_11 omitted because of collinearity
note: river_mile_sq_11 omitted because of collinearity

Instrumental variables (2SLS) regression          Number of obs   =        892
                                                  Wald chi2(17)   =     549.00
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2112
                                                  Root MSE        =     .65994

------------------------------------------------------------------------------
             |               Robust
log_post_o~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bridges |   .3710596   .1175355     3.16   0.002     .1406942    .6014251
river_mile_1 |  -.0031439   .0006464    -4.86   0.000    -.0044109   -.0018769
river_mi~q_1 |   2.91e-06   1.02e-06     2.85   0.004     9.07e-07    4.92e-06
river_mile_2 |          0  (omitted)
river_mi~q_2 |          0  (omitted)
river_mile_3 |          0  (omitted)
river_mi~q_3 |          0  (omitted)
river_mile_4 |   .0007278   .0033063     0.22   0.826    -.0057524    .0072079
river_mi~q_4 |  -6.30e-06   .0000141    -0.45   0.654    -.0000339    .0000212
river_mile_5 |   .0094389   .0023895     3.95   0.000     .0047555    .0141224
river_mi~q_5 |  -.0000328   8.64e-06    -3.80   0.000    -.0000498   -.0000159
river_mile_6 |    .017534    .002898     6.05   0.000      .011854     .023214
river_mi~q_6 |  -.0000843   .0000151    -5.60   0.000    -.0001138   -.0000548
river_mile_7 |  -.0005134   .0002198    -2.34   0.019    -.0009442   -.0000826
river_mi~q_7 |   7.61e-08   1.40e-07     0.54   0.587    -1.99e-07    3.51e-07
river_mile_8 |  -.0013269    .000181    -7.33   0.000    -.0016817   -.0009721
river_mi~q_8 |   5.01e-07   9.17e-08     5.47   0.000     3.22e-07    6.81e-07
river_mile_9 |   .0002261   .0005565     0.41   0.685    -.0008646    .0013167
river_mi~q_9 |   4.31e-07   7.01e-07     0.61   0.539    -9.43e-07    1.81e-06
river_m~e_10 |          0  (omitted)
river_m~q_10 |          0  (omitted)
river_m~e_11 |          0  (omitted)
river_m~q_11 |          0  (omitted)
river_m~e_12 |  -.0008211   .0011153    -0.74   0.462     -.003007    .0013649
river_m~q_12 |  -5.55e-07   2.60e-06    -0.21   0.831    -5.66e-06    4.55e-06
       _cons |   .9835241   .0822836    11.95   0.000     .8222512    1.144797
------------------------------------------------------------------------------
Instrumented:  bridges
Instruments:   river_mile_1 river_mile_sq_1 river_mile_4 river_mile_sq_4
               river_mile_5 river_mile_sq_5 river_mile_6 river_mile_sq_6
               river_mile_7 river_mile_sq_7 river_mile_8 river_mile_sq_8
               river_mile_9 river_mile_sq_9 river_mile_12 river_mile_sq_12
               closest_crossing F.closest_crossing L.closest_crossing
               water_covered_area L.water_covered_area F.water_covered_area

. outreg2 using output/bridges_iv.tex, tex(frag) replace label
output/bridges_iv.tex
dir : seeout

. 
. ivregress 2sls log_post_office_count (has_bridge = `instruments') river_mile_
> *, robust
note: river_mile_2 omitted because of collinearity
note: river_mile_sq_2 omitted because of collinearity
note: river_mile_3 omitted because of collinearity
note: river_mile_sq_3 omitted because of collinearity
note: river_mile_10 omitted because of collinearity
note: river_mile_sq_10 omitted because of collinearity
note: river_mile_11 omitted because of collinearity
note: river_mile_sq_11 omitted because of collinearity

Instrumental variables (2SLS) regression          Number of obs   =        892
                                                  Wald chi2(17)   =     390.75
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .75678

------------------------------------------------------------------------------
             |               Robust
log_post_o~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  has_bridge |   1.381684   .4530863     3.05   0.002     .4936506    2.269716
river_mile_1 |  -.0032652   .0008515    -3.83   0.000    -.0049342   -.0015963
river_mi~q_1 |   2.84e-06   1.33e-06     2.13   0.033     2.22e-07    5.45e-06
river_mile_2 |          0  (omitted)
river_mi~q_2 |          0  (omitted)
river_mile_3 |          0  (omitted)
river_mi~q_3 |          0  (omitted)
river_mile_4 |  -.0008866   .0042807    -0.21   0.836    -.0092766    .0075034
river_mi~q_4 |  -5.31e-06   .0000168    -0.32   0.753    -.0000383    .0000277
river_mile_5 |   .0054632   .0034549     1.58   0.114    -.0013083    .0122347
river_mi~q_5 |  -.0000226   .0000118    -1.93   0.054    -.0000457    3.90e-07
river_mile_6 |   .0165575   .0041847     3.96   0.000     .0083556    .0247594
river_mi~q_6 |  -.0000872   .0000219    -3.98   0.000    -.0001301   -.0000442
river_mile_7 |  -.0002714   .0002677    -1.01   0.311    -.0007961    .0002534
river_mi~q_7 |  -4.89e-08   1.69e-07    -0.29   0.772    -3.80e-07    2.82e-07
river_mile_8 |  -.0012347   .0002211    -5.59   0.000     -.001668   -.0008014
river_mi~q_8 |   4.70e-07   1.15e-07     4.09   0.000     2.45e-07    6.96e-07
river_mile_9 |   .0005696   .0005782     0.99   0.325    -.0005636    .0017028
river_mi~q_9 |  -1.45e-07   7.46e-07    -0.19   0.846    -1.61e-06    1.32e-06
river_m~e_10 |          0  (omitted)
river_m~q_10 |          0  (omitted)
river_m~e_11 |          0  (omitted)
river_m~q_11 |          0  (omitted)
river_m~e_12 |  -.0010702   .0014223    -0.75   0.452    -.0038578    .0017175
river_m~q_12 |   4.13e-07   3.25e-06     0.13   0.899    -5.96e-06    6.79e-06
       _cons |    .773461   .1391433     5.56   0.000      .500745    1.046177
------------------------------------------------------------------------------
Instrumented:  has_bridge
Instruments:   river_mile_1 river_mile_sq_1 river_mile_4 river_mile_sq_4
               river_mile_5 river_mile_sq_5 river_mile_6 river_mile_sq_6
               river_mile_7 river_mile_sq_7 river_mile_8 river_mile_sq_8
               river_mile_9 river_mile_sq_9 river_mile_12 river_mile_sq_12
               closest_crossing F.closest_crossing L.closest_crossing
               water_covered_area L.water_covered_area F.water_covered_area

. outreg2 using output/bridges_iv.tex, tex(frag) append label
output/bridges_iv.tex
dir : seeout

. 
. /*
> Instrumental variables (2SLS) regression               Number of obs =     90
> 7
>                                                        F( 23,   399) =   27.0
> 3
>                                                        Prob > F      =  0.000
> 0
>                                                        R-squared     =  0.473
> 9
>                                                        Root MSE      =  .5637
> 2
> 
>                                   (Std. Err. adjusted for 400 clusters in clu
> ster)
> -----------------------------------------------------------------------------
> -----
>                  |               Robust
> log_post_offic~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Inte
> rval]
> -----------------+-----------------------------------------------------------
> -----
>          bridges |    .136285   .2181477     0.62   0.533    -.2925776    .56
> 51476
> 
> */
. 
end of do-file
